package com.example.demo.test;

import com.example.demo.wxTemplateMsg.ShOrders;
import net.sf.json.JSONObject;
import org.springframework.boot.autoconfigure.web.servlet.WebMvcRegistrations;
import org.springframework.core.MethodIntrospector;
import org.springframework.core.annotation.AnnotatedElementUtils;
import org.springframework.stereotype.Controller;
import org.springframework.util.ReflectionUtils;
import org.springframework.web.bind.annotation.InitBinder;
import org.springframework.web.bind.annotation.RequestMapping;
import org.springframework.web.bind.annotation.RequestMethod;
import org.springframework.web.bind.annotation.ResponseBody;
import org.springframework.web.servlet.DispatcherServlet;
import org.springframework.web.servlet.HandlerAdapter;
import org.springframework.web.servlet.HandlerMapping;
import org.springframework.web.servlet.ViewResolver;
import org.springframework.web.servlet.handler.AbstractHandlerMethodMapping;

import javax.servlet.http.HttpServletRequest;
import java.lang.reflect.AnnotatedElement;
import java.lang.reflect.InvocationTargetException;
import java.lang.reflect.Method;
import java.nio.ByteBuffer;
import java.util.*;
import java.util.concurrent.ConcurrentHashMap;
import java.util.concurrent.ThreadPoolExecutor;
import java.util.concurrent.locks.ReadWriteLock;
import java.util.concurrent.locks.ReentrantReadWriteLock;

@Controller
public class Test2{

    private static ConcurrentHashMap<String, Integer> concurrentHashMap = new ConcurrentHashMap();
    //private static HashMap<String, Integer> concurrentHashMap=new HashMap();
    private static final ReadWriteLock lock = new ReentrantReadWriteLock();

    @RequestMapping(value = "tt",method = RequestMethod.GET)
    @ResponseBody
    public void tt(String a,String b, HttpServletRequest request){
        request.setAttribute("wewe","121232");
        System.out.println(a);

    }
    @RequestMapping(value = "ff",method = RequestMethod.GET)
    @ResponseBody
    public void ff(String a, HttpServletRequest request){
        request.setAttribute("ffff","121232");
        System.out.println(a);


    }

    //public static void main(String[] args) {
        /*DispatcherServlet
        HandlerAdapter
        HandlerMapping
        ViewResolver*/
        //AbstractHandlerMethodMapping
        //Arrays
    //}

/*    public static void main(String[] args) {
        int num = 6;//局部变量
        Sum sum = value -> {
//            num = 8; 这里会编译出错
            return num + value;
        };
        sum.add(8);
    }

    *//**
     * 函数式接口
     */
    @FunctionalInterface
    interface Sum{
        int add(int value);
    }

    public static final ReflectionUtils.MethodFilter INIT_BINDER_METHODS = method ->
                    AnnotatedElementUtils.hasAnnotation(method, InitBinder.class);

   /* public static void main(String[] args) {
        Set<Method> a = MethodIntrospector.selectMethods(Test2.class, INIT_BINDER_METHODS);
        System.out.println(11);
    }
*/

   public static void a(String a){
       System.out.println(a);

   }

    public static void main(String[] args) {
        Class<Test2> a = Test2.class;
        /*Method[] b = a.getMethods();
        for(Method c:b){
            System.out.println(((AnnotatedElement)c).isAnnotationPresent(ResponseBody.class));//判断该方法上是否有此注解
        }*/

        Runnable runnable=()->{
                Test2.a("232");
        };


        tFun t=(aa)->{
            System.out.println(aa);
        };

        t.f("qwewerrw");

        runnable.run();

        lock.readLock().lock();
    }

    @FunctionalInterface
    interface tFun<T>{
       abstract void f(T a);
       //abstract void t();
        


    }

    /*public static void main(String[] args) throws IllegalAccessException, NoSuchMethodException, InvocationTargetException {
        ShOrders shOrders=new ShOrders();
        shOrders.setBranchName("https://zhuanlan.zhihu.com/p/46078218");
        shOrders.setLendDate(new Date());


        Map map=new HashMap();
        map.put("ad","wead");


            //map= org.apache.commons.beanutils.BeanUtils.describe(shOrders);
        System.out.println(net.sf.json.JSONObject.fromObject(shOrders));

        System.out.println(net.sf.json.JSONObject.fromObject(map));

        String b="01\t北京\t100\t北京市\t110101\t东城区\n" +
                "01\t北京\t100\t北京市\t110102\t西城区\n" +
                "01\t北京\t100\t北京市\t110105\t朝阳区\n" +
                "01\t北京\t100\t北京市\t110106\t丰台区\n" +
                "01\t北京\t100\t北京市\t110107\t石景山区\n" +
                "01\t北京\t100\t北京市\t110108\t海淀区\n" +
                "01\t北京\t100\t北京市\t110109\t门头沟区\n" +
                "01\t北京\t100\t北京市\t110111\t房山区\n" +
                "01\t北京\t100\t北京市\t110112\t通州区\n" +
                "01\t北京\t100\t北京市\t110113\t顺义区\n" +
                "01\t北京\t100\t北京市\t110114\t昌平区\n" +
                "01\t北京\t100\t北京市\t110115\t大兴区\n" +
                "01\t北京\t100\t北京市\t110116\t怀柔区\n" +
                "01\t北京\t100\t北京市\t110117\t平谷区\n" +
                "01\t北京\t100\t北京市\t110118\t密云区\n" +
                "01\t北京\t100\t北京市\t110119\t延庆区\n" +
                "02\t天津\t220\t天津市\t120101\t和平区\n" +
                "02\t天津\t220\t天津市\t120102\t河东区\n" +
                "02\t天津\t220\t天津市\t120103\t河西区\n" +
                "02\t天津\t220\t天津市\t120104\t南开区\n" +
                "02\t天津\t220\t天津市\t120105\t河北区\n" +
                "02\t天津\t220\t天津市\t120106\t红桥区\n" +
                "02\t天津\t220\t天津市\t120110\t东丽区\n" +
                "02\t天津\t220\t天津市\t120111\t西青区\n" +
                "02\t天津\t220\t天津市\t120112\t津南区\n" +
                "02\t天津\t220\t天津市\t120113\t北辰区\n" +
                "02\t天津\t220\t天津市\t120114\t武清区\n" +
                "02\t天津\t220\t天津市\t120115\t宝坻区\n" +
                "02\t天津\t220\t天津市\t120116\t滨海新区\n" +
                "02\t天津\t220\t天津市\t120117\t宁河区\n" +
                "02\t天津\t220\t天津市\t120118\t静海区\n" +
                "02\t天津\t220\t天津市\t120119\t蓟州区\n" +
                "03\t河北省\t312\t保定市\t139001\t定州市\n" +
                "03\t河北省\t311\t石家庄市\t139002\t辛集市\n" +
                "03\t河北省\t320\t定州市\t320001\t定州市\n" +
                "03\t河北省\t331\t辛集市\t331001\t辛集市\n" +
                "03\t河北省\t310\t邯郸市\t130402\t邯山区\n" +
                "03\t河北省\t310\t邯郸市\t130403\t丛台区\n" +
                "03\t河北省\t310\t邯郸市\t130404\t复兴区\n" +
                "03\t河北省\t310\t邯郸市\t130406\t峰峰矿区\n" +
                "03\t河北省\t310\t邯郸市\t130421\t邯郸县\n" +
                "03\t河北省\t310\t邯郸市\t130423\t临漳县\n" +
                "03\t河北省\t310\t邯郸市\t130424\t成安县\n" +
                "03\t河北省\t310\t邯郸市\t130425\t大名县\n" +
                "03\t河北省\t310\t邯郸市\t130426\t涉县\n" +
                "03\t河北省\t310\t邯郸市\t130427\t磁县\n" +
                "03\t河北省\t310\t邯郸市\t130428\t肥乡县\n" +
                "03\t河北省\t310\t邯郸市\t130429\t永年县\n" +
                "03\t河北省\t310\t邯郸市\t130430\t邱县\n" +
                "03\t河北省\t310\t邯郸市\t130431\t鸡泽县\n" +
                "03\t河北省\t310\t邯郸市\t130432\t广平县\n" +
                "03\t河北省\t310\t邯郸市\t130433\t馆陶县\n" +
                "03\t河北省\t310\t邯郸市\t130434\t魏县\n" +
                "03\t河北省\t310\t邯郸市\t130435\t曲周县\n" +
                "03\t河北省\t310\t邯郸市\t130481\t武安市\n" +
                "03\t河北省\t311\t石家庄市\t130102\t长安区\n" +
                "03\t河北省\t311\t石家庄市\t130104\t桥西区\n" +
                "03\t河北省\t311\t石家庄市\t130105\t新华区\n" +
                "03\t河北省\t311\t石家庄市\t130107\t井陉矿区\n" +
                "03\t河北省\t311\t石家庄市\t130108\t裕华区\n" +
                "03\t河北省\t311\t石家庄市\t130109\t藁城区\n" +
                "03\t河北省\t311\t石家庄市\t130110\t鹿泉区\n" +
                "03\t河北省\t311\t石家庄市\t130111\t栾城区\n" +
                "03\t河北省\t311\t石家庄市\t130121\t井陉县\n" +
                "03\t河北省\t311\t石家庄市\t130123\t正定县\n" +
                "03\t河北省\t311\t石家庄市\t130125\t行唐县\n" +
                "03\t河北省\t311\t石家庄市\t130126\t灵寿县\n" +
                "03\t河北省\t311\t石家庄市\t130127\t高邑县\n" +
                "03\t河北省\t311\t石家庄市\t130128\t深泽县\n" +
                "03\t河北省\t311\t石家庄市\t130129\t赞皇县\n" +
                "03\t河北省\t311\t石家庄市\t130130\t无极县\n" +
                "03\t河北省\t311\t石家庄市\t130131\t平山县\n" +
                "03\t河北省\t311\t石家庄市\t130132\t元氏县\n" +
                "03\t河北省\t311\t石家庄市\t130133\t赵县\n" +
                "03\t河北省\t311\t石家庄市\t130183\t晋州市\n" +
                "03\t河北省\t311\t石家庄市\t130184\t新乐市\n" +
                "03\t河北省\t312\t保定市\t130602\t竞秀区\n" +
                "03\t河北省\t312\t保定市\t130606\t莲池区\n" +
                "03\t河北省\t312\t保定市\t130607\t满城区\n" +
                "03\t河北省\t312\t保定市\t130608\t清苑区\n" +
                "03\t河北省\t312\t保定市\t130609\t徐水区\n" +
                "03\t河北省\t312\t保定市\t130623\t涞水县\n" +
                "03\t河北省\t312\t保定市\t130624\t阜平县\n" +
                "03\t河北省\t312\t保定市\t130626\t定兴县\n" +
                "03\t河北省\t312\t保定市\t130627\t唐县\n" +
                "03\t河北省\t312\t保定市\t130628\t高阳县\n" +
                "03\t河北省\t312\t保定市\t130629\t容城县\n" +
                "03\t河北省\t312\t保定市\t130630\t涞源县\n" +
                "03\t河北省\t312\t保定市\t130631\t望都县\n" +
                "03\t河北省\t312\t保定市\t130632\t安新县\n" +
                "03\t河北省\t312\t保定市\t130633\t易县\n" +
                "03\t河北省\t312\t保定市\t130634\t曲阳县\n" +
                "03\t河北省\t312\t保定市\t130635\t蠡县\n" +
                "03\t河北省\t312\t保定市\t130636\t顺平县\n" +
                "03\t河北省\t312\t保定市\t130637\t博野县\n" +
                "03\t河北省\t312\t保定市\t130638\t雄县\n" +
                "03\t河北省\t312\t保定市\t130681\t涿州市\n" +
                "03\t河北省\t312\t保定市\t130683\t安国市\n" +
                "03\t河北省\t312\t保定市\t130684\t高碑店市\n" +
                "03\t河北省\t313\t张家口市\t130702\t桥东区\n" +
                "03\t河北省\t313\t张家口市\t130703\t桥西区\n" +
                "03\t河北省\t313\t张家口市\t130705\t宣化区\n" +
                "03\t河北省\t313\t张家口市\t130706\t下花园区\n" +
                "03\t河北省\t313\t张家口市\t130708\t万全区\n" +
                "03\t河北省\t313\t张家口市\t130709\t崇礼区\n" +
                "03\t河北省\t313\t张家口市\t130722\t张北县\n" +
                "03\t河北省\t313\t张家口市\t130723\t康保县\n" +
                "03\t河北省\t313\t张家口市\t130724\t沽源县\n" +
                "03\t河北省\t313\t张家口市\t130725\t尚义县\n" +
                "03\t河北省\t313\t张家口市\t130726\t蔚县\n" +
                "03\t河北省\t313\t张家口市\t130727\t阳原县\n" +
                "03\t河北省\t313\t张家口市\t130728\t怀安县\n" +
                "03\t河北省\t313\t张家口市\t130730\t怀来县\n" +
                "03\t河北省\t313\t张家口市\t130731\t涿鹿县\n" +
                "03\t河北省\t313\t张家口市\t130732\t赤城县\n" +
                "03\t河北省\t314\t承德市\t130802\t双桥区\n" +
                "03\t河北省\t314\t承德市\t130803\t双滦区\n" +
                "03\t河北省\t314\t承德市\t130804\t鹰手营子矿区\n" +
                "03\t河北省\t314\t承德市\t130821\t承德县\n" +
                "03\t河北省\t314\t承德市\t130822\t兴隆县\n" +
                "03\t河北省\t314\t承德市\t130823\t平泉县\n" +
                "03\t河北省\t314\t承德市\t130824\t滦平县\n" +
                "03\t河北省\t314\t承德市\t130825\t隆化县\n" +
                "03\t河北省\t314\t承德市\t130826\t丰宁满族自治县\n" +
                "03\t河北省\t314\t承德市\t130827\t宽城满族自治县\n" +
                "03\t河北省\t314\t承德市\t130828\t围场满族蒙古族自治县\n" +
                "03\t河北省\t315\t唐山市\t130202\t路南区\n" +
                "03\t河北省\t315\t唐山市\t130203\t路北区\n" +
                "03\t河北省\t315\t唐山市\t130204\t古冶区\n" +
                "03\t河北省\t315\t唐山市\t130205\t开平区\n" +
                "03\t河北省\t315\t唐山市\t130207\t丰南区\n" +
                "03\t河北省\t315\t唐山市\t130208\t丰润区\n" +
                "03\t河北省\t315\t唐山市\t130209\t曹妃甸区\n" +
                "03\t河北省\t315\t唐山市\t130223\t滦县\n" +
                "03\t河北省\t315\t唐山市\t130224\t滦南县\n" +
                "03\t河北省\t315\t唐山市\t130225\t乐亭县\n" +
                "03\t河北省\t315\t唐山市\t130227\t迁西县\n" +
                "03\t河北省\t315\t唐山市\t130229\t玉田县\n" +
                "03\t河北省\t315\t唐山市\t130281\t遵化市\n" +
                "03\t河北省\t315\t唐山市\t130283\t迁安市\n" +
                "03\t河北省\t316\t廊坊市\t131002\t安次区\n" +
                "03\t河北省\t316\t廊坊市\t131003\t广阳区\n" +
                "03\t河北省\t316\t廊坊市\t131022\t固安县\n" +
                "03\t河北省\t316\t廊坊市\t131023\t永清县\n" +
                "03\t河北省\t316\t廊坊市\t131024\t香河县\n" +
                "03\t河北省\t316\t廊坊市\t131025\t大城县\n" +
                "03\t河北省\t316\t廊坊市\t131026\t文安县\n" +
                "03\t河北省\t316\t廊坊市\t131028\t大厂回族自治县\n" +
                "03\t河北省\t316\t廊坊市\t131081\t霸州市\n" +
                "03\t河北省\t316\t廊坊市\t131082\t三河市\n" +
                "03\t河北省\t317\t沧州市\t130902\t新华区\n" +
                "03\t河北省\t317\t沧州市\t130903\t运河区\n" +
                "03\t河北省\t317\t沧州市\t130921\t沧县\n" +
                "03\t河北省\t317\t沧州市\t130922\t青县\n" +
                "03\t河北省\t317\t沧州市\t130923\t东光县\n" +
                "03\t河北省\t317\t沧州市\t130924\t海兴县\n" +
                "03\t河北省\t317\t沧州市\t130925\t盐山县\n" +
                "03\t河北省\t317\t沧州市\t130926\t肃宁县\n" +
                "03\t河北省\t317\t沧州市\t130927\t南皮县\n" +
                "03\t河北省\t317\t沧州市\t130928\t吴桥县\n" +
                "03\t河北省\t317\t沧州市\t130929\t献县\n" +
                "03\t河北省\t317\t沧州市\t130930\t孟村回族自治县\n" +
                "03\t河北省\t317\t沧州市\t130981\t泊头市\n" +
                "03\t河北省\t317\t沧州市\t130982\t任丘市\n" +
                "03\t河北省\t317\t沧州市\t130983\t黄骅市\n" +
                "03\t河北省\t317\t沧州市\t130984\t河间市\n" +
                "03\t河北省\t318\t衡水市\t131102\t桃城区\n" +
                "03\t河北省\t318\t衡水市\t131103\t冀州区\n" +
                "03\t河北省\t318\t衡水市\t131121\t枣强县\n" +
                "03\t河北省\t318\t衡水市\t131122\t武邑县\n" +
                "03\t河北省\t318\t衡水市\t131123\t武强县\n" +
                "03\t河北省\t318\t衡水市\t131124\t饶阳县\n" +
                "03\t河北省\t318\t衡水市\t131125\t安平县\n" +
                "03\t河北省\t318\t衡水市\t131126\t故城县\n" +
                "03\t河北省\t318\t衡水市\t131127\t景县\n" +
                "03\t河北省\t318\t衡水市\t131128\t阜城县\n" +
                "03\t河北省\t318\t衡水市\t131182\t深州市\n" +
                "03\t河北省\t319\t邢台市\t130502\t桥东区\n" +
                "03\t河北省\t319\t邢台市\t130503\t桥西区\n" +
                "03\t河北省\t319\t邢台市\t130521\t邢台县\n" +
                "03\t河北省\t319\t邢台市\t130522\t临城县\n" +
                "03\t河北省\t319\t邢台市\t130523\t内丘县\n" +
                "03\t河北省\t319\t邢台市\t130524\t柏乡县\n" +
                "03\t河北省\t319\t邢台市\t130525\t隆尧县\n" +
                "03\t河北省\t319\t邢台市\t130526\t任县\n" +
                "03\t河北省\t319\t邢台市\t130527\t南和县\n" +
                "03\t河北省\t319\t邢台市\t130528\t宁晋县\n" +
                "03\t河北省\t319\t邢台市\t130529\t巨鹿县\n" +
                "03\t河北省\t319\t邢台市\t130530\t新河县\n" +
                "03\t河北省\t319\t邢台市\t130531\t广宗县\n" +
                "03\t河北省\t319\t邢台市\t130532\t平乡县\n" +
                "03\t河北省\t319\t邢台市\t130533\t威县\n" +
                "03\t河北省\t319\t邢台市\t130534\t清河县\n" +
                "03\t河北省\t319\t邢台市\t130535\t临西县\n" +
                "03\t河北省\t319\t邢台市\t130581\t南宫市\n" +
                "03\t河北省\t319\t邢台市\t130582\t沙河市\n" +
                "03\t河北省\t335\t秦皇岛市\t130302\t海港区\n" +
                "03\t河北省\t335\t秦皇岛市\t130303\t山海关区\n" +
                "03\t河北省\t335\t秦皇岛市\t130304\t北戴河区\n" +
                "03\t河北省\t335\t秦皇岛市\t130306\t抚宁区\n" +
                "03\t河北省\t335\t秦皇岛市\t130321\t青龙满族自治县\n" +
                "03\t河北省\t335\t秦皇岛市\t130322\t昌黎县\n" +
                "03\t河北省\t335\t秦皇岛市\t130324\t卢龙县\n" +
                "04\t山西省\t349\t朔州市\t140602\t朔城区\n" +
                "04\t山西省\t349\t朔州市\t140603\t平鲁区\n" +
                "04\t山西省\t349\t朔州市\t140621\t山阴县\n" +
                "04\t山西省\t349\t朔州市\t140622\t应县\n" +
                "04\t山西省\t349\t朔州市\t140623\t右玉县\n" +
                "04\t山西省\t349\t朔州市\t140624\t怀仁县\n" +
                "04\t山西省\t350\t忻州市\t140902\t忻府区\n" +
                "04\t山西省\t350\t忻州市\t140921\t定襄县\n" +
                "04\t山西省\t350\t忻州市\t140922\t五台县\n" +
                "04\t山西省\t350\t忻州市\t140923\t代县\n" +
                "04\t山西省\t350\t忻州市\t140924\t繁峙县\n" +
                "04\t山西省\t350\t忻州市\t140925\t宁武县\n" +
                "04\t山西省\t350\t忻州市\t140926\t静乐县\n" +
                "04\t山西省\t350\t忻州市\t140927\t神池县\n" +
                "04\t山西省\t350\t忻州市\t140928\t五寨县\n" +
                "04\t山西省\t350\t忻州市\t140929\t岢岚县\n" +
                "04\t山西省\t350\t忻州市\t140930\t河曲县\n" +
                "04\t山西省\t350\t忻州市\t140931\t保德县\n" +
                "04\t山西省\t350\t忻州市\t140932\t偏关县\n" +
                "04\t山西省\t350\t忻州市\t140981\t原平市\n" +
                "04\t山西省\t351\t太原市\t140105\t小店区\n" +
                "04\t山西省\t351\t太原市\t140106\t迎泽区\n" +
                "04\t山西省\t351\t太原市\t140107\t杏花岭区\n" +
                "04\t山西省\t351\t太原市\t140108\t尖草坪区\n" +
                "04\t山西省\t351\t太原市\t140109\t万柏林区\n" +
                "04\t山西省\t351\t太原市\t140110\t晋源区\n" +
                "04\t山西省\t351\t太原市\t140121\t清徐县\n" +
                "04\t山西省\t351\t太原市\t140122\t阳曲县\n" +
                "04\t山西省\t351\t太原市\t140123\t娄烦县\n" +
                "04\t山西省\t351\t太原市\t140181\t古交市\n" +
                "04\t山西省\t352\t大同市\t140202\t城区\n" +
                "04\t山西省\t352\t大同市\t140203\t矿区\n" +
                "04\t山西省\t352\t大同市\t140211\t南郊区\n" +
                "04\t山西省\t352\t大同市\t140212\t新荣区\n" +
                "04\t山西省\t352\t大同市\t140221\t阳高县\n" +
                "04\t山西省\t352\t大同市\t140222\t天镇县\n" +
                "04\t山西省\t352\t大同市\t140223\t广灵县\n" +
                "04\t山西省\t352\t大同市\t140224\t灵丘县\n" +
                "04\t山西省\t352\t大同市\t140225\t浑源县\n" +
                "04\t山西省\t352\t大同市\t140226\t左云县\n" +
                "04\t山西省\t352\t大同市\t140227\t大同县\n" +
                "04\t山西省\t353\t阳泉市\t140302\t城区\n" +
                "04\t山西省\t353\t阳泉市\t140303\t矿区\n" +
                "04\t山西省\t353\t阳泉市\t140311\t郊区\n" +
                "04\t山西省\t353\t阳泉市\t140321\t平定县\n" +
                "04\t山西省\t353\t阳泉市\t140322\t盂县\n" +
                "04\t山西省\t354\t晋中市\t140702\t榆次区\n" +
                "04\t山西省\t354\t晋中市\t140721\t榆社县\n" +
                "04\t山西省\t354\t晋中市\t140722\t左权县\n" +
                "04\t山西省\t354\t晋中市\t140723\t和顺县\n" +
                "04\t山西省\t354\t晋中市\t140724\t昔阳县\n" +
                "04\t山西省\t354\t晋中市\t140725\t寿阳县\n" +
                "04\t山西省\t354\t晋中市\t140726\t太谷县\n" +
                "04\t山西省\t354\t晋中市\t140727\t祁县\n" +
                "04\t山西省\t354\t晋中市\t140728\t平遥县\n" +
                "04\t山西省\t354\t晋中市\t140729\t灵石县\n" +
                "04\t山西省\t354\t晋中市\t140781\t介休市\n" +
                "04\t山西省\t355\t长治市\t140402\t城区\n" +
                "04\t山西省\t355\t长治市\t140411\t郊区\n" +
                "04\t山西省\t355\t长治市\t140421\t长治县\n" +
                "04\t山西省\t355\t长治市\t140423\t襄垣县\n" +
                "04\t山西省\t355\t长治市\t140424\t屯留县\n" +
                "04\t山西省\t355\t长治市\t140425\t平顺县\n" +
                "04\t山西省\t355\t长治市\t140426\t黎城县\n" +
                "04\t山西省\t355\t长治市\t140427\t壶关县\n" +
                "04\t山西省\t355\t长治市\t140428\t长子县\n" +
                "04\t山西省\t355\t长治市\t140429\t武乡县\n" +
                "04\t山西省\t355\t长治市\t140430\t沁县\n" +
                "04\t山西省\t355\t长治市\t140431\t沁源县\n" +
                "04\t山西省\t355\t长治市\t140481\t潞城市\n" +
                "04\t山西省\t356\t晋城市\t140502\t城区\n" +
                "04\t山西省\t356\t晋城市\t140521\t沁水县\n" +
                "04\t山西省\t356\t晋城市\t140522\t阳城县\n" +
                "04\t山西省\t356\t晋城市\t140524\t陵川县\n" +
                "04\t山西省\t356\t晋城市\t140525\t泽州县\n" +
                "04\t山西省\t356\t晋城市\t140581\t高平市\n" +
                "04\t山西省\t357\t临汾市\t141002\t尧都区\n" +
                "04\t山西省\t357\t临汾市\t141021\t曲沃县\n" +
                "04\t山西省\t357\t临汾市\t141022\t翼城县\n" +
                "04\t山西省\t357\t临汾市\t141023\t襄汾县\n" +
                "04\t山西省\t357\t临汾市\t141024\t洪洞县\n" +
                "04\t山西省\t357\t临汾市\t141025\t古县\n" +
                "04\t山西省\t357\t临汾市\t141026\t安泽县\n" +
                "04\t山西省\t357\t临汾市\t141027\t浮山县\n" +
                "04\t山西省\t357\t临汾市\t141028\t吉县\n" +
                "04\t山西省\t357\t临汾市\t141029\t乡宁县\n" +
                "04\t山西省\t357\t临汾市\t141030\t大宁县\n" +
                "04\t山西省\t357\t临汾市\t141031\t隰县\n" +
                "04\t山西省\t357\t临汾市\t141032\t永和县\n" +
                "04\t山西省\t357\t临汾市\t141033\t蒲县\n" +
                "04\t山西省\t357\t临汾市\t141034\t汾西县\n" +
                "04\t山西省\t357\t临汾市\t141081\t侯马市\n" +
                "04\t山西省\t357\t临汾市\t141082\t霍州市\n" +
                "04\t山西省\t358\t吕梁市\t141102\t离石区\n" +
                "04\t山西省\t358\t吕梁市\t141121\t文水县\n" +
                "04\t山西省\t358\t吕梁市\t141122\t交城县\n" +
                "04\t山西省\t358\t吕梁市\t141123\t兴县\n" +
                "04\t山西省\t358\t吕梁市\t141124\t临县\n" +
                "04\t山西省\t358\t吕梁市\t141125\t柳林县\n" +
                "04\t山西省\t358\t吕梁市\t141126\t石楼县\n" +
                "04\t山西省\t358\t吕梁市\t141127\t岚县\n" +
                "04\t山西省\t358\t吕梁市\t141128\t方山县\n" +
                "04\t山西省\t358\t吕梁市\t141129\t中阳县\n" +
                "04\t山西省\t358\t吕梁市\t141130\t交口县\n" +
                "04\t山西省\t358\t吕梁市\t141181\t孝义市\n" +
                "04\t山西省\t358\t吕梁市\t141182\t汾阳市\n" +
                "04\t山西省\t359\t运城市\t140802\t盐湖区\n" +
                "04\t山西省\t359\t运城市\t140821\t临猗县\n" +
                "04\t山西省\t359\t运城市\t140822\t万荣县\n" +
                "04\t山西省\t359\t运城市\t140823\t闻喜县\n" +
                "04\t山西省\t359\t运城市\t140824\t稷山县\n" +
                "04\t山西省\t359\t运城市\t140825\t新绛县\n" +
                "04\t山西省\t359\t运城市\t140826\t绛县\n" +
                "04\t山西省\t359\t运城市\t140827\t垣曲县\n" +
                "04\t山西省\t359\t运城市\t140828\t夏县\n" +
                "04\t山西省\t359\t运城市\t140829\t平陆县\n" +
                "04\t山西省\t359\t运城市\t140830\t芮城县\n" +
                "04\t山西省\t359\t运城市\t140881\t永济市\n" +
                "04\t山西省\t359\t运城市\t140882\t河津市\n" +
                "05\t内蒙古\t470\t海拉尔市\t150702\t海拉尔区\n" +
                "05\t内蒙古\t476\t赤峰市\t150403\t元宝山区\n" +
                "05\t内蒙古\t476\t赤峰市\t150404\t松山区\n" +
                "05\t内蒙古\t476\t赤峰市\t150421\t阿鲁科尔沁旗\n" +
                "05\t内蒙古\t476\t赤峰市\t150422\t巴林左旗\n" +
                "05\t内蒙古\t476\t赤峰市\t150423\t巴林右旗\n" +
                "05\t内蒙古\t476\t赤峰市\t150424\t林西县\n" +
                "05\t内蒙古\t476\t赤峰市\t150425\t克什克腾旗\n" +
                "05\t内蒙古\t476\t赤峰市\t150426\t翁牛特旗\n" +
                "05\t内蒙古\t476\t赤峰市\t150428\t喀喇沁旗\n" +
                "05\t内蒙古\t476\t赤峰市\t150429\t宁城县\n" +
                "05\t内蒙古\t476\t赤峰市\t150430\t敖汉旗\n" +
                "05\t内蒙古\t477\t鄂尔多斯市\t150602\t东胜区\n" +
                "05\t内蒙古\t477\t鄂尔多斯市\t150603\t康巴什区\n" +
                "05\t内蒙古\t477\t鄂尔多斯市\t150621\t达拉特旗\n" +
                "05\t内蒙古\t477\t鄂尔多斯市\t150622\t准格尔旗\n" +
                "05\t内蒙古\t477\t鄂尔多斯市\t150623\t鄂托克前旗\n" +
                "05\t内蒙古\t477\t鄂尔多斯市\t150624\t鄂托克旗\n" +
                "05\t内蒙古\t477\t鄂尔多斯市\t150625\t杭锦旗\n" +
                "05\t内蒙古\t477\t鄂尔多斯市\t150626\t乌审旗\n" +
                "05\t内蒙古\t477\t鄂尔多斯市\t150627\t伊金霍洛旗\n" +
                "05\t内蒙古\t478\t临河市\t150802\t临河区\n" +
                "05\t内蒙古\t478\t临河市\t150821\t五原县\n" +
                "05\t内蒙古\t478\t临河市\t150822\t磴口县\n" +
                "05\t内蒙古\t478\t临河市\t150823\t乌拉特前旗\n" +
                "05\t内蒙古\t478\t临河市\t150824\t乌拉特中旗\n" +
                "05\t内蒙古\t478\t临河市\t150825\t乌拉特后旗\n" +
                "05\t内蒙古\t478\t临河市\t150826\t杭锦后旗\n" +
                "05\t内蒙古\t479\t锡林浩特市\t152501\t二连浩特市\n" +
                "05\t内蒙古\t479\t锡林浩特市\t152502\t锡林浩特市\n" +
                "05\t内蒙古\t479\t锡林浩特市\t152522\t阿巴嘎旗\n" +
                "05\t内蒙古\t479\t锡林浩特市\t152523\t苏尼特左旗\n" +
                "05\t内蒙古\t479\t锡林浩特市\t152524\t苏尼特右旗\n" +
                "05\t内蒙古\t479\t锡林浩特市\t152525\t东乌珠穆沁旗\n" +
                "05\t内蒙古\t479\t锡林浩特市\t152526\t西乌珠穆沁旗\n" +
                "05\t内蒙古\t479\t锡林浩特市\t152527\t太仆寺旗\n" +
                "05\t内蒙古\t479\t锡林浩特市\t152528\t镶黄旗\n" +
                "05\t内蒙古\t479\t锡林浩特市\t152529\t正镶白旗\n" +
                "05\t内蒙古\t479\t锡林浩特市\t152530\t正蓝旗\n" +
                "05\t内蒙古\t479\t锡林浩特市\t152531\t多伦县\n" +
                "05\t内蒙古\t482\t乌兰浩特市\t152201\t乌兰浩特市\n" +
                "05\t内蒙古\t482\t乌兰浩特市\t152202\t阿尔山市\n" +
                "05\t内蒙古\t482\t乌兰浩特市\t152221\t科尔沁右翼前旗\n" +
                "05\t内蒙古\t482\t乌兰浩特市\t152222\t科尔沁右翼中旗\n" +
                "05\t内蒙古\t482\t乌兰浩特市\t152223\t扎赉特旗\n" +
                "05\t内蒙古\t482\t乌兰浩特市\t152224\t突泉县\n" +
                "05\t内蒙古\t483\t阿拉善盟市\t152921\t阿拉善左旗\n" +
                "05\t内蒙古\t483\t阿拉善盟市\t152922\t阿拉善右旗\n" +
                "05\t内蒙古\t483\t阿拉善盟市\t152923\t额济纳旗\n" +
                "05\t内蒙古\t470\t海拉尔市\t150703\t扎赉诺尔区\n" +
                "05\t内蒙古\t470\t海拉尔市\t150721\t阿荣旗\n" +
                "05\t内蒙古\t470\t海拉尔市\t150722\t莫力达瓦达斡尔族自治旗\n" +
                "05\t内蒙古\t470\t海拉尔市\t150723\t鄂伦春自治旗\n" +
                "05\t内蒙古\t470\t海拉尔市\t150724\t鄂温克族自治旗\n" +
                "05\t内蒙古\t470\t海拉尔市\t150725\t陈巴尔虎旗\n" +
                "05\t内蒙古\t470\t海拉尔市\t150726\t新巴尔虎左旗\n" +
                "05\t内蒙古\t470\t海拉尔市\t150727\t新巴尔虎右旗\n" +
                "05\t内蒙古\t470\t海拉尔市\t150781\t满洲里市\n" +
                "05\t内蒙古\t470\t海拉尔市\t150782\t牙克石市\n" +
                "05\t内蒙古\t470\t海拉尔市\t150783\t扎兰屯市\n" +
                "05\t内蒙古\t470\t海拉尔市\t150784\t额尔古纳市\n" +
                "05\t内蒙古\t470\t海拉尔市\t150785\t根河市\n" +
                "05\t内蒙古\t471\t呼和浩特市\t150102\t新城区\n" +
                "05\t内蒙古\t471\t呼和浩特市\t150103\t回民区\n" +
                "05\t内蒙古\t471\t呼和浩特市\t150104\t玉泉区\n" +
                "05\t内蒙古\t471\t呼和浩特市\t150105\t赛罕区\n" +
                "05\t内蒙古\t471\t呼和浩特市\t150121\t土默特左旗\n" +
                "05\t内蒙古\t471\t呼和浩特市\t150122\t托克托县\n" +
                "05\t内蒙古\t471\t呼和浩特市\t150123\t和林格尔县\n" +
                "05\t内蒙古\t471\t呼和浩特市\t150124\t清水河县\n" +
                "05\t内蒙古\t471\t呼和浩特市\t150125\t武川县\n" +
                "05\t内蒙古\t472\t包头市\t150202\t东河区\n" +
                "05\t内蒙古\t472\t包头市\t150203\t昆都仑区\n" +
                "05\t内蒙古\t472\t包头市\t150204\t青山区\n" +
                "05\t内蒙古\t472\t包头市\t150205\t石拐区\n" +
                "05\t内蒙古\t472\t包头市\t150206\t白云鄂博矿区\n" +
                "05\t内蒙古\t472\t包头市\t150207\t九原区\n" +
                "05\t内蒙古\t472\t包头市\t150221\t土默特右旗\n" +
                "05\t内蒙古\t472\t包头市\t150222\t固阳县\n" +
                "05\t内蒙古\t472\t包头市\t150223\t达尔罕茂明安联合旗\n" +
                "05\t内蒙古\t473\t乌海市\t150302\t海勃湾区\n" +
                "05\t内蒙古\t473\t乌海市\t150303\t海南区\n" +
                "05\t内蒙古\t473\t乌海市\t150304\t乌达区\n" +
                "05\t内蒙古\t474\t集宁市\t150902\t集宁区\n" +
                "05\t内蒙古\t474\t集宁市\t150921\t卓资县\n" +
                "05\t内蒙古\t474\t集宁市\t150922\t化德县\n" +
                "05\t内蒙古\t474\t集宁市\t150923\t商都县\n" +
                "05\t内蒙古\t474\t集宁市\t150924\t兴和县\n" +
                "05\t内蒙古\t474\t集宁市\t150925\t凉城县\n" +
                "05\t内蒙古\t474\t集宁市\t150926\t察哈尔右翼前旗\n" +
                "05\t内蒙古\t474\t集宁市\t150927\t察哈尔右翼中旗\n" +
                "05\t内蒙古\t474\t集宁市\t150928\t察哈尔右翼后旗\n" +
                "05\t内蒙古\t474\t集宁市\t150929\t四子王旗\n" +
                "05\t内蒙古\t474\t集宁市\t150981\t丰镇市\n" +
                "05\t内蒙古\t475\t通辽市\t150502\t科尔沁区\n" +
                "05\t内蒙古\t475\t通辽市\t150521\t科尔沁左翼中旗\n" +
                "05\t内蒙古\t475\t通辽市\t150522\t科尔沁左翼后旗\n" +
                "05\t内蒙古\t475\t通辽市\t150523\t开鲁县\n" +
                "05\t内蒙古\t475\t通辽市\t150524\t库伦旗\n" +
                "05\t内蒙古\t475\t通辽市\t150525\t奈曼旗\n" +
                "05\t内蒙古\t475\t通辽市\t150526\t扎鲁特旗\n" +
                "05\t内蒙古\t475\t通辽市\t150581\t霍林郭勒市\n" +
                "05\t内蒙古\t476\t赤峰市\t150402\t红山区\n" +
                "06\t辽宁省\t240\t沈阳市\t210102\t和平区\n" +
                "06\t辽宁省\t240\t沈阳市\t210103\t沈河区\n" +
                "06\t辽宁省\t240\t沈阳市\t210104\t大东区\n" +
                "06\t辽宁省\t240\t沈阳市\t210105\t皇姑区\n" +
                "06\t辽宁省\t240\t沈阳市\t210106\t铁西区\n" +
                "06\t辽宁省\t240\t沈阳市\t210111\t苏家屯区\n" +
                "06\t辽宁省\t240\t沈阳市\t210112\t浑南区\n" +
                "06\t辽宁省\t240\t沈阳市\t210113\t沈北新区\n" +
                "06\t辽宁省\t240\t沈阳市\t210114\t于洪区\n" +
                "06\t辽宁省\t240\t沈阳市\t210115\t辽中区\n" +
                "06\t辽宁省\t240\t沈阳市\t210123\t康平县\n" +
                "06\t辽宁省\t240\t沈阳市\t210124\t法库县\n" +
                "06\t辽宁省\t240\t沈阳市\t210181\t新民市\n" +
                "06\t辽宁省\t410\t铁岭市\t211202\t银州区\n" +
                "06\t辽宁省\t410\t铁岭市\t211204\t清河区\n" +
                "06\t辽宁省\t410\t铁岭市\t211221\t铁岭县\n" +
                "06\t辽宁省\t410\t铁岭市\t211223\t西丰县\n" +
                "06\t辽宁省\t410\t铁岭市\t211224\t昌图县\n" +
                "06\t辽宁省\t410\t铁岭市\t211281\t调兵山市\n" +
                "06\t辽宁省\t410\t铁岭市\t211282\t开原市\n" +
                "06\t辽宁省\t411\t大连市\t210202\t中山区\n" +
                "06\t辽宁省\t411\t大连市\t210203\t西岗区\n" +
                "06\t辽宁省\t411\t大连市\t210204\t沙河口区\n" +
                "06\t辽宁省\t411\t大连市\t210211\t甘井子区\n" +
                "06\t辽宁省\t411\t大连市\t210212\t旅顺口区\n" +
                "06\t辽宁省\t411\t大连市\t210213\t金州区\n" +
                "06\t辽宁省\t411\t大连市\t210214\t普兰店区\n" +
                "06\t辽宁省\t411\t大连市\t210224\t长海县\n" +
                "06\t辽宁省\t411\t大连市\t210281\t瓦房店市\n" +
                "06\t辽宁省\t411\t大连市\t210283\t庄河市\n" +
                "06\t辽宁省\t412\t鞍山市\t210302\t铁东区\n" +
                "06\t辽宁省\t412\t鞍山市\t210303\t铁西区\n" +
                "06\t辽宁省\t412\t鞍山市\t210304\t立山区\n" +
                "06\t辽宁省\t412\t鞍山市\t210311\t千山区\n" +
                "06\t辽宁省\t412\t鞍山市\t210321\t台安县\n" +
                "06\t辽宁省\t412\t鞍山市\t210323\t岫岩满族自治县\n" +
                "06\t辽宁省\t412\t鞍山市\t210381\t海城市\n" +
                "06\t辽宁省\t413\t抚顺市\t210402\t新抚区\n" +
                "06\t辽宁省\t413\t抚顺市\t210403\t东洲区\n" +
                "06\t辽宁省\t413\t抚顺市\t210404\t望花区\n" +
                "06\t辽宁省\t413\t抚顺市\t210411\t顺城区\n" +
                "06\t辽宁省\t413\t抚顺市\t210421\t抚顺县\n" +
                "06\t辽宁省\t413\t抚顺市\t210422\t新宾满族自治县\n" +
                "06\t辽宁省\t413\t抚顺市\t210423\t清原满族自治县\n" +
                "06\t辽宁省\t414\t本溪市\t210502\t平山区\n" +
                "06\t辽宁省\t414\t本溪市\t210503\t溪湖区\n" +
                "06\t辽宁省\t414\t本溪市\t210504\t明山区\n" +
                "06\t辽宁省\t414\t本溪市\t210505\t南芬区\n" +
                "06\t辽宁省\t414\t本溪市\t210521\t本溪满族自治县\n" +
                "06\t辽宁省\t414\t本溪市\t210522\t桓仁满族自治县\n" +
                "06\t辽宁省\t415\t丹东市\t210602\t元宝区\n" +
                "06\t辽宁省\t415\t丹东市\t210603\t振兴区\n" +
                "06\t辽宁省\t415\t丹东市\t210604\t振安区\n" +
                "06\t辽宁省\t415\t丹东市\t210624\t宽甸满族自治县\n" +
                "06\t辽宁省\t415\t丹东市\t210681\t东港市\n" +
                "06\t辽宁省\t415\t丹东市\t210682\t凤城市\n" +
                "06\t辽宁省\t416\t锦州市\t210702\t古塔区\n" +
                "06\t辽宁省\t416\t锦州市\t210703\t凌河区\n" +
                "06\t辽宁省\t416\t锦州市\t210711\t太和区\n" +
                "06\t辽宁省\t416\t锦州市\t210726\t黑山县\n" +
                "06\t辽宁省\t416\t锦州市\t210727\t义县\n" +
                "06\t辽宁省\t416\t锦州市\t210781\t凌海市\n" +
                "06\t辽宁省\t416\t锦州市\t210782\t北镇市\n" +
                "06\t辽宁省\t417\t营口市\t210802\t站前区\n" +
                "06\t辽宁省\t417\t营口市\t210803\t西市区\n" +
                "06\t辽宁省\t417\t营口市\t210804\t鲅鱼圈区\n" +
                "06\t辽宁省\t417\t营口市\t210811\t老边区\n" +
                "06\t辽宁省\t417\t营口市\t210881\t盖州市\n" +
                "06\t辽宁省\t417\t营口市\t210882\t大石桥市\n" +
                "06\t辽宁省\t418\t阜新市\t210902\t海州区\n" +
                "06\t辽宁省\t418\t阜新市\t210903\t新邱区\n" +
                "06\t辽宁省\t418\t阜新市\t210904\t太平区\n" +
                "06\t辽宁省\t418\t阜新市\t210905\t清河门区\n" +
                "06\t辽宁省\t418\t阜新市\t210911\t细河区\n" +
                "06\t辽宁省\t418\t阜新市\t210921\t阜新蒙古族自治县\n" +
                "06\t辽宁省\t419\t辽阳市\t210922\t彰武县\n" +
                "06\t辽宁省\t419\t辽阳市\t211002\t白塔区\n" +
                "06\t辽宁省\t419\t辽阳市\t211003\t文圣区\n" +
                "06\t辽宁省\t419\t辽阳市\t211004\t宏伟区\n" +
                "06\t辽宁省\t419\t辽阳市\t211005\t弓长岭区\n" +
                "06\t辽宁省\t419\t辽阳市\t211011\t太子河区\n" +
                "06\t辽宁省\t419\t辽阳市\t211021\t辽阳县\n" +
                "06\t辽宁省\t419\t辽阳市\t211081\t灯塔市\n" +
                "06\t辽宁省\t421\t朝阳市\t211302\t双塔区\n" +
                "06\t辽宁省\t421\t朝阳市\t211303\t龙城区\n" +
                "06\t辽宁省\t421\t朝阳市\t211321\t朝阳县\n" +
                "06\t辽宁省\t421\t朝阳市\t211322\t建平县\n" +
                "06\t辽宁省\t421\t朝阳市\t211324\t喀喇沁左翼蒙古族自治县\n" +
                "06\t辽宁省\t421\t朝阳市\t211381\t北票市\n" +
                "06\t辽宁省\t421\t朝阳市\t211382\t凌源市\n" +
                "06\t辽宁省\t427\t盘锦市\t211102\t双台子区\n" +
                "06\t辽宁省\t427\t盘锦市\t211103\t兴隆台区\n" +
                "06\t辽宁省\t427\t盘锦市\t211104\t大洼区\n" +
                "06\t辽宁省\t427\t盘锦市\t211122\t盘山县\n" +
                "06\t辽宁省\t429\t葫芦岛市\t211402\t连山区\n" +
                "06\t辽宁省\t429\t葫芦岛市\t211403\t龙港区\n" +
                "06\t辽宁省\t429\t葫芦岛市\t211404\t南票区\n" +
                "06\t辽宁省\t429\t葫芦岛市\t211421\t绥中县\n" +
                "06\t辽宁省\t429\t葫芦岛市\t211422\t建昌县\n" +
                "06\t辽宁省\t429\t葫芦岛市\t211481\t兴城市\n" +
                "07\t吉林省\t430\t延吉\t222404\t珲春市\n" +
                "07\t吉林省\t431\t长春市\t220102\t南关区\n" +
                "07\t吉林省\t431\t长春市\t220103\t宽城区\n" +
                "07\t吉林省\t431\t长春市\t220104\t朝阳区\n" +
                "07\t吉林省\t431\t长春市\t220105\t二道区\n" +
                "07\t吉林省\t431\t长春市\t220106\t绿园区\n" +
                "07\t吉林省\t431\t长春市\t220112\t双阳区\n" +
                "07\t吉林省\t431\t长春市\t220113\t九台区\n" +
                "07\t吉林省\t431\t长春市\t220122\t农安县\n" +
                "07\t吉林省\t431\t长春市\t220182\t榆树市\n" +
                "07\t吉林省\t431\t长春市\t220183\t德惠市\n" +
                "07\t吉林省\t432\t吉林市\t220202\t昌邑区\n" +
                "07\t吉林省\t432\t吉林市\t220203\t龙潭区\n" +
                "07\t吉林省\t432\t吉林市\t220204\t船营区\n" +
                "07\t吉林省\t432\t吉林市\t220211\t丰满区\n" +
                "07\t吉林省\t432\t吉林市\t220221\t永吉县\n" +
                "07\t吉林省\t432\t吉林市\t220281\t蛟河市\n" +
                "07\t吉林省\t432\t吉林市\t220282\t桦甸市\n" +
                "07\t吉林省\t432\t吉林市\t220283\t舒兰市\n" +
                "07\t吉林省\t432\t吉林市\t220284\t磐石市\n" +
                "07\t吉林省\t433\t延吉\t222401\t延吉市\n" +
                "07\t吉林省\t434\t四平市\t220302\t铁西区\n" +
                "07\t吉林省\t434\t四平市\t220303\t铁东区\n" +
                "07\t吉林省\t434\t四平市\t220322\t梨树县\n" +
                "07\t吉林省\t434\t四平市\t220323\t伊通满族自治县\n" +
                "07\t吉林省\t434\t四平市\t220381\t公主岭市\n" +
                "07\t吉林省\t434\t四平市\t220382\t双辽市\n" +
                "07\t吉林省\t435\t通化市\t220502\t东昌区\n" +
                "07\t吉林省\t435\t通化市\t220503\t二道江区\n" +
                "07\t吉林省\t435\t通化市\t220521\t通化县\n" +
                "07\t吉林省\t435\t通化市\t220523\t辉南县\n" +
                "07\t吉林省\t435\t通化市\t220524\t柳河县\n" +
                "07\t吉林省\t435\t通化市\t220582\t集安市\n" +
                "07\t吉林省\t436\t白城市\t220802\t洮北区\n" +
                "07\t吉林省\t436\t白城市\t220821\t镇赉县\n" +
                "07\t吉林省\t436\t白城市\t220822\t通榆县\n" +
                "07\t吉林省\t436\t白城市\t220881\t洮南市\n" +
                "07\t吉林省\t436\t白城市\t220882\t大安市\n" +
                "07\t吉林省\t437\t辽源市\t220402\t龙山区\n" +
                "07\t吉林省\t437\t辽源市\t220403\t西安区\n" +
                "07\t吉林省\t437\t辽源市\t220421\t东丰县\n" +
                "07\t吉林省\t437\t辽源市\t220422\t东辽县\n" +
                "07\t吉林省\t438\t松原市\t220702\t宁江区\n" +
                "07\t吉林省\t438\t松原市\t220721\t前郭尔罗斯蒙古族自治县\n" +
                "07\t吉林省\t438\t松原市\t220722\t长岭县\n" +
                "07\t吉林省\t438\t松原市\t220723\t乾安县\n" +
                "07\t吉林省\t438\t松原市\t220781\t扶余市\n" +
                "07\t吉林省\t439\t白山市\t220602\t浑江区\n" +
                "07\t吉林省\t439\t白山市\t220605\t江源区\n" +
                "07\t吉林省\t439\t白山市\t220621\t抚松县\n" +
                "07\t吉林省\t439\t白山市\t220622\t靖宇县\n" +
                "07\t吉林省\t439\t白山市\t220623\t长白朝鲜族自治县\n" +
                "07\t吉林省\t439\t白山市\t220681\t临江市\n" +
                "07\t吉林省\t440\t梅河口市\t220581\t梅河口市\n" +
                "07\t吉林省\t430\t延吉\t222402\t图们市\n" +
                "07\t吉林省\t430\t延吉\t222403\t敦化市\n" +
                "07\t吉林省\t430\t延吉\t222405\t龙井市\n" +
                "07\t吉林省\t430\t延吉\t222406\t和龙市\n" +
                "07\t吉林省\t430\t延吉\t222424\t汪清县\n" +
                "07\t吉林省\t430\t延吉\t222426\t安图县\n" +
                "08\t黑龙江省\t449\t佳木斯市\t230803\t向阳区\n" +
                "08\t黑龙江省\t449\t佳木斯市\t230804\t前进区\n" +
                "08\t黑龙江省\t449\t佳木斯市\t230805\t东风区\n" +
                "08\t黑龙江省\t449\t佳木斯市\t230811\t郊区\n" +
                "08\t黑龙江省\t449\t佳木斯市\t230822\t桦南县\n" +
                "08\t黑龙江省\t449\t佳木斯市\t230826\t桦川县\n" +
                "08\t黑龙江省\t449\t佳木斯市\t230828\t汤原县\n" +
                "08\t黑龙江省\t449\t佳木斯市\t230881\t同江市\n" +
                "08\t黑龙江省\t449\t佳木斯市\t230882\t富锦市\n" +
                "08\t黑龙江省\t449\t佳木斯市\t230883\t抚远市\n" +
                "08\t黑龙江省\t450\t阿城市\t230112\t阿城区\n" +
                "08\t黑龙江省\t451\t哈尔滨市\t230102\t道里区\n" +
                "08\t黑龙江省\t451\t哈尔滨市\t230103\t南岗区\n" +
                "08\t黑龙江省\t451\t哈尔滨市\t230104\t道外区\n" +
                "08\t黑龙江省\t451\t哈尔滨市\t230108\t平房区\n" +
                "08\t黑龙江省\t451\t哈尔滨市\t230109\t松北区\n" +
                "08\t黑龙江省\t451\t哈尔滨市\t230110\t香坊区\n" +
                "08\t黑龙江省\t451\t哈尔滨市\t230111\t呼兰区\n" +
                "08\t黑龙江省\t451\t哈尔滨市\t230113\t双城区\n" +
                "08\t黑龙江省\t451\t哈尔滨市\t230123\t依兰县\n" +
                "08\t黑龙江省\t451\t哈尔滨市\t230124\t方正县\n" +
                "08\t黑龙江省\t451\t哈尔滨市\t230125\t宾县\n" +
                "08\t黑龙江省\t451\t哈尔滨市\t230126\t巴彦县\n" +
                "08\t黑龙江省\t451\t哈尔滨市\t230127\t木兰县\n" +
                "08\t黑龙江省\t451\t哈尔滨市\t230128\t通河县\n" +
                "08\t黑龙江省\t451\t哈尔滨市\t230129\t延寿县\n" +
                "08\t黑龙江省\t451\t哈尔滨市\t230183\t尚志市\n" +
                "08\t黑龙江省\t451\t哈尔滨市\t230184\t五常市\n" +
                "08\t黑龙江省\t452\t齐齐哈尔市\t230202\t龙沙区\n" +
                "08\t黑龙江省\t452\t齐齐哈尔市\t230203\t建华区\n" +
                "08\t黑龙江省\t452\t齐齐哈尔市\t230204\t铁锋区\n" +
                "08\t黑龙江省\t452\t齐齐哈尔市\t230205\t昂昂溪区\n" +
                "08\t黑龙江省\t452\t齐齐哈尔市\t230206\t富拉尔基区\n" +
                "08\t黑龙江省\t452\t齐齐哈尔市\t230207\t碾子山区\n" +
                "08\t黑龙江省\t452\t齐齐哈尔市\t230208\t梅里斯达斡尔族区\n" +
                "08\t黑龙江省\t452\t齐齐哈尔市\t230221\t龙江县\n" +
                "08\t黑龙江省\t452\t齐齐哈尔市\t230223\t依安县\n" +
                "08\t黑龙江省\t452\t齐齐哈尔市\t230224\t泰来县\n" +
                "08\t黑龙江省\t452\t齐齐哈尔市\t230225\t甘南县\n" +
                "08\t黑龙江省\t452\t齐齐哈尔市\t230227\t富裕县\n" +
                "08\t黑龙江省\t452\t齐齐哈尔市\t230229\t克山县\n" +
                "08\t黑龙江省\t452\t齐齐哈尔市\t230230\t克东县\n" +
                "08\t黑龙江省\t452\t齐齐哈尔市\t230231\t拜泉县\n" +
                "08\t黑龙江省\t452\t齐齐哈尔市\t230281\t讷河市\n" +
                "08\t黑龙江省\t453\t牡丹江市\t231002\t东安区\n" +
                "08\t黑龙江省\t453\t牡丹江市\t231003\t阳明区\n" +
                "08\t黑龙江省\t453\t牡丹江市\t231004\t爱民区\n" +
                "08\t黑龙江省\t453\t牡丹江市\t231005\t西安区\n" +
                "08\t黑龙江省\t453\t牡丹江市\t231025\t林口县\n" +
                "08\t黑龙江省\t453\t牡丹江市\t231081\t绥芬河市\n" +
                "08\t黑龙江省\t453\t牡丹江市\t231083\t海林市\n" +
                "08\t黑龙江省\t453\t牡丹江市\t231084\t宁安市\n" +
                "08\t黑龙江省\t453\t牡丹江市\t231085\t穆棱市\n" +
                "08\t黑龙江省\t453\t牡丹江市\t231086\t东宁市\n" +
                "08\t黑龙江省\t454\t鹤岗市\t230402\t向阳区\n" +
                "08\t黑龙江省\t454\t鹤岗市\t230403\t工农区\n" +
                "08\t黑龙江省\t454\t鹤岗市\t230404\t南山区\n" +
                "08\t黑龙江省\t454\t鹤岗市\t230405\t兴安区\n" +
                "08\t黑龙江省\t454\t鹤岗市\t230406\t东山区\n" +
                "08\t黑龙江省\t454\t鹤岗市\t230407\t兴山区\n" +
                "08\t黑龙江省\t454\t鹤岗市\t230421\t萝北县\n" +
                "08\t黑龙江省\t454\t鹤岗市\t230422\t绥滨县\n" +
                "08\t黑龙江省\t455\t鸡西市\t230302\t鸡冠区\n" +
                "08\t黑龙江省\t455\t鸡西市\t230303\t恒山区\n" +
                "08\t黑龙江省\t455\t鸡西市\t230304\t滴道区\n" +
                "08\t黑龙江省\t455\t鸡西市\t230305\t梨树区\n" +
                "08\t黑龙江省\t455\t鸡西市\t230306\t城子河区\n" +
                "08\t黑龙江省\t455\t鸡西市\t230307\t麻山区\n" +
                "08\t黑龙江省\t455\t鸡西市\t230321\t鸡东县\n" +
                "08\t黑龙江省\t455\t鸡西市\t230381\t虎林市\n" +
                "08\t黑龙江省\t455\t鸡西市\t230382\t密山市\n" +
                "08\t黑龙江省\t456\t黑河市\t231102\t爱辉区\n" +
                "08\t黑龙江省\t456\t黑河市\t231121\t嫩江县\n" +
                "08\t黑龙江省\t456\t黑河市\t231123\t逊克县\n" +
                "08\t黑龙江省\t456\t黑河市\t231124\t孙吴县\n" +
                "08\t黑龙江省\t456\t黑河市\t231181\t北安市\n" +
                "08\t黑龙江省\t456\t黑河市\t231182\t五大连池市\n" +
                "08\t黑龙江省\t457\t七台河市\t230902\t新兴区\n" +
                "08\t黑龙江省\t457\t七台河市\t230903\t桃山区\n" +
                "08\t黑龙江省\t457\t七台河市\t230904\t茄子河区\n" +
                "08\t黑龙江省\t457\t七台河市\t230921\t勃利县\n" +
                "08\t黑龙江省\t458\t绥化市\t231202\t北林区\n" +
                "08\t黑龙江省\t458\t绥化市\t231221\t望奎县\n" +
                "08\t黑龙江省\t458\t绥化市\t231222\t兰西县\n" +
                "08\t黑龙江省\t458\t绥化市\t231223\t青冈县\n" +
                "08\t黑龙江省\t458\t绥化市\t231224\t庆安县\n" +
                "08\t黑龙江省\t458\t绥化市\t231225\t明水县\n" +
                "08\t黑龙江省\t458\t绥化市\t231226\t绥棱县\n" +
                "08\t黑龙江省\t458\t绥化市\t231281\t安达市\n" +
                "08\t黑龙江省\t458\t绥化市\t231282\t肇东市\n" +
                "08\t黑龙江省\t458\t绥化市\t231283\t海伦市\n" +
                "08\t黑龙江省\t459\t大庆市\t230602\t萨尔图区\n" +
                "08\t黑龙江省\t459\t大庆市\t230603\t龙凤区\n" +
                "08\t黑龙江省\t459\t大庆市\t230604\t让胡路区\n" +
                "08\t黑龙江省\t459\t大庆市\t230605\t红岗区\n" +
                "08\t黑龙江省\t459\t大庆市\t230606\t大同区\n" +
                "08\t黑龙江省\t459\t大庆市\t230621\t肇州县\n" +
                "08\t黑龙江省\t459\t大庆市\t230622\t肇源县\n" +
                "08\t黑龙江省\t459\t大庆市\t230623\t林甸县\n" +
                "08\t黑龙江省\t459\t大庆市\t230624\t杜尔伯特蒙古族自治县\n" +
                "08\t黑龙江省\t460\t大兴安岭\t232721\t呼玛县\n" +
                "08\t黑龙江省\t460\t大兴安岭\t232722\t塔河县\n" +
                "08\t黑龙江省\t460\t大兴安岭\t232723\t漠河县\n" +
                "08\t黑龙江省\t461\t伊春市\t230702\t伊春区\n" +
                "08\t黑龙江省\t461\t伊春市\t230703\t南岔区\n" +
                "08\t黑龙江省\t461\t伊春市\t230704\t友好区\n" +
                "08\t黑龙江省\t461\t伊春市\t230705\t西林区\n" +
                "08\t黑龙江省\t461\t伊春市\t230706\t翠峦区\n" +
                "08\t黑龙江省\t461\t伊春市\t230707\t新青区\n" +
                "08\t黑龙江省\t461\t伊春市\t230708\t美溪区\n" +
                "08\t黑龙江省\t461\t伊春市\t230709\t金山屯区\n" +
                "08\t黑龙江省\t461\t伊春市\t230710\t五营区\n" +
                "08\t黑龙江省\t461\t伊春市\t230711\t乌马河区\n" +
                "08\t黑龙江省\t461\t伊春市\t230712\t汤旺河区\n" +
                "08\t黑龙江省\t461\t伊春市\t230713\t带岭区\n" +
                "08\t黑龙江省\t461\t伊春市\t230714\t乌伊岭区\n" +
                "08\t黑龙江省\t461\t伊春市\t230715\t红星区\n" +
                "08\t黑龙江省\t461\t伊春市\t230716\t上甘岭区\n" +
                "08\t黑龙江省\t461\t伊春市\t230722\t嘉荫县\n" +
                "08\t黑龙江省\t461\t伊春市\t230781\t铁力市\n" +
                "08\t黑龙江省\t448\t双鸭山市\t230502\t尖山区\n" +
                "08\t黑龙江省\t448\t双鸭山市\t230503\t岭东区\n" +
                "08\t黑龙江省\t448\t双鸭山市\t230505\t四方台区\n" +
                "08\t黑龙江省\t448\t双鸭山市\t230506\t宝山区\n" +
                "08\t黑龙江省\t448\t双鸭山市\t230521\t集贤县\n" +
                "08\t黑龙江省\t448\t双鸭山市\t230522\t友谊县\n" +
                "08\t黑龙江省\t448\t双鸭山市\t230523\t宝清县\n" +
                "08\t黑龙江省\t448\t双鸭山市\t230524\t饶河县\n" +
                "09\t上海\t210\t上海市\t310101\t黄浦区\n" +
                "09\t上海\t210\t上海市\t310104\t徐汇区\n" +
                "09\t上海\t210\t上海市\t310105\t长宁区\n" +
                "09\t上海\t210\t上海市\t310106\t静安区\n" +
                "09\t上海\t210\t上海市\t310107\t普陀区\n" +
                "09\t上海\t210\t上海市\t310109\t虹口区\n" +
                "09\t上海\t210\t上海市\t310110\t杨浦区\n" +
                "09\t上海\t210\t上海市\t310112\t闵行区\n" +
                "09\t上海\t210\t上海市\t310113\t宝山区\n" +
                "09\t上海\t210\t上海市\t310114\t嘉定区\n" +
                "09\t上海\t210\t上海市\t310115\t浦东新区\n" +
                "09\t上海\t210\t上海市\t310116\t金山区\n" +
                "09\t上海\t210\t上海市\t310117\t松江区\n" +
                "09\t上海\t210\t上海市\t310118\t青浦区\n" +
                "09\t上海\t210\t上海市\t310120\t奉贤区\n" +
                "09\t上海\t210\t上海市\t310151\t崇明区\n" +
                "10\t江苏省\t250\t南京市\t320102\t玄武区\n" +
                "10\t江苏省\t250\t南京市\t320104\t秦淮区\n" +
                "10\t江苏省\t250\t南京市\t320105\t建邺区\n" +
                "10\t江苏省\t250\t南京市\t320106\t鼓楼区\n" +
                "10\t江苏省\t250\t南京市\t320111\t浦口区\n" +
                "10\t江苏省\t250\t南京市\t320113\t栖霞区\n" +
                "10\t江苏省\t250\t南京市\t320114\t雨花台区\n" +
                "10\t江苏省\t250\t南京市\t320115\t江宁区\n" +
                "10\t江苏省\t250\t南京市\t320116\t六合区\n" +
                "10\t江苏省\t250\t南京市\t320117\t溧水区\n" +
                "10\t江苏省\t250\t南京市\t320118\t高淳区\n" +
                "10\t江苏省\t516\t徐州市\t320305\t贾汪区\n" +
                "10\t江苏省\t516\t徐州市\t320311\t泉山区\n" +
                "10\t江苏省\t516\t徐州市\t320312\t铜山区\n" +
                "10\t江苏省\t516\t徐州市\t320321\t丰县\n" +
                "10\t江苏省\t516\t徐州市\t320322\t沛县\n" +
                "10\t江苏省\t516\t徐州市\t320324\t睢宁县\n" +
                "10\t江苏省\t516\t徐州市\t320381\t新沂市\n" +
                "10\t江苏省\t516\t徐州市\t320382\t邳州市\n" +
                "10\t江苏省\t517\t淮安市\t320803\t淮安区\n" +
                "10\t江苏省\t517\t淮安市\t320804\t淮阴区\n" +
                "10\t江苏省\t517\t淮安市\t320812\t清江浦区\n" +
                "10\t江苏省\t517\t淮安市\t320813\t洪泽区\n" +
                "10\t江苏省\t517\t淮安市\t320826\t涟水县\n" +
                "10\t江苏省\t517\t淮安市\t320830\t盱眙县\n" +
                "10\t江苏省\t517\t淮安市\t320831\t金湖县\n" +
                "10\t江苏省\t518\t连云港市\t320703\t连云区\n" +
                "10\t江苏省\t518\t连云港市\t320706\t海州区\n" +
                "10\t江苏省\t518\t连云港市\t320707\t赣榆区\n" +
                "10\t江苏省\t518\t连云港市\t320722\t东海县\n" +
                "10\t江苏省\t518\t连云港市\t320723\t灌云县\n" +
                "10\t江苏省\t518\t连云港市\t320724\t灌南县\n" +
                "10\t江苏省\t519\t常州市\t320402\t天宁区\n" +
                "10\t江苏省\t519\t常州市\t320404\t钟楼区\n" +
                "10\t江苏省\t519\t常州市\t320411\t新北区\n" +
                "10\t江苏省\t519\t常州市\t320412\t武进区\n" +
                "10\t江苏省\t519\t常州市\t320413\t金坛区\n" +
                "10\t江苏省\t519\t常州市\t320481\t溧阳市\n" +
                "10\t江苏省\t520\t常熟市\t320581\t常熟市\n" +
                "10\t江苏省\t523\t泰州市\t321202\t海陵区\n" +
                "10\t江苏省\t523\t泰州市\t321203\t高港区\n" +
                "10\t江苏省\t523\t泰州市\t321204\t姜堰区\n" +
                "10\t江苏省\t523\t泰州市\t321281\t兴化市\n" +
                "10\t江苏省\t523\t泰州市\t321282\t靖江市\n" +
                "10\t江苏省\t523\t泰州市\t321283\t泰兴市\n" +
                "10\t江苏省\t527\t宿迁市\t321302\t宿城区\n" +
                "10\t江苏省\t527\t宿迁市\t321311\t宿豫区\n" +
                "10\t江苏省\t527\t宿迁市\t321322\t沭阳县\n" +
                "10\t江苏省\t527\t宿迁市\t321323\t泗阳县\n" +
                "10\t江苏省\t527\t宿迁市\t321324\t泗洪县\n" +
                "10\t江苏省\t510\t无锡市\t320205\t锡山区\n" +
                "10\t江苏省\t510\t无锡市\t320206\t惠山区\n" +
                "10\t江苏省\t510\t无锡市\t320211\t滨湖区\n" +
                "10\t江苏省\t510\t无锡市\t320213\t梁溪区\n" +
                "10\t江苏省\t510\t无锡市\t320214\t新吴区\n" +
                "10\t江苏省\t510\t无锡市\t320281\t江阴市\n" +
                "10\t江苏省\t510\t无锡市\t320282\t宜兴市\n" +
                "10\t江苏省\t511\t镇江市\t321102\t京口区\n" +
                "10\t江苏省\t511\t镇江市\t321111\t润州区\n" +
                "10\t江苏省\t511\t镇江市\t321112\t丹徒区\n" +
                "10\t江苏省\t511\t镇江市\t321181\t丹阳市\n" +
                "10\t江苏省\t511\t镇江市\t321182\t扬中市\n" +
                "10\t江苏省\t511\t镇江市\t321183\t句容市\n" +
                "10\t江苏省\t512\t苏州市\t320505\t虎丘区\n" +
                "10\t江苏省\t512\t苏州市\t320506\t吴中区\n" +
                "10\t江苏省\t512\t苏州市\t320507\t相城区\n" +
                "10\t江苏省\t512\t苏州市\t320508\t姑苏区\n" +
                "10\t江苏省\t512\t苏州市\t320509\t吴江区\n" +
                "10\t江苏省\t512\t苏州市\t320582\t张家港市\n" +
                "10\t江苏省\t512\t苏州市\t320583\t昆山市\n" +
                "10\t江苏省\t512\t苏州市\t320585\t太仓市\n" +
                "10\t江苏省\t513\t南通市\t320602\t崇川区\n" +
                "10\t江苏省\t513\t南通市\t320611\t港闸区\n" +
                "10\t江苏省\t513\t南通市\t320612\t通州区\n" +
                "10\t江苏省\t513\t南通市\t320621\t海安县\n" +
                "10\t江苏省\t513\t南通市\t320623\t如东县\n" +
                "10\t江苏省\t513\t南通市\t320681\t启东市\n" +
                "10\t江苏省\t513\t南通市\t320682\t如皋市\n" +
                "10\t江苏省\t513\t南通市\t320684\t海门市\n" +
                "10\t江苏省\t514\t扬州市\t321002\t广陵区\n" +
                "10\t江苏省\t514\t扬州市\t321003\t邗江区\n" +
                "10\t江苏省\t514\t扬州市\t321012\t江都区\n" +
                "10\t江苏省\t514\t扬州市\t321023\t宝应县\n" +
                "10\t江苏省\t514\t扬州市\t321081\t仪征市\n" +
                "10\t江苏省\t514\t扬州市\t321084\t高邮市\n" +
                "10\t江苏省\t515\t盐城市\t320902\t亭湖区\n" +
                "10\t江苏省\t515\t盐城市\t320903\t盐都区\n" +
                "10\t江苏省\t515\t盐城市\t320904\t大丰区\n" +
                "10\t江苏省\t515\t盐城市\t320921\t响水县\n" +
                "10\t江苏省\t515\t盐城市\t320922\t滨海县\n" +
                "10\t江苏省\t515\t盐城市\t320923\t阜宁县\n" +
                "10\t江苏省\t515\t盐城市\t320924\t射阳县\n" +
                "10\t江苏省\t515\t盐城市\t320925\t建湖县\n" +
                "10\t江苏省\t515\t盐城市\t320981\t东台市\n" +
                "10\t江苏省\t516\t徐州市\t320302\t鼓楼区\n" +
                "10\t江苏省\t516\t徐州市\t320303\t云龙区\n" +
                "11\t浙江省\t570\t衢州市\t330802\t柯城区\n" +
                "11\t浙江省\t570\t衢州市\t330803\t衢江区\n" +
                "11\t浙江省\t570\t衢州市\t330822\t常山县\n" +
                "11\t浙江省\t570\t衢州市\t330824\t开化县\n" +
                "11\t浙江省\t570\t衢州市\t330825\t龙游县\n" +
                "11\t浙江省\t570\t衢州市\t330881\t江山市\n" +
                "11\t浙江省\t571\t杭州市\t330102\t上城区\n" +
                "11\t浙江省\t571\t杭州市\t330103\t下城区\n" +
                "11\t浙江省\t571\t杭州市\t330104\t江干区\n" +
                "11\t浙江省\t571\t杭州市\t330105\t拱墅区\n" +
                "11\t浙江省\t571\t杭州市\t330106\t西湖区\n" +
                "11\t浙江省\t571\t杭州市\t330108\t滨江区\n" +
                "11\t浙江省\t571\t杭州市\t330109\t萧山区\n" +
                "11\t浙江省\t571\t杭州市\t330110\t余杭区\n" +
                "11\t浙江省\t571\t杭州市\t330111\t富阳区\n" +
                "11\t浙江省\t571\t杭州市\t330122\t桐庐县\n" +
                "11\t浙江省\t571\t杭州市\t330127\t淳安县\n" +
                "11\t浙江省\t571\t杭州市\t330182\t建德市\n" +
                "11\t浙江省\t571\t杭州市\t330185\t临安市\n" +
                "11\t浙江省\t572\t湖州市\t330502\t吴兴区\n" +
                "11\t浙江省\t572\t湖州市\t330503\t南浔区\n" +
                "11\t浙江省\t572\t湖州市\t330521\t德清县\n" +
                "11\t浙江省\t572\t湖州市\t330522\t长兴县\n" +
                "11\t浙江省\t572\t湖州市\t330523\t安吉县\n" +
                "11\t浙江省\t573\t嘉兴市\t330402\t南湖区\n" +
                "11\t浙江省\t573\t嘉兴市\t330411\t秀洲区\n" +
                "11\t浙江省\t573\t嘉兴市\t330421\t嘉善县\n" +
                "11\t浙江省\t573\t嘉兴市\t330424\t海盐县\n" +
                "11\t浙江省\t573\t嘉兴市\t330481\t海宁市\n" +
                "11\t浙江省\t573\t嘉兴市\t330482\t平湖市\n" +
                "11\t浙江省\t573\t嘉兴市\t330483\t桐乡市\n" +
                "11\t浙江省\t574\t宁波市\t330203\t海曙区\n" +
                "11\t浙江省\t574\t宁波市\t330204\t江东区\n" +
                "11\t浙江省\t574\t宁波市\t330205\t江北区\n" +
                "11\t浙江省\t574\t宁波市\t330206\t北仑区\n" +
                "11\t浙江省\t574\t宁波市\t330211\t镇海区\n" +
                "11\t浙江省\t574\t宁波市\t330212\t鄞州区\n" +
                "11\t浙江省\t574\t宁波市\t330225\t象山县\n" +
                "11\t浙江省\t574\t宁波市\t330226\t宁海县\n" +
                "11\t浙江省\t574\t宁波市\t330281\t余姚市\n" +
                "11\t浙江省\t574\t宁波市\t330282\t慈溪市\n" +
                "11\t浙江省\t574\t宁波市\t330283\t奉化市\n" +
                "11\t浙江省\t575\t绍兴市\t330602\t越城区\n" +
                "11\t浙江省\t575\t绍兴市\t330603\t柯桥区\n" +
                "11\t浙江省\t575\t绍兴市\t330604\t上虞区\n" +
                "11\t浙江省\t575\t绍兴市\t330624\t新昌县\n" +
                "11\t浙江省\t575\t绍兴市\t330681\t诸暨市\n" +
                "11\t浙江省\t575\t绍兴市\t330683\t嵊州市\n" +
                "11\t浙江省\t576\t台州市\t331002\t椒江区\n" +
                "11\t浙江省\t576\t台州市\t331003\t黄岩区\n" +
                "11\t浙江省\t576\t台州市\t331004\t路桥区\n" +
                "11\t浙江省\t576\t台州市\t331021\t玉环县\n" +
                "11\t浙江省\t576\t台州市\t331022\t三门县\n" +
                "11\t浙江省\t576\t台州市\t331023\t天台县\n" +
                "11\t浙江省\t576\t台州市\t331024\t仙居县\n" +
                "11\t浙江省\t576\t台州市\t331081\t温岭市\n" +
                "11\t浙江省\t576\t台州市\t331082\t临海市\n" +
                "11\t浙江省\t577\t温州市\t330302\t鹿城区\n" +
                "11\t浙江省\t577\t温州市\t330303\t龙湾区\n" +
                "11\t浙江省\t577\t温州市\t330304\t瓯海区\n" +
                "11\t浙江省\t577\t温州市\t330305\t洞头区\n" +
                "11\t浙江省\t577\t温州市\t330324\t永嘉县\n" +
                "11\t浙江省\t577\t温州市\t330326\t平阳县\n" +
                "11\t浙江省\t577\t温州市\t330327\t苍南县\n" +
                "11\t浙江省\t577\t温州市\t330328\t文成县\n" +
                "11\t浙江省\t577\t温州市\t330329\t泰顺县\n" +
                "11\t浙江省\t577\t温州市\t330381\t瑞安市\n" +
                "11\t浙江省\t577\t温州市\t330382\t乐清市\n" +
                "11\t浙江省\t578\t丽水市\t331102\t莲都区\n" +
                "11\t浙江省\t578\t丽水市\t331121\t青田县\n" +
                "11\t浙江省\t578\t丽水市\t331122\t缙云县\n" +
                "11\t浙江省\t578\t丽水市\t331123\t遂昌县\n" +
                "11\t浙江省\t578\t丽水市\t331124\t松阳县\n" +
                "11\t浙江省\t578\t丽水市\t331125\t云和县\n" +
                "11\t浙江省\t578\t丽水市\t331126\t庆元县\n" +
                "11\t浙江省\t578\t丽水市\t331127\t景宁畲族自治县\n" +
                "11\t浙江省\t578\t丽水市\t331181\t龙泉市\n" +
                "11\t浙江省\t579\t金华市\t330702\t婺城区\n" +
                "11\t浙江省\t579\t金华市\t330703\t金东区\n" +
                "11\t浙江省\t579\t金华市\t330723\t武义县\n" +
                "11\t浙江省\t579\t金华市\t330726\t浦江县\n" +
                "11\t浙江省\t579\t金华市\t330727\t磐安县\n" +
                "11\t浙江省\t579\t金华市\t330781\t兰溪市\n" +
                "11\t浙江省\t579\t金华市\t330782\t义乌市\n" +
                "11\t浙江省\t579\t金华市\t330783\t东阳市\n" +
                "11\t浙江省\t579\t金华市\t330784\t永康市\n" +
                "11\t浙江省\t580\t舟山市\t330902\t定海区\n" +
                "11\t浙江省\t580\t舟山市\t330903\t普陀区\n" +
                "11\t浙江省\t580\t舟山市\t330921\t岱山县\n" +
                "11\t浙江省\t580\t舟山市\t330922\t嵊泗县\n" +
                "12\t安徽省\t551\t合肥市\t340125\t巢湖区\n" +
                "12\t安徽省\t550\t滁州市\t341102\t琅琊区\n" +
                "12\t安徽省\t550\t滁州市\t341103\t南谯区\n" +
                "12\t安徽省\t550\t滁州市\t341122\t来安县\n" +
                "12\t安徽省\t550\t滁州市\t341124\t全椒县\n" +
                "12\t安徽省\t550\t滁州市\t341125\t定远县\n" +
                "12\t安徽省\t550\t滁州市\t341126\t凤阳县\n" +
                "12\t安徽省\t550\t滁州市\t341181\t天长市\n" +
                "12\t安徽省\t550\t滁州市\t341182\t明光市\n" +
                "12\t安徽省\t551\t合肥市\t340102\t瑶海区\n" +
                "12\t安徽省\t551\t合肥市\t340103\t庐阳区\n" +
                "12\t安徽省\t551\t合肥市\t340104\t蜀山区\n" +
                "12\t安徽省\t551\t合肥市\t340111\t包河区\n" +
                "12\t安徽省\t551\t合肥市\t340121\t长丰县\n" +
                "12\t安徽省\t551\t合肥市\t340122\t肥东县\n" +
                "12\t安徽省\t551\t合肥市\t340123\t肥西县\n" +
                "12\t安徽省\t551\t合肥市\t340124\t庐江县\n" +
                "12\t安徽省\t552\t蚌埠市\t340302\t龙子湖区\n" +
                "12\t安徽省\t552\t蚌埠市\t340303\t蚌山区\n" +
                "12\t安徽省\t552\t蚌埠市\t340304\t禹会区\n" +
                "12\t安徽省\t552\t蚌埠市\t340311\t淮上区\n" +
                "12\t安徽省\t552\t蚌埠市\t340321\t怀远县\n" +
                "12\t安徽省\t552\t蚌埠市\t340322\t五河县\n" +
                "12\t安徽省\t552\t蚌埠市\t340323\t固镇县\n" +
                "12\t安徽省\t553\t芜湖市\t340202\t镜湖区\n" +
                "12\t安徽省\t553\t芜湖市\t340203\t弋江区\n" +
                "12\t安徽省\t553\t芜湖市\t340207\t鸠江区\n" +
                "12\t安徽省\t553\t芜湖市\t340208\t三山区\n" +
                "12\t安徽省\t553\t芜湖市\t340221\t芜湖县\n" +
                "12\t安徽省\t553\t芜湖市\t340222\t繁昌县\n" +
                "12\t安徽省\t553\t芜湖市\t340223\t南陵县\n" +
                "12\t安徽省\t553\t芜湖市\t340225\t无为县\n" +
                "12\t安徽省\t554\t淮南市\t340402\t大通区\n" +
                "12\t安徽省\t554\t淮南市\t340403\t田家庵区\n" +
                "12\t安徽省\t554\t淮南市\t340404\t谢家集区\n" +
                "12\t安徽省\t554\t淮南市\t340405\t八公山区\n" +
                "12\t安徽省\t554\t淮南市\t340406\t潘集区\n" +
                "12\t安徽省\t554\t淮南市\t340421\t凤台县\n" +
                "12\t安徽省\t554\t淮南市\t340422\t寿县\n" +
                "12\t安徽省\t555\t马鞍山市\t340503\t花山区\n" +
                "12\t安徽省\t555\t马鞍山市\t340504\t雨山区\n" +
                "12\t安徽省\t555\t马鞍山市\t340506\t博望区\n" +
                "12\t安徽省\t555\t马鞍山市\t340521\t当涂县\n" +
                "12\t安徽省\t555\t马鞍山市\t340522\t含山县\n" +
                "12\t安徽省\t555\t马鞍山市\t340523\t和县\n" +
                "12\t安徽省\t556\t安庆市\t340802\t迎江区\n" +
                "12\t安徽省\t556\t安庆市\t340803\t大观区\n" +
                "12\t安徽省\t556\t安庆市\t340811\t宜秀区\n" +
                "12\t安徽省\t556\t安庆市\t340822\t怀宁县\n" +
                "12\t安徽省\t556\t安庆市\t340824\t潜山县\n" +
                "12\t安徽省\t556\t安庆市\t340825\t太湖县\n" +
                "12\t安徽省\t556\t安庆市\t340826\t宿松县\n" +
                "12\t安徽省\t556\t安庆市\t340827\t望江县\n" +
                "12\t安徽省\t556\t安庆市\t340828\t岳西县\n" +
                "12\t安徽省\t556\t安庆市\t340881\t桐城市\n" +
                "12\t安徽省\t557\t宿州市\t341302\t埇桥区\n" +
                "12\t安徽省\t557\t宿州市\t341321\t砀山县\n" +
                "12\t安徽省\t557\t宿州市\t341322\t萧县\n" +
                "12\t安徽省\t557\t宿州市\t341323\t灵璧县\n" +
                "12\t安徽省\t557\t宿州市\t341324\t泗县\n" +
                "12\t安徽省\t558\t阜阳市\t341202\t颍州区\n" +
                "12\t安徽省\t558\t阜阳市\t341203\t颍东区\n" +
                "12\t安徽省\t558\t阜阳市\t341204\t颍泉区\n" +
                "12\t安徽省\t558\t阜阳市\t341221\t临泉县\n" +
                "12\t安徽省\t558\t阜阳市\t341222\t太和县\n" +
                "12\t安徽省\t558\t阜阳市\t341225\t阜南县\n" +
                "12\t安徽省\t558\t阜阳市\t341226\t颍上县\n" +
                "12\t安徽省\t558\t阜阳市\t341282\t界首市\n" +
                "12\t安徽省\t559\t黄山市\t341002\t屯溪区\n" +
                "12\t安徽省\t559\t黄山市\t341003\t黄山区\n" +
                "12\t安徽省\t559\t黄山市\t341004\t徽州区\n" +
                "12\t安徽省\t559\t黄山市\t341021\t歙县\n" +
                "12\t安徽省\t559\t黄山市\t341022\t休宁县\n" +
                "12\t安徽省\t559\t黄山市\t341023\t黟县\n" +
                "12\t安徽省\t559\t黄山市\t341024\t祁门县\n" +
                "12\t安徽省\t560\t毫州市\t341602\t谯城区\n" +
                "12\t安徽省\t560\t毫州市\t341621\t涡阳县\n" +
                "12\t安徽省\t560\t毫州市\t341622\t蒙城县\n" +
                "12\t安徽省\t560\t毫州市\t341623\t利辛县\n" +
                "12\t安徽省\t561\t淮北市\t340602\t杜集区\n" +
                "12\t安徽省\t561\t淮北市\t340603\t相山区\n" +
                "12\t安徽省\t561\t淮北市\t340604\t烈山区\n" +
                "12\t安徽省\t561\t淮北市\t340621\t濉溪县\n" +
                "12\t安徽省\t562\t铜陵市\t340705\t铜官区\n" +
                "12\t安徽省\t562\t铜陵市\t340706\t义安区\n" +
                "12\t安徽省\t562\t铜陵市\t340711\t郊区\n" +
                "12\t安徽省\t562\t铜陵市\t340722\t枞阳县\n" +
                "12\t安徽省\t563\t宣城市\t341802\t宣州区\n" +
                "12\t安徽省\t563\t宣城市\t341821\t郎溪县\n" +
                "12\t安徽省\t563\t宣城市\t341822\t广德县\n" +
                "12\t安徽省\t563\t宣城市\t341823\t泾县\n" +
                "12\t安徽省\t563\t宣城市\t341824\t绩溪县\n" +
                "12\t安徽省\t563\t宣城市\t341825\t旌德县\n" +
                "12\t安徽省\t563\t宣城市\t341881\t宁国市\n" +
                "12\t安徽省\t564\t六安市\t341502\t金安区\n" +
                "12\t安徽省\t564\t六安市\t341503\t裕安区\n" +
                "12\t安徽省\t564\t六安市\t341504\t叶集区\n" +
                "12\t安徽省\t564\t六安市\t341522\t霍邱县\n" +
                "12\t安徽省\t564\t六安市\t341523\t舒城县\n" +
                "12\t安徽省\t564\t六安市\t341524\t金寨县\n" +
                "12\t安徽省\t564\t六安市\t341525\t霍山县\n" +
                "12\t安徽省\t565\t巢湖市\t340181\t巢湖市\n" +
                "12\t安徽省\t566\t池州市\t341702\t贵池区\n" +
                "12\t安徽省\t566\t池州市\t341721\t东至县\n" +
                "12\t安徽省\t566\t池州市\t341722\t石台县\n" +
                "12\t安徽省\t566\t池州市\t341723\t青阳县\n" +
                "13\t福建省\t592\t厦门市\t350211\t集美区\n" +
                "13\t福建省\t592\t厦门市\t350212\t同安区\n" +
                "13\t福建省\t592\t厦门市\t350213\t翔安区\n" +
                "13\t福建省\t593\t宁德市\t350902\t蕉城区\n" +
                "13\t福建省\t593\t宁德市\t350921\t霞浦县\n" +
                "13\t福建省\t593\t宁德市\t350922\t古田县\n" +
                "13\t福建省\t593\t宁德市\t350923\t屏南县\n" +
                "13\t福建省\t593\t宁德市\t350924\t寿宁县\n" +
                "13\t福建省\t593\t宁德市\t350925\t周宁县\n" +
                "13\t福建省\t593\t宁德市\t350926\t柘荣县\n" +
                "13\t福建省\t593\t宁德市\t350981\t福安市\n" +
                "13\t福建省\t593\t宁德市\t350982\t福鼎市\n" +
                "13\t福建省\t594\t莆田市\t350302\t城厢区\n" +
                "13\t福建省\t594\t莆田市\t350303\t涵江区\n" +
                "13\t福建省\t594\t莆田市\t350304\t荔城区\n" +
                "13\t福建省\t594\t莆田市\t350305\t秀屿区\n" +
                "13\t福建省\t594\t莆田市\t350322\t仙游县\n" +
                "13\t福建省\t595\t泉州市\t350502\t鲤城区\n" +
                "13\t福建省\t595\t泉州市\t350503\t丰泽区\n" +
                "13\t福建省\t595\t泉州市\t350504\t洛江区\n" +
                "13\t福建省\t595\t泉州市\t350505\t泉港区\n" +
                "13\t福建省\t595\t泉州市\t350521\t惠安县\n" +
                "13\t福建省\t595\t泉州市\t350524\t安溪县\n" +
                "13\t福建省\t595\t泉州市\t350525\t永春县\n" +
                "13\t福建省\t595\t泉州市\t350526\t德化县\n" +
                "13\t福建省\t595\t泉州市\t350527\t金门县\n" +
                "13\t福建省\t595\t泉州市\t350581\t石狮市\n" +
                "13\t福建省\t595\t泉州市\t350582\t晋江市\n" +
                "13\t福建省\t595\t泉州市\t350583\t南安市\n" +
                "13\t福建省\t596\t漳州市\t350602\t芗城区\n" +
                "13\t福建省\t596\t漳州市\t350603\t龙文区\n" +
                "13\t福建省\t596\t漳州市\t350622\t云霄县\n" +
                "13\t福建省\t596\t漳州市\t350623\t漳浦县\n" +
                "13\t福建省\t596\t漳州市\t350624\t诏安县\n" +
                "13\t福建省\t596\t漳州市\t350625\t长泰县\n" +
                "13\t福建省\t596\t漳州市\t350626\t东山县\n" +
                "13\t福建省\t596\t漳州市\t350627\t南靖县\n" +
                "13\t福建省\t596\t漳州市\t350628\t平和县\n" +
                "13\t福建省\t596\t漳州市\t350629\t华安县\n" +
                "13\t福建省\t596\t漳州市\t350681\t龙海市\n" +
                "13\t福建省\t597\t龙岩市\t350802\t新罗区\n" +
                "13\t福建省\t597\t龙岩市\t350803\t永定区\n" +
                "13\t福建省\t597\t龙岩市\t350821\t长汀县\n" +
                "13\t福建省\t597\t龙岩市\t350823\t上杭县\n" +
                "13\t福建省\t597\t龙岩市\t350824\t武平县\n" +
                "13\t福建省\t597\t龙岩市\t350825\t连城县\n" +
                "13\t福建省\t597\t龙岩市\t350881\t漳平市\n" +
                "13\t福建省\t598\t三明市\t350402\t梅列区\n" +
                "13\t福建省\t598\t三明市\t350403\t三元区\n" +
                "13\t福建省\t598\t三明市\t350421\t明溪县\n" +
                "13\t福建省\t598\t三明市\t350423\t清流县\n" +
                "13\t福建省\t598\t三明市\t350424\t宁化县\n" +
                "13\t福建省\t598\t三明市\t350425\t大田县\n" +
                "13\t福建省\t598\t三明市\t350426\t尤溪县\n" +
                "13\t福建省\t598\t三明市\t350427\t沙县\n" +
                "13\t福建省\t598\t三明市\t350428\t将乐县\n" +
                "13\t福建省\t598\t三明市\t350429\t泰宁县\n" +
                "13\t福建省\t598\t三明市\t350430\t建宁县\n" +
                "13\t福建省\t598\t三明市\t350481\t永安市\n" +
                "13\t福建省\t599\t南平市\t350702\t延平区\n" +
                "13\t福建省\t599\t南平市\t350703\t建阳区\n" +
                "13\t福建省\t599\t南平市\t350721\t顺昌县\n" +
                "13\t福建省\t599\t南平市\t350722\t浦城县\n" +
                "13\t福建省\t599\t南平市\t350723\t光泽县\n" +
                "13\t福建省\t599\t南平市\t350724\t松溪县\n" +
                "13\t福建省\t599\t南平市\t350725\t政和县\n" +
                "13\t福建省\t599\t南平市\t350781\t邵武市\n" +
                "13\t福建省\t599\t南平市\t350782\t武夷山市\n" +
                "13\t福建省\t599\t南平市\t350783\t建瓯市\n" +
                "13\t福建省\t591\t福州市\t350102\t鼓楼区\n" +
                "13\t福建省\t591\t福州市\t350103\t台江区\n" +
                "13\t福建省\t591\t福州市\t350104\t仓山区\n" +
                "13\t福建省\t591\t福州市\t350105\t马尾区\n" +
                "13\t福建省\t591\t福州市\t350111\t晋安区\n" +
                "13\t福建省\t591\t福州市\t350121\t闽侯县\n" +
                "13\t福建省\t591\t福州市\t350122\t连江县\n" +
                "13\t福建省\t591\t福州市\t350123\t罗源县\n" +
                "13\t福建省\t591\t福州市\t350124\t闽清县\n" +
                "13\t福建省\t591\t福州市\t350125\t永泰县\n" +
                "13\t福建省\t591\t福州市\t350128\t平潭县\n" +
                "13\t福建省\t591\t福州市\t350181\t福清市\n" +
                "13\t福建省\t591\t福州市\t350182\t长乐市\n" +
                "13\t福建省\t592\t厦门市\t350203\t思明区\n" +
                "13\t福建省\t592\t厦门市\t350205\t海沧区\n" +
                "13\t福建省\t592\t厦门市\t350206\t湖里区\n" +
                "14\t江西省\t797\t赣州市\t360725\t崇义县\n" +
                "14\t江西省\t797\t赣州市\t360726\t安远县\n" +
                "14\t江西省\t797\t赣州市\t360727\t龙南县\n" +
                "14\t江西省\t797\t赣州市\t360728\t定南县\n" +
                "14\t江西省\t797\t赣州市\t360729\t全南县\n" +
                "14\t江西省\t797\t赣州市\t360730\t宁都县\n" +
                "14\t江西省\t797\t赣州市\t360731\t于都县\n" +
                "14\t江西省\t797\t赣州市\t360732\t兴国县\n" +
                "14\t江西省\t797\t赣州市\t360733\t会昌县\n" +
                "14\t江西省\t797\t赣州市\t360734\t寻乌县\n" +
                "14\t江西省\t797\t赣州市\t360735\t石城县\n" +
                "14\t江西省\t797\t赣州市\t360781\t瑞金市\n" +
                "14\t江西省\t798\t景德镇市\t360202\t昌江区\n" +
                "14\t江西省\t798\t景德镇市\t360203\t珠山区\n" +
                "14\t江西省\t798\t景德镇市\t360222\t浮梁县\n" +
                "14\t江西省\t798\t景德镇市\t360281\t乐平市\n" +
                "14\t江西省\t799\t萍乡市\t360302\t安源区\n" +
                "14\t江西省\t799\t萍乡市\t360313\t湘东区\n" +
                "14\t江西省\t799\t萍乡市\t360321\t莲花县\n" +
                "14\t江西省\t799\t萍乡市\t360322\t上栗县\n" +
                "14\t江西省\t799\t萍乡市\t360323\t芦溪县\n" +
                "14\t江西省\t701\t鹰潭市\t360602\t月湖区\n" +
                "14\t江西省\t701\t鹰潭市\t360622\t余江县\n" +
                "14\t江西省\t701\t鹰潭市\t360681\t贵溪市\n" +
                "14\t江西省\t790\t新余市\t360502\t渝水区\n" +
                "14\t江西省\t790\t新余市\t360521\t分宜县\n" +
                "14\t江西省\t791\t南昌市\t360102\t东湖区\n" +
                "14\t江西省\t791\t南昌市\t360103\t西湖区\n" +
                "14\t江西省\t791\t南昌市\t360104\t青云谱区\n" +
                "14\t江西省\t791\t南昌市\t360105\t湾里区\n" +
                "14\t江西省\t791\t南昌市\t360111\t青山湖区\n" +
                "14\t江西省\t791\t南昌市\t360112\t新建区\n" +
                "14\t江西省\t791\t南昌市\t360121\t南昌县\n" +
                "14\t江西省\t791\t南昌市\t360123\t安义县\n" +
                "14\t江西省\t791\t南昌市\t360124\t进贤县\n" +
                "14\t江西省\t792\t九江市\t360402\t濂溪区\n" +
                "14\t江西省\t792\t九江市\t360403\t浔阳区\n" +
                "14\t江西省\t792\t九江市\t360421\t九江县\n" +
                "14\t江西省\t792\t九江市\t360423\t武宁县\n" +
                "14\t江西省\t792\t九江市\t360424\t修水县\n" +
                "14\t江西省\t792\t九江市\t360425\t永修县\n" +
                "14\t江西省\t792\t九江市\t360426\t德安县\n" +
                "14\t江西省\t792\t九江市\t360428\t都昌县\n" +
                "14\t江西省\t792\t九江市\t360429\t湖口县\n" +
                "14\t江西省\t792\t九江市\t360430\t彭泽县\n" +
                "14\t江西省\t792\t九江市\t360481\t瑞昌市\n" +
                "14\t江西省\t792\t九江市\t360482\t共青城市\n" +
                "14\t江西省\t792\t九江市\t360483\t庐山市\n" +
                "14\t江西省\t793\t上饶市\t361102\t信州区\n" +
                "14\t江西省\t793\t上饶市\t361103\t广丰区\n" +
                "14\t江西省\t793\t上饶市\t361121\t上饶县\n" +
                "14\t江西省\t793\t上饶市\t361123\t玉山县\n" +
                "14\t江西省\t793\t上饶市\t361124\t铅山县\n" +
                "14\t江西省\t793\t上饶市\t361125\t横峰县\n" +
                "14\t江西省\t793\t上饶市\t361126\t弋阳县\n" +
                "14\t江西省\t793\t上饶市\t361127\t余干县\n" +
                "14\t江西省\t793\t上饶市\t361128\t鄱阳县\n" +
                "14\t江西省\t793\t上饶市\t361129\t万年县\n" +
                "14\t江西省\t793\t上饶市\t361130\t婺源县\n" +
                "14\t江西省\t793\t上饶市\t361181\t德兴市\n" +
                "14\t江西省\t794\t抚州市\t361002\t临川区\n" +
                "14\t江西省\t794\t抚州市\t361021\t南城县\n" +
                "14\t江西省\t794\t抚州市\t361022\t黎川县\n" +
                "14\t江西省\t794\t抚州市\t361023\t南丰县\n" +
                "14\t江西省\t794\t抚州市\t361024\t崇仁县\n" +
                "14\t江西省\t794\t抚州市\t361025\t乐安县\n" +
                "14\t江西省\t794\t抚州市\t361026\t宜黄县\n" +
                "14\t江西省\t794\t抚州市\t361027\t金溪县\n" +
                "14\t江西省\t794\t抚州市\t361028\t资溪县\n" +
                "14\t江西省\t794\t抚州市\t361029\t东乡县\n" +
                "14\t江西省\t794\t抚州市\t361030\t广昌县\n" +
                "14\t江西省\t795\t宜春市\t360902\t袁州区\n" +
                "14\t江西省\t795\t宜春市\t360921\t奉新县\n" +
                "14\t江西省\t795\t宜春市\t360922\t万载县\n" +
                "14\t江西省\t795\t宜春市\t360923\t上高县\n" +
                "14\t江西省\t795\t宜春市\t360924\t宜丰县\n" +
                "14\t江西省\t795\t宜春市\t360925\t靖安县\n" +
                "14\t江西省\t795\t宜春市\t360926\t铜鼓县\n" +
                "14\t江西省\t795\t宜春市\t360981\t丰城市\n" +
                "14\t江西省\t795\t宜春市\t360982\t樟树市\n" +
                "14\t江西省\t795\t宜春市\t360983\t高安市\n" +
                "14\t江西省\t796\t吉安市\t360802\t吉州区\n" +
                "14\t江西省\t796\t吉安市\t360803\t青原区\n" +
                "14\t江西省\t796\t吉安市\t360821\t吉安县\n" +
                "14\t江西省\t796\t吉安市\t360822\t吉水县\n" +
                "14\t江西省\t796\t吉安市\t360823\t峡江县\n" +
                "14\t江西省\t796\t吉安市\t360824\t新干县\n" +
                "14\t江西省\t796\t吉安市\t360825\t永丰县\n" +
                "14\t江西省\t796\t吉安市\t360826\t泰和县\n" +
                "14\t江西省\t796\t吉安市\t360827\t遂川县\n" +
                "14\t江西省\t796\t吉安市\t360828\t万安县\n" +
                "14\t江西省\t796\t吉安市\t360829\t安福县\n" +
                "14\t江西省\t796\t吉安市\t360830\t永新县\n" +
                "14\t江西省\t796\t吉安市\t360881\t井冈山市\n" +
                "14\t江西省\t797\t赣州市\t360702\t章贡区\n" +
                "14\t江西省\t797\t赣州市\t360703\t南康区\n" +
                "14\t江西省\t797\t赣州市\t360721\t赣县\n" +
                "14\t江西省\t797\t赣州市\t360722\t信丰县\n" +
                "14\t江西省\t797\t赣州市\t360723\t大余县\n" +
                "14\t江西省\t797\t赣州市\t360724\t上犹县\n" +
                "15\t山东省\t530\t荷泽市\t371702\t牡丹区\n" +
                "15\t山东省\t530\t荷泽市\t371703\t定陶区\n" +
                "15\t山东省\t530\t荷泽市\t371721\t曹县\n" +
                "15\t山东省\t530\t荷泽市\t371722\t单县\n" +
                "15\t山东省\t530\t荷泽市\t371723\t成武县\n" +
                "15\t山东省\t530\t荷泽市\t371724\t巨野县\n" +
                "15\t山东省\t530\t荷泽市\t371725\t郓城县\n" +
                "15\t山东省\t530\t荷泽市\t371726\t鄄城县\n" +
                "15\t山东省\t530\t荷泽市\t371728\t东明县\n" +
                "15\t山东省\t531\t济南市\t370102\t历下区\n" +
                "15\t山东省\t531\t济南市\t370103\t市中区\n" +
                "15\t山东省\t531\t济南市\t370104\t槐荫区\n" +
                "15\t山东省\t531\t济南市\t370105\t天桥区\n" +
                "15\t山东省\t531\t济南市\t370112\t历城区\n" +
                "15\t山东省\t531\t济南市\t370113\t长清区\n" +
                "15\t山东省\t531\t济南市\t370124\t平阴县\n" +
                "15\t山东省\t531\t济南市\t370125\t济阳县\n" +
                "15\t山东省\t531\t济南市\t370126\t商河县\n" +
                "15\t山东省\t531\t济南市\t370181\t章丘市\n" +
                "15\t山东省\t532\t青岛市\t370202\t市南区\n" +
                "15\t山东省\t532\t青岛市\t370203\t市北区\n" +
                "15\t山东省\t532\t青岛市\t370211\t黄岛区\n" +
                "15\t山东省\t532\t青岛市\t370212\t崂山区\n" +
                "15\t山东省\t532\t青岛市\t370213\t李沧区\n" +
                "15\t山东省\t532\t青岛市\t370214\t城阳区\n" +
                "15\t山东省\t532\t青岛市\t370281\t胶州市\n" +
                "15\t山东省\t532\t青岛市\t370282\t即墨市\n" +
                "15\t山东省\t532\t青岛市\t370283\t平度市\n" +
                "15\t山东省\t532\t青岛市\t370285\t莱西市\n" +
                "15\t山东省\t533\t淄博市\t370302\t淄川区\n" +
                "15\t山东省\t533\t淄博市\t370303\t张店区\n" +
                "15\t山东省\t533\t淄博市\t370304\t博山区\n" +
                "15\t山东省\t533\t淄博市\t370305\t临淄区\n" +
                "15\t山东省\t533\t淄博市\t370306\t周村区\n" +
                "15\t山东省\t533\t淄博市\t370321\t桓台县\n" +
                "15\t山东省\t533\t淄博市\t370322\t高青县\n" +
                "15\t山东省\t533\t淄博市\t370323\t沂源县\n" +
                "15\t山东省\t534\t德州市\t371402\t德城区\n" +
                "15\t山东省\t534\t德州市\t371403\t陵城区\n" +
                "15\t山东省\t534\t德州市\t371422\t宁津县\n" +
                "15\t山东省\t534\t德州市\t371423\t庆云县\n" +
                "15\t山东省\t534\t德州市\t371424\t临邑县\n" +
                "15\t山东省\t534\t德州市\t371425\t齐河县\n" +
                "15\t山东省\t534\t德州市\t371426\t平原县\n" +
                "15\t山东省\t534\t德州市\t371427\t夏津县\n" +
                "15\t山东省\t534\t德州市\t371428\t武城县\n" +
                "15\t山东省\t534\t德州市\t371481\t乐陵市\n" +
                "15\t山东省\t534\t德州市\t371482\t禹城市\n" +
                "15\t山东省\t535\t烟台市\t370602\t芝罘区\n" +
                "15\t山东省\t535\t烟台市\t370611\t福山区\n" +
                "15\t山东省\t535\t烟台市\t370612\t牟平区\n" +
                "15\t山东省\t535\t烟台市\t370613\t莱山区\n" +
                "15\t山东省\t535\t烟台市\t370634\t长岛县\n" +
                "15\t山东省\t535\t烟台市\t370681\t龙口市\n" +
                "15\t山东省\t535\t烟台市\t370682\t莱阳市\n" +
                "15\t山东省\t535\t烟台市\t370683\t莱州市\n" +
                "15\t山东省\t535\t烟台市\t370684\t蓬莱市\n" +
                "15\t山东省\t535\t烟台市\t370685\t招远市\n" +
                "15\t山东省\t535\t烟台市\t370686\t栖霞市\n" +
                "15\t山东省\t535\t烟台市\t370687\t海阳市\n" +
                "15\t山东省\t536\t潍坊市\t370702\t潍城区\n" +
                "15\t山东省\t536\t潍坊市\t370703\t寒亭区\n" +
                "15\t山东省\t536\t潍坊市\t370704\t坊子区\n" +
                "15\t山东省\t536\t潍坊市\t370705\t奎文区\n" +
                "15\t山东省\t536\t潍坊市\t370724\t临朐县\n" +
                "15\t山东省\t536\t潍坊市\t370725\t昌乐县\n" +
                "15\t山东省\t536\t潍坊市\t370781\t青州市\n" +
                "15\t山东省\t536\t潍坊市\t370782\t诸城市\n" +
                "15\t山东省\t536\t潍坊市\t370783\t寿光市\n" +
                "15\t山东省\t536\t潍坊市\t370784\t安丘市\n" +
                "15\t山东省\t536\t潍坊市\t370785\t高密市\n" +
                "15\t山东省\t536\t潍坊市\t370786\t昌邑市\n" +
                "15\t山东省\t537\t济宁市\t370811\t任城区\n" +
                "15\t山东省\t537\t济宁市\t370812\t兖州区\n" +
                "15\t山东省\t537\t济宁市\t370826\t微山县\n" +
                "15\t山东省\t537\t济宁市\t370827\t鱼台县\n" +
                "15\t山东省\t537\t济宁市\t370828\t金乡县\n" +
                "15\t山东省\t537\t济宁市\t370829\t嘉祥县\n" +
                "15\t山东省\t537\t济宁市\t370830\t汶上县\n" +
                "15\t山东省\t537\t济宁市\t370831\t泗水县\n" +
                "15\t山东省\t537\t济宁市\t370832\t梁山县\n" +
                "15\t山东省\t537\t济宁市\t370881\t曲阜市\n" +
                "15\t山东省\t537\t济宁市\t370883\t邹城市\n" +
                "15\t山东省\t538\t泰安市\t370902\t泰山区\n" +
                "15\t山东省\t538\t泰安市\t370911\t岱岳区\n" +
                "15\t山东省\t538\t泰安市\t370921\t宁阳县\n" +
                "15\t山东省\t538\t泰安市\t370923\t东平县\n" +
                "15\t山东省\t538\t泰安市\t370982\t新泰市\n" +
                "15\t山东省\t538\t泰安市\t370983\t肥城市\n" +
                "15\t山东省\t539\t临沂市\t371302\t兰山区\n" +
                "15\t山东省\t539\t临沂市\t371311\t罗庄区\n" +
                "15\t山东省\t539\t临沂市\t371312\t河东区\n" +
                "15\t山东省\t539\t临沂市\t371321\t沂南县\n" +
                "15\t山东省\t539\t临沂市\t371322\t郯城县\n" +
                "15\t山东省\t539\t临沂市\t371323\t沂水县\n" +
                "15\t山东省\t539\t临沂市\t371324\t兰陵县\n" +
                "15\t山东省\t539\t临沂市\t371325\t费县\n" +
                "15\t山东省\t539\t临沂市\t371326\t平邑县\n" +
                "15\t山东省\t539\t临沂市\t371327\t莒南县\n" +
                "15\t山东省\t539\t临沂市\t371328\t蒙阴县\n" +
                "15\t山东省\t539\t临沂市\t371329\t临沭县\n" +
                "15\t山东省\t543\t滨州市\t371602\t滨城区\n" +
                "15\t山东省\t543\t滨州市\t371603\t沾化区\n" +
                "15\t山东省\t543\t滨州市\t371621\t惠民县\n" +
                "15\t山东省\t543\t滨州市\t371622\t阳信县\n" +
                "15\t山东省\t543\t滨州市\t371623\t无棣县\n" +
                "15\t山东省\t543\t滨州市\t371625\t博兴县\n" +
                "15\t山东省\t543\t滨州市\t371626\t邹平县\n" +
                "15\t山东省\t546\t东营市\t370502\t东营区\n" +
                "15\t山东省\t546\t东营市\t370503\t河口区\n" +
                "15\t山东省\t546\t东营市\t370505\t垦利区\n" +
                "15\t山东省\t546\t东营市\t370522\t利津县\n" +
                "15\t山东省\t546\t东营市\t370523\t广饶县\n" +
                "15\t山东省\t631\t威海市\t371002\t环翠区\n" +
                "15\t山东省\t631\t威海市\t371003\t文登区\n" +
                "15\t山东省\t631\t威海市\t371082\t荣成市\n" +
                "15\t山东省\t631\t威海市\t371083\t乳山市\n" +
                "15\t山东省\t632\t枣庄市\t370402\t市中区\n" +
                "15\t山东省\t632\t枣庄市\t370403\t薛城区\n" +
                "15\t山东省\t632\t枣庄市\t370404\t峄城区\n" +
                "15\t山东省\t632\t枣庄市\t370405\t台儿庄区\n" +
                "15\t山东省\t632\t枣庄市\t370406\t山亭区\n" +
                "15\t山东省\t632\t枣庄市\t370481\t滕州市\n" +
                "15\t山东省\t633\t日照市\t371102\t东港区\n" +
                "15\t山东省\t633\t日照市\t371103\t岚山区\n" +
                "15\t山东省\t633\t日照市\t371121\t五莲县\n" +
                "15\t山东省\t633\t日照市\t371122\t莒县\n" +
                "15\t山东省\t634\t莱芜市\t371202\t莱城区\n" +
                "15\t山东省\t634\t莱芜市\t371203\t钢城区\n" +
                "15\t山东省\t635\t聊城市\t371502\t东昌府区\n" +
                "15\t山东省\t635\t聊城市\t371521\t阳谷县\n" +
                "15\t山东省\t635\t聊城市\t371522\t莘县\n" +
                "15\t山东省\t635\t聊城市\t371523\t茌平县\n" +
                "15\t山东省\t635\t聊城市\t371524\t东阿县\n" +
                "15\t山东省\t635\t聊城市\t371525\t冠县\n" +
                "15\t山东省\t635\t聊城市\t371526\t高唐县\n" +
                "15\t山东省\t635\t聊城市\t371581\t临清市\n" +
                "16\t河南省\t370\t商丘市\t411402\t梁园区\n" +
                "16\t河南省\t370\t商丘市\t411403\t睢阳区\n" +
                "16\t河南省\t370\t商丘市\t411421\t民权县\n" +
                "16\t河南省\t370\t商丘市\t411422\t睢县\n" +
                "16\t河南省\t370\t商丘市\t411423\t宁陵县\n" +
                "16\t河南省\t370\t商丘市\t411424\t柘城县\n" +
                "16\t河南省\t370\t商丘市\t411425\t虞城县\n" +
                "16\t河南省\t370\t商丘市\t411426\t夏邑县\n" +
                "16\t河南省\t370\t商丘市\t411481\t永城市\n" +
                "16\t河南省\t371\t郑州市\t410102\t中原区\n" +
                "16\t河南省\t371\t郑州市\t410103\t二七区\n" +
                "16\t河南省\t371\t郑州市\t410104\t管城回族区\n" +
                "16\t河南省\t371\t郑州市\t410105\t金水区\n" +
                "16\t河南省\t371\t郑州市\t410106\t上街区\n" +
                "16\t河南省\t371\t郑州市\t410108\t惠济区\n" +
                "16\t河南省\t371\t郑州市\t410122\t中牟县\n" +
                "16\t河南省\t371\t郑州市\t410181\t巩义市\n" +
                "16\t河南省\t371\t郑州市\t410182\t荥阳市\n" +
                "16\t河南省\t371\t郑州市\t410183\t新密市\n" +
                "16\t河南省\t371\t郑州市\t410184\t新郑市\n" +
                "16\t河南省\t371\t郑州市\t410185\t登封市\n" +
                "16\t河南省\t372\t安阳市\t410502\t文峰区\n" +
                "16\t河南省\t372\t安阳市\t410503\t北关区\n" +
                "16\t河南省\t372\t安阳市\t410505\t殷都区\n" +
                "16\t河南省\t372\t安阳市\t410506\t龙安区\n" +
                "16\t河南省\t372\t安阳市\t410522\t安阳县\n" +
                "16\t河南省\t372\t安阳市\t410523\t汤阴县\n" +
                "16\t河南省\t372\t安阳市\t410526\t滑县\n" +
                "16\t河南省\t372\t安阳市\t410527\t内黄县\n" +
                "16\t河南省\t372\t安阳市\t410581\t林州市\n" +
                "16\t河南省\t373\t新乡市\t410702\t红旗区\n" +
                "16\t河南省\t373\t新乡市\t410703\t卫滨区\n" +
                "16\t河南省\t373\t新乡市\t410704\t凤泉区\n" +
                "16\t河南省\t373\t新乡市\t410711\t牧野区\n" +
                "16\t河南省\t373\t新乡市\t410721\t新乡县\n" +
                "16\t河南省\t373\t新乡市\t410724\t获嘉县\n" +
                "16\t河南省\t373\t新乡市\t410725\t原阳县\n" +
                "16\t河南省\t373\t新乡市\t410726\t延津县\n" +
                "16\t河南省\t373\t新乡市\t410727\t封丘县\n" +
                "16\t河南省\t373\t新乡市\t410728\t长垣县\n" +
                "16\t河南省\t373\t新乡市\t410781\t卫辉市\n" +
                "16\t河南省\t373\t新乡市\t410782\t辉县市\n" +
                "16\t河南省\t374\t许昌市\t411002\t魏都区\n" +
                "16\t河南省\t374\t许昌市\t411023\t许昌县\n" +
                "16\t河南省\t374\t许昌市\t411024\t鄢陵县\n" +
                "16\t河南省\t374\t许昌市\t411025\t襄城县\n" +
                "16\t河南省\t374\t许昌市\t411081\t禹州市\n" +
                "16\t河南省\t374\t许昌市\t411082\t长葛市\n" +
                "16\t河南省\t375\t平顶山市\t410402\t新华区\n" +
                "16\t河南省\t375\t平顶山市\t410403\t卫东区\n" +
                "16\t河南省\t375\t平顶山市\t410404\t石龙区\n" +
                "16\t河南省\t375\t平顶山市\t410411\t湛河区\n" +
                "16\t河南省\t375\t平顶山市\t410421\t宝丰县\n" +
                "16\t河南省\t375\t平顶山市\t410422\t叶县\n" +
                "16\t河南省\t375\t平顶山市\t410423\t鲁山县\n" +
                "16\t河南省\t375\t平顶山市\t410425\t郏县\n" +
                "16\t河南省\t375\t平顶山市\t410481\t舞钢市\n" +
                "16\t河南省\t375\t平顶山市\t410482\t汝州市\n" +
                "16\t河南省\t376\t信阳市\t411502\t浉河区\n" +
                "16\t河南省\t376\t信阳市\t411503\t平桥区\n" +
                "16\t河南省\t376\t信阳市\t411521\t罗山县\n" +
                "16\t河南省\t376\t信阳市\t411522\t光山县\n" +
                "16\t河南省\t376\t信阳市\t411523\t新县\n" +
                "16\t河南省\t376\t信阳市\t411524\t商城县\n" +
                "16\t河南省\t376\t信阳市\t411525\t固始县\n" +
                "16\t河南省\t376\t信阳市\t411527\t淮滨县\n" +
                "16\t河南省\t376\t信阳市\t411528\t息县\n" +
                "16\t河南省\t377\t南阳市\t411302\t宛城区\n" +
                "16\t河南省\t377\t南阳市\t411303\t卧龙区\n" +
                "16\t河南省\t377\t南阳市\t411321\t南召县\n" +
                "16\t河南省\t377\t南阳市\t411322\t方城县\n" +
                "16\t河南省\t377\t南阳市\t411323\t西峡县\n" +
                "16\t河南省\t377\t南阳市\t411324\t镇平县\n" +
                "16\t河南省\t377\t南阳市\t411325\t内乡县\n" +
                "16\t河南省\t377\t南阳市\t411326\t淅川县\n" +
                "16\t河南省\t377\t南阳市\t411327\t社旗县\n" +
                "16\t河南省\t377\t南阳市\t411328\t唐河县\n" +
                "16\t河南省\t377\t南阳市\t411329\t新野县\n" +
                "16\t河南省\t377\t南阳市\t411330\t桐柏县\n" +
                "16\t河南省\t377\t南阳市\t411381\t邓州市\n" +
                "16\t河南省\t378\t开封市\t410202\t龙亭区\n" +
                "16\t河南省\t378\t开封市\t410203\t顺河回族区\n" +
                "16\t河南省\t378\t开封市\t410204\t鼓楼区\n" +
                "16\t河南省\t378\t开封市\t410205\t禹王台区\n" +
                "16\t河南省\t378\t开封市\t410211\t金明区\n" +
                "16\t河南省\t378\t开封市\t410212\t祥符区\n" +
                "16\t河南省\t378\t开封市\t410221\t杞县\n" +
                "16\t河南省\t378\t开封市\t410222\t通许县\n" +
                "16\t河南省\t378\t开封市\t410223\t尉氏县\n" +
                "16\t河南省\t378\t开封市\t410225\t兰考县\n" +
                "16\t河南省\t379\t洛阳市\t410302\t老城区\n" +
                "16\t河南省\t379\t洛阳市\t410303\t西工区\n" +
                "16\t河南省\t379\t洛阳市\t410304\t瀍河回族区\n" +
                "16\t河南省\t379\t洛阳市\t410305\t涧西区\n" +
                "16\t河南省\t379\t洛阳市\t410306\t吉利区\n" +
                "16\t河南省\t379\t洛阳市\t410311\t洛龙区\n" +
                "16\t河南省\t379\t洛阳市\t410322\t孟津县\n" +
                "16\t河南省\t379\t洛阳市\t410323\t新安县\n" +
                "16\t河南省\t379\t洛阳市\t410324\t栾川县\n" +
                "16\t河南省\t379\t洛阳市\t410325\t嵩县\n" +
                "16\t河南省\t379\t洛阳市\t410326\t汝阳县\n" +
                "16\t河南省\t379\t洛阳市\t410327\t宜阳县\n" +
                "16\t河南省\t379\t洛阳市\t410328\t洛宁县\n" +
                "16\t河南省\t379\t洛阳市\t410329\t伊川县\n" +
                "16\t河南省\t379\t洛阳市\t410381\t偃师市\n" +
                "16\t河南省\t380\t潢川市\t411526\t潢川县\n" +
                "16\t河南省\t391\t焦作市\t410802\t解放区\n" +
                "16\t河南省\t391\t焦作市\t410803\t中站区\n" +
                "16\t河南省\t391\t焦作市\t410804\t马村区\n" +
                "16\t河南省\t391\t焦作市\t410811\t山阳区\n" +
                "16\t河南省\t391\t焦作市\t410821\t修武县\n" +
                "16\t河南省\t391\t焦作市\t410822\t博爱县\n" +
                "16\t河南省\t391\t焦作市\t410823\t武陟县\n" +
                "16\t河南省\t391\t焦作市\t410825\t温县\n" +
                "16\t河南省\t391\t焦作市\t410882\t沁阳市\n" +
                "16\t河南省\t391\t焦作市\t410883\t孟州市\n" +
                "16\t河南省\t392\t鹤壁市\t410602\t鹤山区\n" +
                "16\t河南省\t392\t鹤壁市\t410603\t山城区\n" +
                "16\t河南省\t392\t鹤壁市\t410611\t淇滨区\n" +
                "16\t河南省\t392\t鹤壁市\t410621\t浚县\n" +
                "16\t河南省\t392\t鹤壁市\t410622\t淇县\n" +
                "16\t河南省\t393\t濮阳市\t410902\t华龙区\n" +
                "16\t河南省\t393\t濮阳市\t410922\t清丰县\n" +
                "16\t河南省\t393\t濮阳市\t410923\t南乐县\n" +
                "16\t河南省\t393\t濮阳市\t410926\t范县\n" +
                "16\t河南省\t393\t濮阳市\t410927\t台前县\n" +
                "16\t河南省\t393\t濮阳市\t410928\t濮阳县\n" +
                "16\t河南省\t394\t周口市\t411602\t川汇区\n" +
                "16\t河南省\t394\t周口市\t411621\t扶沟县\n" +
                "16\t河南省\t394\t周口市\t411622\t西华县\n" +
                "16\t河南省\t394\t周口市\t411623\t商水县\n" +
                "16\t河南省\t394\t周口市\t411624\t沈丘县\n" +
                "16\t河南省\t394\t周口市\t411625\t郸城县\n" +
                "16\t河南省\t394\t周口市\t411626\t淮阳县\n" +
                "16\t河南省\t394\t周口市\t411627\t太康县\n" +
                "16\t河南省\t394\t周口市\t411628\t鹿邑县\n" +
                "16\t河南省\t394\t周口市\t411681\t项城市\n" +
                "16\t河南省\t395\t漯河市\t411102\t源汇区\n" +
                "16\t河南省\t395\t漯河市\t411103\t郾城区\n" +
                "16\t河南省\t395\t漯河市\t411104\t召陵区\n" +
                "16\t河南省\t395\t漯河市\t411121\t舞阳县\n" +
                "16\t河南省\t395\t漯河市\t411122\t临颍县\n" +
                "16\t河南省\t396\t驻马店市\t411702\t驿城区\n" +
                "16\t河南省\t396\t驻马店市\t411721\t西平县\n" +
                "16\t河南省\t396\t驻马店市\t411722\t上蔡县\n" +
                "16\t河南省\t396\t驻马店市\t411723\t平舆县\n" +
                "16\t河南省\t396\t驻马店市\t411724\t正阳县\n" +
                "16\t河南省\t396\t驻马店市\t411725\t确山县\n" +
                "16\t河南省\t396\t驻马店市\t411726\t泌阳县\n" +
                "16\t河南省\t396\t驻马店市\t411727\t汝南县\n" +
                "16\t河南省\t396\t驻马店市\t411728\t遂平县\n" +
                "16\t河南省\t396\t驻马店市\t411729\t新蔡县\n" +
                "16\t河南省\t398\t三门峡市\t411202\t湖滨区\n" +
                "16\t河南省\t398\t三门峡市\t411203\t陕州区\n" +
                "16\t河南省\t398\t三门峡市\t411221\t渑池县\n" +
                "16\t河南省\t398\t三门峡市\t411224\t卢氏县\n" +
                "16\t河南省\t398\t三门峡市\t411281\t义马市\n" +
                "16\t河南省\t398\t三门峡市\t411282\t灵宝市\n" +
                "16\t河南省\t399\t济源市\t419001\t济源市\n" +
                "17\t湖北省\t270\t武汉市\t420102\t江岸区\n" +
                "17\t湖北省\t270\t武汉市\t420103\t江汉区\n" +
                "17\t湖北省\t270\t武汉市\t420104\t硚口区\n" +
                "17\t湖北省\t270\t武汉市\t420105\t汉阳区\n" +
                "17\t湖北省\t270\t武汉市\t420106\t武昌区\n" +
                "17\t湖北省\t270\t武汉市\t420107\t青山区\n" +
                "17\t湖北省\t270\t武汉市\t420111\t洪山区\n" +
                "17\t湖北省\t270\t武汉市\t420112\t东西湖区\n" +
                "17\t湖北省\t270\t武汉市\t420113\t汉南区\n" +
                "17\t湖北省\t270\t武汉市\t420114\t蔡甸区\n" +
                "17\t湖北省\t270\t武汉市\t420115\t江夏区\n" +
                "17\t湖北省\t270\t武汉市\t420116\t黄陂区\n" +
                "17\t湖北省\t270\t武汉市\t420117\t新洲区\n" +
                "17\t湖北省\t710\t襄樊市\t420602\t襄城区\n" +
                "17\t湖北省\t710\t襄樊市\t420606\t樊城区\n" +
                "17\t湖北省\t710\t襄樊市\t420607\t襄州区\n" +
                "17\t湖北省\t710\t襄樊市\t420624\t南漳县\n" +
                "17\t湖北省\t710\t襄樊市\t420625\t谷城县\n" +
                "17\t湖北省\t710\t襄樊市\t420626\t保康县\n" +
                "17\t湖北省\t710\t襄樊市\t420682\t老河口市\n" +
                "17\t湖北省\t710\t襄樊市\t420683\t枣阳市\n" +
                "17\t湖北省\t710\t襄樊市\t420684\t宜城市\n" +
                "17\t湖北省\t711\t鄂州市\t420702\t梁子湖区\n" +
                "17\t湖北省\t711\t鄂州市\t420703\t华容区\n" +
                "17\t湖北省\t711\t鄂州市\t420704\t鄂城区\n" +
                "17\t湖北省\t712\t孝感市\t420902\t孝南区\n" +
                "17\t湖北省\t712\t孝感市\t420921\t孝昌县\n" +
                "17\t湖北省\t712\t孝感市\t420922\t大悟县\n" +
                "17\t湖北省\t712\t孝感市\t420923\t云梦县\n" +
                "17\t湖北省\t712\t孝感市\t420981\t应城市\n" +
                "17\t湖北省\t712\t孝感市\t420982\t安陆市\n" +
                "17\t湖北省\t712\t孝感市\t420984\t汉川市\n" +
                "17\t湖北省\t713\t黄冈市\t421102\t黄州区\n" +
                "17\t湖北省\t713\t黄冈市\t421121\t团风县\n" +
                "17\t湖北省\t713\t黄冈市\t421122\t红安县\n" +
                "17\t湖北省\t713\t黄冈市\t421123\t罗田县\n" +
                "17\t湖北省\t713\t黄冈市\t421124\t英山县\n" +
                "17\t湖北省\t713\t黄冈市\t421125\t浠水县\n" +
                "17\t湖北省\t713\t黄冈市\t421126\t蕲春县\n" +
                "17\t湖北省\t713\t黄冈市\t421127\t黄梅县\n" +
                "17\t湖北省\t713\t黄冈市\t421181\t麻城市\n" +
                "17\t湖北省\t713\t黄冈市\t421182\t武穴市\n" +
                "17\t湖北省\t714\t黄石市\t420202\t黄石港区\n" +
                "17\t湖北省\t714\t黄石市\t420203\t西塞山区\n" +
                "17\t湖北省\t714\t黄石市\t420204\t下陆区\n" +
                "17\t湖北省\t714\t黄石市\t420205\t铁山区\n" +
                "17\t湖北省\t714\t黄石市\t420222\t阳新县\n" +
                "17\t湖北省\t714\t黄石市\t420281\t大冶市\n" +
                "17\t湖北省\t715\t咸宁市\t421202\t咸安区\n" +
                "17\t湖北省\t715\t咸宁市\t421221\t嘉鱼县\n" +
                "17\t湖北省\t715\t咸宁市\t421222\t通城县\n" +
                "17\t湖北省\t715\t咸宁市\t421223\t崇阳县\n" +
                "17\t湖北省\t715\t咸宁市\t421224\t通山县\n" +
                "17\t湖北省\t715\t咸宁市\t421281\t赤壁市\n" +
                "17\t湖北省\t716\t荆州市\t421002\t沙市区\n" +
                "17\t湖北省\t716\t荆州市\t421003\t荆州区\n" +
                "17\t湖北省\t716\t荆州市\t421022\t公安县\n" +
                "17\t湖北省\t716\t荆州市\t421023\t监利县\n" +
                "17\t湖北省\t716\t荆州市\t421024\t江陵县\n" +
                "17\t湖北省\t716\t荆州市\t421081\t石首市\n" +
                "17\t湖北省\t716\t荆州市\t421083\t洪湖市\n" +
                "17\t湖北省\t716\t荆州市\t421087\t松滋市\n" +
                "17\t湖北省\t717\t宜昌市\t420502\t西陵区\n" +
                "17\t湖北省\t717\t宜昌市\t420503\t伍家岗区\n" +
                "17\t湖北省\t717\t宜昌市\t420504\t点军区\n" +
                "17\t湖北省\t717\t宜昌市\t420505\t猇亭区\n" +
                "17\t湖北省\t717\t宜昌市\t420506\t夷陵区\n" +
                "17\t湖北省\t717\t宜昌市\t420525\t远安县\n" +
                "17\t湖北省\t717\t宜昌市\t420526\t兴山县\n" +
                "17\t湖北省\t717\t宜昌市\t420527\t秭归县\n" +
                "17\t湖北省\t717\t宜昌市\t420528\t长阳土家族自治县\n" +
                "17\t湖北省\t717\t宜昌市\t420529\t五峰土家族自治县\n" +
                "17\t湖北省\t717\t宜昌市\t420581\t宜都市\n" +
                "17\t湖北省\t717\t宜昌市\t420582\t当阳市\n" +
                "17\t湖北省\t717\t宜昌市\t420583\t枝江市\n" +
                "17\t湖北省\t718\t恩施市\t422802\t利川市\n" +
                "17\t湖北省\t718\t恩施市\t422822\t建始县\n" +
                "17\t湖北省\t718\t恩施市\t422823\t巴东县\n" +
                "17\t湖北省\t718\t恩施市\t422825\t宣恩县\n" +
                "17\t湖北省\t718\t恩施市\t422826\t咸丰县\n" +
                "17\t湖北省\t718\t恩施市\t422827\t来凤县\n" +
                "17\t湖北省\t718\t恩施市\t422828\t鹤峰县\n" +
                "17\t湖北省\t719\t十堰市\t420302\t茅箭区\n" +
                "17\t湖北省\t719\t十堰市\t420303\t张湾区\n" +
                "17\t湖北省\t719\t十堰市\t420304\t郧阳区\n" +
                "17\t湖北省\t719\t十堰市\t420322\t郧西县\n" +
                "17\t湖北省\t719\t十堰市\t420323\t竹山县\n" +
                "17\t湖北省\t719\t十堰市\t420324\t竹溪县\n" +
                "17\t湖北省\t719\t十堰市\t420325\t房县\n" +
                "17\t湖北省\t719\t十堰市\t420381\t丹江口市\n" +
                "17\t湖北省\t722\t随州市\t421303\t曾都区\n" +
                "17\t湖北省\t722\t随州市\t421321\t随县\n" +
                "17\t湖北省\t722\t随州市\t421381\t广水市\n" +
                "17\t湖北省\t724\t荆门市\t420802\t东宝区\n" +
                "17\t湖北省\t724\t荆门市\t420804\t掇刀区\n" +
                "17\t湖北省\t724\t荆门市\t420821\t京山县\n" +
                "17\t湖北省\t724\t荆门市\t420822\t沙洋县\n" +
                "17\t湖北省\t724\t荆门市\t420881\t钟祥市\n" +
                "17\t湖北省\t728\t汉江市\t420181\t江汉区\n" +
                "17\t湖北省\t720\t仙桃市\t429004\t仙桃市\n" +
                "17\t湖北省\t721\t潜江市\t429005\t潜江市\n" +
                "17\t湖北省\t723\t天门市\t429006\t天门市\n" +
                "17\t湖北省\t725\t神龙架林区\t429021\t神农架林区\n" +
                "17\t湖北省\t718\t恩施市\t422801\t恩施市\n" +
                "18\t湖南省\t743\t吉首市\t433101\t吉首市\n" +
                "18\t湖南省\t730\t岳阳\t430602\t岳阳楼区\n" +
                "18\t湖南省\t730\t岳阳\t430603\t云溪区\n" +
                "18\t湖南省\t730\t岳阳\t430611\t君山区\n" +
                "18\t湖南省\t730\t岳阳\t430621\t岳阳县\n" +
                "18\t湖南省\t730\t岳阳\t430623\t华容县\n" +
                "18\t湖南省\t730\t岳阳\t430624\t湘阴县\n" +
                "18\t湖南省\t730\t岳阳\t430626\t平江县\n" +
                "18\t湖南省\t730\t岳阳\t430681\t汨罗市\n" +
                "18\t湖南省\t730\t岳阳\t430682\t临湘市\n" +
                "18\t湖南省\t731\t长沙\t430102\t芙蓉区\n" +
                "18\t湖南省\t731\t长沙\t430103\t天心区\n" +
                "18\t湖南省\t731\t长沙\t430104\t岳麓区\n" +
                "18\t湖南省\t731\t长沙\t430105\t开福区\n" +
                "18\t湖南省\t731\t长沙\t430111\t雨花区\n" +
                "18\t湖南省\t731\t长沙\t430112\t望城区\n" +
                "18\t湖南省\t731\t长沙\t430121\t长沙县\n" +
                "18\t湖南省\t731\t长沙\t430124\t宁乡县\n" +
                "18\t湖南省\t731\t长沙\t430181\t浏阳市\n" +
                "18\t湖南省\t732\t长沙湘潭\t430302\t雨湖区\n" +
                "18\t湖南省\t732\t长沙湘潭\t430304\t岳塘区\n" +
                "18\t湖南省\t732\t长沙湘潭\t430321\t湘潭县\n" +
                "18\t湖南省\t732\t长沙湘潭\t430381\t湘乡市\n" +
                "18\t湖南省\t732\t长沙湘潭\t430382\t韶山市\n" +
                "18\t湖南省\t733\t长沙株洲\t430202\t荷塘区\n" +
                "18\t湖南省\t733\t长沙株洲\t430203\t芦淞区\n" +
                "18\t湖南省\t733\t长沙株洲\t430204\t石峰区\n" +
                "18\t湖南省\t733\t长沙株洲\t430211\t天元区\n" +
                "18\t湖南省\t733\t长沙株洲\t430221\t株洲县\n" +
                "18\t湖南省\t733\t长沙株洲\t430223\t攸县\n" +
                "18\t湖南省\t733\t长沙株洲\t430224\t茶陵县\n" +
                "18\t湖南省\t733\t长沙株洲\t430225\t炎陵县\n" +
                "18\t湖南省\t733\t长沙株洲\t430281\t醴陵市\n" +
                "18\t湖南省\t734\t衡阳市\t430405\t珠晖区\n" +
                "18\t湖南省\t734\t衡阳市\t430406\t雁峰区\n" +
                "18\t湖南省\t734\t衡阳市\t430407\t石鼓区\n" +
                "18\t湖南省\t734\t衡阳市\t430408\t蒸湘区\n" +
                "18\t湖南省\t734\t衡阳市\t430412\t南岳区\n" +
                "18\t湖南省\t734\t衡阳市\t430421\t衡阳县\n" +
                "18\t湖南省\t734\t衡阳市\t430422\t衡南县\n" +
                "18\t湖南省\t734\t衡阳市\t430423\t衡山县\n" +
                "18\t湖南省\t734\t衡阳市\t430424\t衡东县\n" +
                "18\t湖南省\t734\t衡阳市\t430426\t祁东县\n" +
                "18\t湖南省\t734\t衡阳市\t430481\t耒阳市\n" +
                "18\t湖南省\t734\t衡阳市\t430482\t常宁市\n" +
                "18\t湖南省\t735\t郴州市\t431002\t北湖区\n" +
                "18\t湖南省\t735\t郴州市\t431003\t苏仙区\n" +
                "18\t湖南省\t735\t郴州市\t431021\t桂阳县\n" +
                "18\t湖南省\t735\t郴州市\t431022\t宜章县\n" +
                "18\t湖南省\t735\t郴州市\t431023\t永兴县\n" +
                "18\t湖南省\t735\t郴州市\t431024\t嘉禾县\n" +
                "18\t湖南省\t735\t郴州市\t431025\t临武县\n" +
                "18\t湖南省\t735\t郴州市\t431026\t汝城县\n" +
                "18\t湖南省\t735\t郴州市\t431027\t桂东县\n" +
                "18\t湖南省\t735\t郴州市\t431028\t安仁县\n" +
                "18\t湖南省\t735\t郴州市\t431081\t资兴市\n" +
                "18\t湖南省\t736\t常德市\t430702\t武陵区\n" +
                "18\t湖南省\t736\t常德市\t430703\t鼎城区\n" +
                "18\t湖南省\t736\t常德市\t430721\t安乡县\n" +
                "18\t湖南省\t736\t常德市\t430722\t汉寿县\n" +
                "18\t湖南省\t736\t常德市\t430723\t澧县\n" +
                "18\t湖南省\t736\t常德市\t430724\t临澧县\n" +
                "18\t湖南省\t736\t常德市\t430725\t桃源县\n" +
                "18\t湖南省\t736\t常德市\t430726\t石门县\n" +
                "18\t湖南省\t736\t常德市\t430781\t津市市\n" +
                "18\t湖南省\t737\t益阳市\t430902\t资阳区\n" +
                "18\t湖南省\t737\t益阳市\t430903\t赫山区\n" +
                "18\t湖南省\t737\t益阳市\t430921\t南县\n" +
                "18\t湖南省\t737\t益阳市\t430922\t桃江县\n" +
                "18\t湖南省\t737\t益阳市\t430923\t安化县\n" +
                "18\t湖南省\t737\t益阳市\t430981\t沅江市\n" +
                "18\t湖南省\t738\t娄底市\t431302\t娄星区\n" +
                "18\t湖南省\t738\t娄底市\t431321\t双峰县\n" +
                "18\t湖南省\t738\t娄底市\t431322\t新化县\n" +
                "18\t湖南省\t738\t娄底市\t431381\t冷水江市\n" +
                "18\t湖南省\t738\t娄底市\t431382\t涟源市\n" +
                "18\t湖南省\t739\t邵阳市\t430502\t双清区\n" +
                "18\t湖南省\t739\t邵阳市\t430503\t大祥区\n" +
                "18\t湖南省\t739\t邵阳市\t430511\t北塔区\n" +
                "18\t湖南省\t739\t邵阳市\t430521\t邵东县\n" +
                "18\t湖南省\t739\t邵阳市\t430522\t新邵县\n" +
                "18\t湖南省\t739\t邵阳市\t430523\t邵阳县\n" +
                "18\t湖南省\t739\t邵阳市\t430524\t隆回县\n" +
                "18\t湖南省\t739\t邵阳市\t430525\t洞口县\n" +
                "18\t湖南省\t739\t邵阳市\t430527\t绥宁县\n" +
                "18\t湖南省\t739\t邵阳市\t430528\t新宁县\n" +
                "18\t湖南省\t739\t邵阳市\t430529\t城步苗族自治县\n" +
                "18\t湖南省\t739\t邵阳市\t430581\t武冈市\n" +
                "18\t湖南省\t743\t吉首市\t433122\t泸溪县\n" +
                "18\t湖南省\t743\t吉首市\t433123\t凤凰县\n" +
                "18\t湖南省\t743\t吉首市\t433124\t花垣县\n" +
                "18\t湖南省\t743\t吉首市\t433125\t保靖县\n" +
                "18\t湖南省\t743\t吉首市\t433126\t古丈县\n" +
                "18\t湖南省\t743\t吉首市\t433127\t永顺县\n" +
                "18\t湖南省\t743\t吉首市\t433130\t龙山县\n" +
                "18\t湖南省\t744\t张家界市\t430802\t永定区\n" +
                "18\t湖南省\t744\t张家界市\t430811\t武陵源区\n" +
                "18\t湖南省\t744\t张家界市\t430821\t慈利县\n" +
                "18\t湖南省\t744\t张家界市\t430822\t桑植县\n" +
                "18\t湖南省\t745\t怀化市\t431202\t鹤城区\n" +
                "18\t湖南省\t745\t怀化市\t431221\t中方县\n" +
                "18\t湖南省\t745\t怀化市\t431222\t沅陵县\n" +
                "18\t湖南省\t745\t怀化市\t431223\t辰溪县\n" +
                "18\t湖南省\t745\t怀化市\t431224\t溆浦县\n" +
                "18\t湖南省\t745\t怀化市\t431225\t会同县\n" +
                "18\t湖南省\t745\t怀化市\t431226\t麻阳苗族自治县\n" +
                "18\t湖南省\t745\t怀化市\t431227\t新晃侗族自治县\n" +
                "18\t湖南省\t745\t怀化市\t431228\t芷江侗族自治县\n" +
                "18\t湖南省\t745\t怀化市\t431229\t靖州苗族侗族自治县\n" +
                "18\t湖南省\t745\t怀化市\t431230\t通道侗族自治县\n" +
                "18\t湖南省\t745\t怀化市\t431281\t洪江市\n" +
                "18\t湖南省\t746\t永州市\t431102\t零陵区\n" +
                "18\t湖南省\t746\t永州市\t431103\t冷水滩区\n" +
                "18\t湖南省\t746\t永州市\t431121\t祁阳县\n" +
                "18\t湖南省\t746\t永州市\t431122\t东安县\n" +
                "18\t湖南省\t746\t永州市\t431123\t双牌县\n" +
                "18\t湖南省\t746\t永州市\t431124\t道县\n" +
                "18\t湖南省\t746\t永州市\t431125\t江永县\n" +
                "18\t湖南省\t746\t永州市\t431126\t宁远县\n" +
                "18\t湖南省\t746\t永州市\t431127\t蓝山县\n" +
                "18\t湖南省\t746\t永州市\t431128\t新田县\n" +
                "18\t湖南省\t746\t永州市\t431129\t江华瑶族自治县\n" +
                "19\t广东省\t200\t广州市\t440103\t荔湾区\n" +
                "19\t广东省\t200\t广州市\t440104\t越秀区\n" +
                "19\t广东省\t200\t广州市\t440105\t海珠区\n" +
                "19\t广东省\t200\t广州市\t440106\t天河区\n" +
                "19\t广东省\t200\t广州市\t440111\t白云区\n" +
                "19\t广东省\t200\t广州市\t440112\t黄埔区\n" +
                "19\t广东省\t200\t广州市\t440113\t番禺区\n" +
                "19\t广东省\t200\t广州市\t440114\t花都区\n" +
                "19\t广东省\t200\t广州市\t440115\t南沙区\n" +
                "19\t广东省\t200\t广州市\t440117\t从化区\n" +
                "19\t广东省\t200\t广州市\t440118\t增城区\n" +
                "19\t广东省\t660\t汕尾市\t441502\t城区\n" +
                "19\t广东省\t660\t汕尾市\t441521\t海丰县\n" +
                "19\t广东省\t660\t汕尾市\t441523\t陆河县\n" +
                "19\t广东省\t660\t汕尾市\t441581\t陆丰市\n" +
                "19\t广东省\t662\t阳江市\t441702\t江城区\n" +
                "19\t广东省\t662\t阳江市\t441704\t阳东区\n" +
                "19\t广东省\t662\t阳江市\t441721\t阳西县\n" +
                "19\t广东省\t662\t阳江市\t441781\t阳春市\n" +
                "19\t广东省\t663\t揭阳市\t445202\t榕城区\n" +
                "19\t广东省\t663\t揭阳市\t445203\t揭东区\n" +
                "19\t广东省\t663\t揭阳市\t445222\t揭西县\n" +
                "19\t广东省\t663\t揭阳市\t445224\t惠来县\n" +
                "19\t广东省\t663\t揭阳市\t445281\t普宁市\n" +
                "19\t广东省\t668\t茂名市\t440902\t茂南区\n" +
                "19\t广东省\t668\t茂名市\t440904\t电白区\n" +
                "19\t广东省\t668\t茂名市\t440981\t高州市\n" +
                "19\t广东省\t668\t茂名市\t440982\t化州市\n" +
                "19\t广东省\t668\t茂名市\t440983\t信宜市\n" +
                "19\t广东省\t750\t江门市\t440703\t蓬江区\n" +
                "19\t广东省\t750\t江门市\t440704\t江海区\n" +
                "19\t广东省\t750\t江门市\t440705\t新会区\n" +
                "19\t广东省\t750\t江门市\t440781\t台山市\n" +
                "19\t广东省\t750\t江门市\t440783\t开平市\n" +
                "19\t广东省\t750\t江门市\t440784\t鹤山市\n" +
                "19\t广东省\t750\t江门市\t440785\t恩平市\n" +
                "19\t广东省\t751\t韶关市\t440203\t武江区\n" +
                "19\t广东省\t751\t韶关市\t440204\t浈江区\n" +
                "19\t广东省\t751\t韶关市\t440205\t曲江区\n" +
                "19\t广东省\t751\t韶关市\t440222\t始兴县\n" +
                "19\t广东省\t751\t韶关市\t440224\t仁化县\n" +
                "19\t广东省\t751\t韶关市\t440229\t翁源县\n" +
                "19\t广东省\t751\t韶关市\t440232\t乳源瑶族自治县\n" +
                "19\t广东省\t751\t韶关市\t440233\t新丰县\n" +
                "19\t广东省\t751\t韶关市\t440281\t乐昌市\n" +
                "19\t广东省\t751\t韶关市\t440282\t南雄市\n" +
                "19\t广东省\t752\t惠州市\t441302\t惠城区\n" +
                "19\t广东省\t752\t惠州市\t441303\t惠阳区\n" +
                "19\t广东省\t752\t惠州市\t441322\t博罗县\n" +
                "19\t广东省\t752\t惠州市\t441323\t惠东县\n" +
                "19\t广东省\t752\t惠州市\t441324\t龙门县\n" +
                "19\t广东省\t753\t梅州市\t441402\t梅江区\n" +
                "19\t广东省\t753\t梅州市\t441403\t梅县区\n" +
                "19\t广东省\t753\t梅州市\t441422\t大埔县\n" +
                "19\t广东省\t753\t梅州市\t441423\t丰顺县\n" +
                "19\t广东省\t753\t梅州市\t441424\t五华县\n" +
                "19\t广东省\t753\t梅州市\t441426\t平远县\n" +
                "19\t广东省\t753\t梅州市\t441427\t蕉岭县\n" +
                "19\t广东省\t753\t梅州市\t441481\t兴宁市\n" +
                "19\t广东省\t754\t汕头市\t440507\t龙湖区\n" +
                "19\t广东省\t754\t汕头市\t440511\t金平区\n" +
                "19\t广东省\t754\t汕头市\t440512\t濠江区\n" +
                "19\t广东省\t754\t汕头市\t440513\t潮阳区\n" +
                "19\t广东省\t754\t汕头市\t440514\t潮南区\n" +
                "19\t广东省\t754\t汕头市\t440515\t澄海区\n" +
                "19\t广东省\t754\t汕头市\t440523\t南澳县\n" +
                "19\t广东省\t755\t深圳市\t440303\t罗湖区\n" +
                "19\t广东省\t755\t深圳市\t440304\t福田区\n" +
                "19\t广东省\t755\t深圳市\t440305\t南山区\n" +
                "19\t广东省\t755\t深圳市\t440306\t宝安区\n" +
                "19\t广东省\t755\t深圳市\t440307\t龙岗区\n" +
                "19\t广东省\t755\t深圳市\t440308\t盐田区\n" +
                "19\t广东省\t756\t珠海市\t440402\t香洲区\n" +
                "19\t广东省\t756\t珠海市\t440403\t斗门区\n" +
                "19\t广东省\t756\t珠海市\t440404\t金湾区\n" +
                "19\t广东省\t757\t佛山市\t440604\t禅城区\n" +
                "19\t广东省\t757\t佛山市\t440605\t南海区\n" +
                "19\t广东省\t757\t佛山市\t440606\t顺德区\n" +
                "19\t广东省\t757\t佛山市\t440607\t三水区\n" +
                "19\t广东省\t757\t佛山市\t440608\t高明区\n" +
                "19\t广东省\t758\t肇庆市\t441202\t端州区\n" +
                "19\t广东省\t758\t肇庆市\t441203\t鼎湖区\n" +
                "19\t广东省\t758\t肇庆市\t441204\t高要区\n" +
                "19\t广东省\t758\t肇庆市\t441223\t广宁县\n" +
                "19\t广东省\t758\t肇庆市\t441224\t怀集县\n" +
                "19\t广东省\t758\t肇庆市\t441225\t封开县\n" +
                "19\t广东省\t758\t肇庆市\t441226\t德庆县\n" +
                "19\t广东省\t758\t肇庆市\t441284\t四会市\n" +
                "19\t广东省\t759\t湛江市\t440802\t赤坎区\n" +
                "19\t广东省\t759\t湛江市\t440803\t霞山区\n" +
                "19\t广东省\t759\t湛江市\t440804\t坡头区\n" +
                "19\t广东省\t759\t湛江市\t440811\t麻章区\n" +
                "19\t广东省\t759\t湛江市\t440823\t遂溪县\n" +
                "19\t广东省\t759\t湛江市\t440825\t徐闻县\n" +
                "19\t广东省\t759\t湛江市\t440881\t廉江市\n" +
                "19\t广东省\t759\t湛江市\t440882\t雷州市\n" +
                "19\t广东省\t759\t湛江市\t440883\t吴川市\n" +
                "19\t广东省\t760\t中山市\t442000\t中山市\n" +
                "19\t广东省\t762\t河源市\t441602\t源城区\n" +
                "19\t广东省\t762\t河源市\t441621\t紫金县\n" +
                "19\t广东省\t762\t河源市\t441622\t龙川县\n" +
                "19\t广东省\t762\t河源市\t441623\t连平县\n" +
                "19\t广东省\t762\t河源市\t441624\t和平县\n" +
                "19\t广东省\t762\t河源市\t441625\t东源县\n" +
                "19\t广东省\t763\t清远市\t441802\t清城区\n" +
                "19\t广东省\t763\t清远市\t441803\t清新区\n" +
                "19\t广东省\t763\t清远市\t441821\t佛冈县\n" +
                "19\t广东省\t763\t清远市\t441823\t阳山县\n" +
                "19\t广东省\t763\t清远市\t441825\t连山壮族瑶族自治县\n" +
                "19\t广东省\t763\t清远市\t441826\t连南瑶族自治县\n" +
                "19\t广东省\t763\t清远市\t441881\t英德市\n" +
                "19\t广东省\t763\t清远市\t441882\t连州市\n" +
                "19\t广东省\t766\t云浮市\t445302\t云城区\n" +
                "19\t广东省\t766\t云浮市\t445303\t云安区\n" +
                "19\t广东省\t766\t云浮市\t445321\t新兴县\n" +
                "19\t广东省\t766\t云浮市\t445322\t郁南县\n" +
                "19\t广东省\t766\t云浮市\t445381\t罗定市\n" +
                "19\t广东省\t768\t潮州市\t445102\t湘桥区\n" +
                "19\t广东省\t768\t潮州市\t445103\t潮安区\n" +
                "19\t广东省\t768\t潮州市\t445122\t饶平县\n" +
                "19\t广东省\t769\t东莞市\t441900\t东莞市\n" +
                "20\t广西省\t770\t防城港市\t450602\t港口区\n" +
                "20\t广西省\t770\t防城港市\t450603\t防城区\n" +
                "20\t广西省\t770\t防城港市\t450621\t上思县\n" +
                "20\t广西省\t770\t防城港市\t450681\t东兴市\n" +
                "20\t广西省\t771\t南宁市\t450102\t兴宁区\n" +
                "20\t广西省\t771\t南宁市\t450103\t青秀区\n" +
                "20\t广西省\t771\t南宁市\t450105\t江南区\n" +
                "20\t广西省\t771\t南宁市\t450107\t西乡塘区\n" +
                "20\t广西省\t771\t南宁市\t450108\t良庆区\n" +
                "20\t广西省\t771\t南宁市\t450109\t邕宁区\n" +
                "20\t广西省\t771\t南宁市\t450110\t武鸣区\n" +
                "20\t广西省\t771\t南宁市\t450123\t隆安县\n" +
                "20\t广西省\t771\t南宁市\t450124\t马山县\n" +
                "20\t广西省\t771\t南宁市\t450125\t上林县\n" +
                "20\t广西省\t771\t南宁市\t450126\t宾阳县\n" +
                "20\t广西省\t771\t南宁市\t450127\t横县\n" +
                "20\t广西省\t772\t柳州市\t450202\t城中区\n" +
                "20\t广西省\t772\t柳州市\t450203\t鱼峰区\n" +
                "20\t广西省\t772\t柳州市\t450204\t柳南区\n" +
                "20\t广西省\t772\t柳州市\t450205\t柳北区\n" +
                "20\t广西省\t772\t柳州市\t450206\t柳江区\n" +
                "20\t广西省\t772\t柳州市\t450222\t柳城县\n" +
                "20\t广西省\t772\t柳州市\t450223\t鹿寨县\n" +
                "20\t广西省\t772\t柳州市\t450224\t融安县\n" +
                "20\t广西省\t772\t柳州市\t450225\t融水苗族自治县\n" +
                "20\t广西省\t772\t柳州市\t450226\t三江侗族自治县\n" +
                "20\t广西省\t773\t桂林市\t450302\t秀峰区\n" +
                "20\t广西省\t773\t桂林市\t450303\t叠彩区\n" +
                "20\t广西省\t773\t桂林市\t450304\t象山区\n" +
                "20\t广西省\t773\t桂林市\t450305\t七星区\n" +
                "20\t广西省\t773\t桂林市\t450311\t雁山区\n" +
                "20\t广西省\t773\t桂林市\t450312\t临桂区\n" +
                "20\t广西省\t773\t桂林市\t450321\t阳朔县\n" +
                "20\t广西省\t773\t桂林市\t450323\t灵川县\n" +
                "20\t广西省\t773\t桂林市\t450324\t全州县\n" +
                "20\t广西省\t773\t桂林市\t450325\t兴安县\n" +
                "20\t广西省\t773\t桂林市\t450326\t永福县\n" +
                "20\t广西省\t773\t桂林市\t450327\t灌阳县\n" +
                "20\t广西省\t773\t桂林市\t450328\t龙胜各族自治县\n" +
                "20\t广西省\t773\t桂林市\t450329\t资源县\n" +
                "20\t广西省\t773\t桂林市\t450330\t平乐县\n" +
                "20\t广西省\t773\t桂林市\t450331\t荔浦县\n" +
                "20\t广西省\t773\t桂林市\t450332\t恭城瑶族自治县\n" +
                "20\t广西省\t774\t梧州市\t450403\t万秀区\n" +
                "20\t广西省\t774\t梧州市\t450405\t长洲区\n" +
                "20\t广西省\t774\t梧州市\t450406\t龙圩区\n" +
                "20\t广西省\t774\t梧州市\t450421\t苍梧县\n" +
                "20\t广西省\t774\t梧州市\t450422\t藤县\n" +
                "20\t广西省\t774\t梧州市\t450423\t蒙山县\n" +
                "20\t广西省\t774\t梧州市\t450481\t岑溪市\n" +
                "20\t广西省\t775\t玉林市\t450902\t玉州区\n" +
                "20\t广西省\t775\t玉林市\t450903\t福绵区\n" +
                "20\t广西省\t775\t玉林市\t450921\t容县\n" +
                "20\t广西省\t775\t玉林市\t450922\t陆川县\n" +
                "20\t广西省\t775\t玉林市\t450923\t博白县\n" +
                "20\t广西省\t775\t玉林市\t450924\t兴业县\n" +
                "20\t广西省\t775\t玉林市\t450981\t北流市\n" +
                "20\t广西省\t776\t百色市\t451002\t右江区\n" +
                "20\t广西省\t776\t百色市\t451021\t田阳县\n" +
                "20\t广西省\t776\t百色市\t451022\t田东县\n" +
                "20\t广西省\t776\t百色市\t451023\t平果县\n" +
                "20\t广西省\t776\t百色市\t451024\t德保县\n" +
                "20\t广西省\t776\t百色市\t451026\t那坡县\n" +
                "20\t广西省\t776\t百色市\t451027\t凌云县\n" +
                "20\t广西省\t776\t百色市\t451028\t乐业县\n" +
                "20\t广西省\t776\t百色市\t451029\t田林县\n" +
                "20\t广西省\t776\t百色市\t451030\t西林县\n" +
                "20\t广西省\t776\t百色市\t451031\t隆林各族自治县\n" +
                "20\t广西省\t776\t百色市\t451081\t靖西市\n" +
                "20\t广西省\t777\t钦州市\t450702\t钦南区\n" +
                "20\t广西省\t777\t钦州市\t450703\t钦北区\n" +
                "20\t广西省\t777\t钦州市\t450721\t灵山县\n" +
                "20\t广西省\t777\t钦州市\t450722\t浦北县\n" +
                "20\t广西省\t778\t河池市\t451202\t金城江区\n" +
                "20\t广西省\t778\t河池市\t451221\t南丹县\n" +
                "20\t广西省\t778\t河池市\t451222\t天峨县\n" +
                "20\t广西省\t778\t河池市\t451223\t凤山县\n" +
                "20\t广西省\t778\t河池市\t451224\t东兰县\n" +
                "20\t广西省\t778\t河池市\t451225\t罗城仫佬族自治县\n" +
                "20\t广西省\t778\t河池市\t451226\t环江毛南族自治县\n" +
                "20\t广西省\t778\t河池市\t451227\t巴马瑶族自治县\n" +
                "20\t广西省\t778\t河池市\t451228\t都安瑶族自治县\n" +
                "20\t广西省\t778\t河池市\t451229\t大化瑶族自治县\n" +
                "20\t广西省\t778\t河池市\t451281\t宜州市\n" +
                "20\t广西省\t779\t北海市\t450502\t海城区\n" +
                "20\t广西省\t779\t北海市\t450503\t银海区\n" +
                "20\t广西省\t779\t北海市\t450512\t铁山港区\n" +
                "20\t广西省\t779\t北海市\t450521\t合浦县\n" +
                "20\t广西省\t780\t贵港市\t450802\t港北区\n" +
                "20\t广西省\t780\t贵港市\t450803\t港南区\n" +
                "20\t广西省\t780\t贵港市\t450804\t覃塘区\n" +
                "20\t广西省\t780\t贵港市\t450821\t平南县\n" +
                "20\t广西省\t780\t贵港市\t450881\t桂平市\n" +
                "20\t广西省\t781\t来宾市\t451302\t兴宾区\n" +
                "20\t广西省\t781\t来宾市\t451321\t忻城县\n" +
                "20\t广西省\t781\t来宾市\t451322\t象州县\n" +
                "20\t广西省\t781\t来宾市\t451323\t武宣县\n" +
                "20\t广西省\t781\t来宾市\t451324\t金秀瑶族自治县\n" +
                "20\t广西省\t781\t来宾市\t451381\t合山市\n" +
                "20\t广西省\t782\t贺州市\t451102\t八步区\n" +
                "20\t广西省\t782\t贺州市\t451103\t平桂区\n" +
                "20\t广西省\t782\t贺州市\t451121\t昭平县\n" +
                "20\t广西省\t782\t贺州市\t451122\t钟山县\n" +
                "20\t广西省\t782\t贺州市\t451123\t富川瑶族自治县\n" +
                "20\t广西省\t783\t崇左市\t451402\t江州区\n" +
                "20\t广西省\t783\t崇左市\t451421\t扶绥县\n" +
                "20\t广西省\t783\t崇左市\t451422\t宁明县\n" +
                "20\t广西省\t783\t崇左市\t451423\t龙州县\n" +
                "20\t广西省\t783\t崇左市\t451424\t大新县\n" +
                "20\t广西省\t783\t崇左市\t451425\t天等县\n" +
                "20\t广西省\t783\t崇左市\t451481\t凭祥市\n" +
                "21\t海南省\t898\t海口市\t460105\t秀英区\n" +
                "21\t海南省\t898\t海口市\t460106\t龙华区\n" +
                "21\t海南省\t898\t海口市\t460107\t琼山区\n" +
                "21\t海南省\t898\t海口市\t460108\t美兰区\n" +
                "21\t海南省\t898\t海口市\t460200\t三亚市\n" +
                "21\t海南省\t898\t海口市\t460201\t市辖区\n" +
                "21\t海南省\t898\t海口市\t460202\t海棠区\n" +
                "21\t海南省\t898\t海口市\t460203\t吉阳区\n" +
                "21\t海南省\t898\t海口市\t460204\t天涯区\n" +
                "21\t海南省\t898\t海口市\t460205\t崖州区\n" +
                "21\t海南省\t898\t海口市\t460300\t三沙市\n" +
                "21\t海南省\t898\t海口市\t460400\t儋州市\n" +
                "21\t海南省\t898\t海口市\t469001\t五指山市\n" +
                "21\t海南省\t898\t海口市\t469002\t琼海市\n" +
                "21\t海南省\t898\t海口市\t469005\t文昌市\n" +
                "21\t海南省\t898\t海口市\t469006\t万宁市\n" +
                "21\t海南省\t898\t海口市\t469007\t东方市\n" +
                "21\t海南省\t898\t海口市\t469021\t定安县\n" +
                "21\t海南省\t898\t海口市\t469022\t屯昌县\n" +
                "21\t海南省\t898\t海口市\t469023\t澄迈县\n" +
                "21\t海南省\t898\t海口市\t469024\t临高县\n" +
                "21\t海南省\t898\t海口市\t469025\t白沙黎族自治县\n" +
                "21\t海南省\t898\t海口市\t469026\t昌江黎族自治县\n" +
                "21\t海南省\t898\t海口市\t469027\t乐东黎族自治县\n" +
                "21\t海南省\t898\t海口市\t469028\t陵水黎族自治县\n" +
                "21\t海南省\t898\t海口市\t469029\t保亭黎族苗族自治县\n" +
                "21\t海南省\t898\t海口市\t469030\t琼中黎族苗族自治县\n" +
                "22\t四川省\t280\t成都市\t510104\t锦江区\n" +
                "22\t四川省\t280\t成都市\t510105\t青羊区\n" +
                "22\t四川省\t280\t成都市\t510106\t金牛区\n" +
                "22\t四川省\t280\t成都市\t510107\t武侯区\n" +
                "22\t四川省\t280\t成都市\t510108\t成华区\n" +
                "22\t四川省\t280\t成都市\t510112\t龙泉驿区\n" +
                "22\t四川省\t280\t成都市\t510113\t青白江区\n" +
                "22\t四川省\t280\t成都市\t510114\t新都区\n" +
                "22\t四川省\t280\t成都市\t510115\t温江区\n" +
                "22\t四川省\t280\t成都市\t510116\t双流区\n" +
                "22\t四川省\t280\t成都市\t510121\t金堂县\n" +
                "22\t四川省\t280\t成都市\t510124\t郫县\n" +
                "22\t四川省\t280\t成都市\t510129\t大邑县\n" +
                "22\t四川省\t280\t成都市\t510131\t蒲江县\n" +
                "22\t四川省\t280\t成都市\t510132\t新津县\n" +
                "22\t四川省\t280\t成都市\t510181\t都江堰市\n" +
                "22\t四川省\t280\t成都市\t510182\t彭州市\n" +
                "22\t四川省\t280\t成都市\t510183\t邛崃市\n" +
                "22\t四川省\t280\t成都市\t510184\t崇州市\n" +
                "22\t四川省\t280\t成都市\t510185\t简阳市\n" +
                "22\t四川省\t281\t资阳市\t512002\t雁江区\n" +
                "22\t四川省\t281\t资阳市\t512021\t安岳县\n" +
                "22\t四川省\t281\t资阳市\t512022\t乐至县\n" +
                "22\t四川省\t812\t攀枝花市\t510402\t东区\n" +
                "22\t四川省\t812\t攀枝花市\t510403\t西区\n" +
                "22\t四川省\t812\t攀枝花市\t510411\t仁和区\n" +
                "22\t四川省\t812\t攀枝花市\t510421\t米易县\n" +
                "22\t四川省\t812\t攀枝花市\t510422\t盐边县\n" +
                "22\t四川省\t813\t自贡市\t510302\t自流井区\n" +
                "22\t四川省\t813\t自贡市\t510303\t贡井区\n" +
                "22\t四川省\t813\t自贡市\t510304\t大安区\n" +
                "22\t四川省\t813\t自贡市\t510311\t沿滩区\n" +
                "22\t四川省\t813\t自贡市\t510321\t荣县\n" +
                "22\t四川省\t813\t自贡市\t510322\t富顺县\n" +
                "22\t四川省\t816\t绵阳市\t510703\t涪城区\n" +
                "22\t四川省\t816\t绵阳市\t510704\t游仙区\n" +
                "22\t四川省\t816\t绵阳市\t510705\t安州区\n" +
                "22\t四川省\t816\t绵阳市\t510722\t三台县\n" +
                "22\t四川省\t816\t绵阳市\t510723\t盐亭县\n" +
                "22\t四川省\t816\t绵阳市\t510725\t梓潼县\n" +
                "22\t四川省\t816\t绵阳市\t510726\t北川羌族自治县\n" +
                "22\t四川省\t816\t绵阳市\t510727\t平武县\n" +
                "22\t四川省\t816\t绵阳市\t510781\t江油市\n" +
                "22\t四川省\t817\t南充市\t511302\t顺庆区\n" +
                "22\t四川省\t817\t南充市\t511303\t高坪区\n" +
                "22\t四川省\t817\t南充市\t511304\t嘉陵区\n" +
                "22\t四川省\t817\t南充市\t511321\t南部县\n" +
                "22\t四川省\t817\t南充市\t511322\t营山县\n" +
                "22\t四川省\t817\t南充市\t511323\t蓬安县\n" +
                "22\t四川省\t817\t南充市\t511324\t仪陇县\n" +
                "22\t四川省\t817\t南充市\t511325\t西充县\n" +
                "22\t四川省\t817\t南充市\t511381\t阆中市\n" +
                "22\t四川省\t818\t达州市\t511702\t通川区\n" +
                "22\t四川省\t818\t达州市\t511703\t达川区\n" +
                "22\t四川省\t818\t达州市\t511722\t宣汉县\n" +
                "22\t四川省\t818\t达州市\t511723\t开江县\n" +
                "22\t四川省\t818\t达州市\t511724\t大竹县\n" +
                "22\t四川省\t818\t达州市\t511725\t渠县\n" +
                "22\t四川省\t818\t达州市\t511781\t万源市\n" +
                "22\t四川省\t819\t万县市\t510133\t万县\n" +
                "22\t四川省\t825\t遂宁市\t510903\t船山区\n" +
                "22\t四川省\t825\t遂宁市\t510904\t安居区\n" +
                "22\t四川省\t825\t遂宁市\t510921\t蓬溪县\n" +
                "22\t四川省\t825\t遂宁市\t510922\t射洪县\n" +
                "22\t四川省\t825\t遂宁市\t510923\t大英县\n" +
                "22\t四川省\t826\t广安市\t511602\t广安区\n" +
                "22\t四川省\t826\t广安市\t511603\t前锋区\n" +
                "22\t四川省\t826\t广安市\t511621\t岳池县\n" +
                "22\t四川省\t826\t广安市\t511622\t武胜县\n" +
                "22\t四川省\t826\t广安市\t511623\t邻水县\n" +
                "22\t四川省\t826\t广安市\t511681\t华蓥市\n" +
                "22\t四川省\t827\t巴中市\t511902\t巴州区\n" +
                "22\t四川省\t827\t巴中市\t511903\t恩阳区\n" +
                "22\t四川省\t827\t巴中市\t511921\t通江县\n" +
                "22\t四川省\t827\t巴中市\t511922\t南江县\n" +
                "22\t四川省\t827\t巴中市\t511923\t平昌县\n" +
                "22\t四川省\t829\t眉山市\t511402\t东坡区\n" +
                "22\t四川省\t829\t眉山市\t511403\t彭山区\n" +
                "22\t四川省\t829\t眉山市\t511421\t仁寿县\n" +
                "22\t四川省\t829\t眉山市\t511423\t洪雅县\n" +
                "22\t四川省\t829\t眉山市\t511424\t丹棱县\n" +
                "22\t四川省\t829\t眉山市\t511425\t青神县\n" +
                "22\t四川省\t830\t泸州市\t510502\t江阳区\n" +
                "22\t四川省\t830\t泸州市\t510503\t纳溪区\n" +
                "22\t四川省\t830\t泸州市\t510504\t龙马潭区\n" +
                "22\t四川省\t830\t泸州市\t510521\t泸县\n" +
                "22\t四川省\t830\t泸州市\t510522\t合江县\n" +
                "22\t四川省\t830\t泸州市\t510524\t叙永县\n" +
                "22\t四川省\t830\t泸州市\t510525\t古蔺县\n" +
                "22\t四川省\t831\t宜宾市\t511502\t翠屏区\n" +
                "22\t四川省\t831\t宜宾市\t511503\t南溪区\n" +
                "22\t四川省\t831\t宜宾市\t511521\t宜宾县\n" +
                "22\t四川省\t831\t宜宾市\t511523\t江安县\n" +
                "22\t四川省\t831\t宜宾市\t511524\t长宁县\n" +
                "22\t四川省\t831\t宜宾市\t511525\t高县\n" +
                "22\t四川省\t831\t宜宾市\t511526\t珙县\n" +
                "22\t四川省\t831\t宜宾市\t511527\t筠连县\n" +
                "22\t四川省\t831\t宜宾市\t511528\t兴文县\n" +
                "22\t四川省\t831\t宜宾市\t511529\t屏山县\n" +
                "22\t四川省\t832\t内江市\t511002\t市中区\n" +
                "22\t四川省\t832\t内江市\t511011\t东兴区\n" +
                "22\t四川省\t832\t内江市\t511024\t威远县\n" +
                "22\t四川省\t832\t内江市\t511025\t资中县\n" +
                "22\t四川省\t832\t内江市\t511028\t隆昌县\n" +
                "22\t四川省\t833\t乐山市\t511102\t市中区\n" +
                "22\t四川省\t833\t乐山市\t511111\t沙湾区\n" +
                "22\t四川省\t833\t乐山市\t511112\t五通桥区\n" +
                "22\t四川省\t833\t乐山市\t511113\t金口河区\n" +
                "22\t四川省\t833\t乐山市\t511123\t犍为县\n" +
                "22\t四川省\t833\t乐山市\t511124\t井研县\n" +
                "22\t四川省\t833\t乐山市\t511126\t夹江县\n" +
                "22\t四川省\t833\t乐山市\t511129\t沐川县\n" +
                "22\t四川省\t833\t乐山市\t511132\t峨边彝族自治县\n" +
                "22\t四川省\t833\t乐山市\t511133\t马边彝族自治县\n" +
                "22\t四川省\t833\t乐山市\t511181\t峨眉山市\n" +
                "22\t四川省\t834\t凉山市\t513401\t西昌市\n" +
                "22\t四川省\t834\t凉山市\t513422\t木里藏族自治县\n" +
                "22\t四川省\t834\t凉山市\t513423\t盐源县\n" +
                "22\t四川省\t834\t凉山市\t513424\t德昌县\n" +
                "22\t四川省\t834\t凉山市\t513425\t会理县\n" +
                "22\t四川省\t834\t凉山市\t513426\t会东县\n" +
                "22\t四川省\t834\t凉山市\t513427\t宁南县\n" +
                "22\t四川省\t834\t凉山市\t513428\t普格县\n" +
                "22\t四川省\t834\t凉山市\t513429\t布拖县\n" +
                "22\t四川省\t834\t凉山市\t513430\t金阳县\n" +
                "22\t四川省\t834\t凉山市\t513431\t昭觉县\n" +
                "22\t四川省\t834\t凉山市\t513432\t喜德县\n" +
                "22\t四川省\t834\t凉山市\t513433\t冕宁县\n" +
                "22\t四川省\t834\t凉山市\t513434\t越西县\n" +
                "22\t四川省\t834\t凉山市\t513435\t甘洛县\n" +
                "22\t四川省\t834\t凉山市\t513436\t美姑县\n" +
                "22\t四川省\t834\t凉山市\t513437\t雷波县\n" +
                "22\t四川省\t835\t雅安市\t511802\t雨城区\n" +
                "22\t四川省\t835\t雅安市\t511803\t名山区\n" +
                "22\t四川省\t835\t雅安市\t511822\t荥经县\n" +
                "22\t四川省\t835\t雅安市\t511823\t汉源县\n" +
                "22\t四川省\t835\t雅安市\t511824\t石棉县\n" +
                "22\t四川省\t835\t雅安市\t511825\t天全县\n" +
                "22\t四川省\t835\t雅安市\t511826\t芦山县\n" +
                "22\t四川省\t835\t雅安市\t511827\t宝兴县\n" +
                "22\t四川省\t836\t甘孜市\t513301\t康定市\n" +
                "22\t四川省\t836\t甘孜市\t513322\t泸定县\n" +
                "22\t四川省\t836\t甘孜市\t513323\t丹巴县\n" +
                "22\t四川省\t836\t甘孜市\t513324\t九龙县\n" +
                "22\t四川省\t836\t甘孜市\t513325\t雅江县\n" +
                "22\t四川省\t836\t甘孜市\t513326\t道孚县\n" +
                "22\t四川省\t836\t甘孜市\t513327\t炉霍县\n" +
                "22\t四川省\t836\t甘孜市\t513328\t甘孜县\n" +
                "22\t四川省\t836\t甘孜市\t513329\t新龙县\n" +
                "22\t四川省\t836\t甘孜市\t513330\t德格县\n" +
                "22\t四川省\t836\t甘孜市\t513331\t白玉县\n" +
                "22\t四川省\t836\t甘孜市\t513332\t石渠县\n" +
                "22\t四川省\t836\t甘孜市\t513333\t色达县\n" +
                "22\t四川省\t836\t甘孜市\t513334\t理塘县\n" +
                "22\t四川省\t836\t甘孜市\t513335\t巴塘县\n" +
                "22\t四川省\t836\t甘孜市\t513336\t乡城县\n" +
                "22\t四川省\t836\t甘孜市\t513337\t稻城县\n" +
                "22\t四川省\t836\t甘孜市\t513338\t得荣县\n" +
                "22\t四川省\t837\t阿坝市\t513201\t马尔康市\n" +
                "22\t四川省\t837\t阿坝市\t513221\t汶川县\n" +
                "22\t四川省\t837\t阿坝市\t513222\t理县\n" +
                "22\t四川省\t837\t阿坝市\t513223\t茂县\n" +
                "22\t四川省\t837\t阿坝市\t513224\t松潘县\n" +
                "22\t四川省\t837\t阿坝市\t513225\t九寨沟县\n" +
                "22\t四川省\t837\t阿坝市\t513226\t金川县\n" +
                "22\t四川省\t837\t阿坝市\t513227\t小金县\n" +
                "22\t四川省\t837\t阿坝市\t513228\t黑水县\n" +
                "22\t四川省\t837\t阿坝市\t513230\t壤塘县\n" +
                "22\t四川省\t837\t阿坝市\t513231\t阿坝县\n" +
                "22\t四川省\t837\t阿坝市\t513232\t若尔盖县\n" +
                "22\t四川省\t837\t阿坝市\t513233\t红原县\n" +
                "22\t四川省\t838\t德阳市\t510603\t旌阳区\n" +
                "22\t四川省\t838\t德阳市\t510623\t中江县\n" +
                "22\t四川省\t838\t德阳市\t510626\t罗江县\n" +
                "22\t四川省\t838\t德阳市\t510681\t广汉市\n" +
                "22\t四川省\t838\t德阳市\t510682\t什邡市\n" +
                "22\t四川省\t838\t德阳市\t510683\t绵竹市\n" +
                "22\t四川省\t839\t广元市\t510802\t利州区\n" +
                "22\t四川省\t839\t广元市\t510811\t昭化区\n" +
                "22\t四川省\t839\t广元市\t510812\t朝天区\n" +
                "22\t四川省\t839\t广元市\t510821\t旺苍县\n" +
                "22\t四川省\t839\t广元市\t510822\t青川县\n" +
                "22\t四川省\t839\t广元市\t510823\t剑阁县\n" +
                "22\t四川省\t839\t广元市\t510824\t苍溪县\n" +
                "23\t贵州\t854\t都匀市\t522701\t都匀市\n" +
                "23\t贵州\t855\t凯里市\t522601\t凯里市\n" +
                "23\t贵州\t859\t兴义市\t522301\t兴义市\n" +
                "23\t贵州\t851\t贵阳市\t520102\t南明区\n" +
                "23\t贵州\t851\t贵阳市\t520103\t云岩区\n" +
                "23\t贵州\t851\t贵阳市\t520111\t花溪区\n" +
                "23\t贵州\t851\t贵阳市\t520112\t乌当区\n" +
                "23\t贵州\t851\t贵阳市\t520113\t白云区\n" +
                "23\t贵州\t851\t贵阳市\t520115\t观山湖区\n" +
                "23\t贵州\t851\t贵阳市\t520121\t开阳县\n" +
                "23\t贵州\t851\t贵阳市\t520122\t息烽县\n" +
                "23\t贵州\t851\t贵阳市\t520123\t修文县\n" +
                "23\t贵州\t851\t贵阳市\t520181\t清镇市\n" +
                "23\t贵州\t852\t遵义市\t520302\t红花岗区\n" +
                "23\t贵州\t852\t遵义市\t520303\t汇川区\n" +
                "23\t贵州\t852\t遵义市\t520304\t播州区\n" +
                "23\t贵州\t852\t遵义市\t520322\t桐梓县\n" +
                "23\t贵州\t852\t遵义市\t520323\t绥阳县\n" +
                "23\t贵州\t852\t遵义市\t520324\t正安县\n" +
                "23\t贵州\t852\t遵义市\t520325\t道真仡佬族苗族自治县\n" +
                "23\t贵州\t852\t遵义市\t520326\t务川仡佬族苗族自治县\n" +
                "23\t贵州\t852\t遵义市\t520327\t凤冈县\n" +
                "23\t贵州\t852\t遵义市\t520328\t湄潭县\n" +
                "23\t贵州\t852\t遵义市\t520329\t余庆县\n" +
                "23\t贵州\t852\t遵义市\t520330\t习水县\n" +
                "23\t贵州\t852\t遵义市\t520381\t赤水市\n" +
                "23\t贵州\t852\t遵义市\t520382\t仁怀市\n" +
                "23\t贵州\t853\t安顺市\t520402\t西秀区\n" +
                "23\t贵州\t853\t安顺市\t520403\t平坝区\n" +
                "23\t贵州\t853\t安顺市\t520422\t普定县\n" +
                "23\t贵州\t853\t安顺市\t520423\t镇宁布依族苗族自治县\n" +
                "23\t贵州\t853\t安顺市\t520424\t关岭布依族苗族自治县\n" +
                "23\t贵州\t853\t安顺市\t520425\t紫云苗族布依族自治县\n" +
                "23\t贵州\t854\t都匀市\t522702\t福泉市\n" +
                "23\t贵州\t854\t都匀市\t522722\t荔波县\n" +
                "23\t贵州\t854\t都匀市\t522723\t贵定县\n" +
                "23\t贵州\t854\t都匀市\t522725\t瓮安县\n" +
                "23\t贵州\t854\t都匀市\t522726\t独山县\n" +
                "23\t贵州\t854\t都匀市\t522727\t平塘县\n" +
                "23\t贵州\t854\t都匀市\t522728\t罗甸县\n" +
                "23\t贵州\t854\t都匀市\t522729\t长顺县\n" +
                "23\t贵州\t854\t都匀市\t522730\t龙里县\n" +
                "23\t贵州\t854\t都匀市\t522731\t惠水县\n" +
                "23\t贵州\t854\t都匀市\t522732\t三都水族自治县\n" +
                "23\t贵州\t855\t凯里市\t522622\t黄平县\n" +
                "23\t贵州\t855\t凯里市\t522623\t施秉县\n" +
                "23\t贵州\t855\t凯里市\t522624\t三穗县\n" +
                "23\t贵州\t855\t凯里市\t522625\t镇远县\n" +
                "23\t贵州\t855\t凯里市\t522626\t岑巩县\n" +
                "23\t贵州\t855\t凯里市\t522627\t天柱县\n" +
                "23\t贵州\t855\t凯里市\t522628\t锦屏县\n" +
                "23\t贵州\t855\t凯里市\t522629\t剑河县\n" +
                "23\t贵州\t855\t凯里市\t522630\t台江县\n" +
                "23\t贵州\t855\t凯里市\t522631\t黎平县\n" +
                "23\t贵州\t855\t凯里市\t522632\t榕江县\n" +
                "23\t贵州\t855\t凯里市\t522633\t从江县\n" +
                "23\t贵州\t855\t凯里市\t522634\t雷山县\n" +
                "23\t贵州\t855\t凯里市\t522635\t麻江县\n" +
                "23\t贵州\t855\t凯里市\t522636\t丹寨县\n" +
                "23\t贵州\t856\t铜仁市\t520602\t碧江区\n" +
                "23\t贵州\t856\t铜仁市\t520603\t万山区\n" +
                "23\t贵州\t856\t铜仁市\t520621\t江口县\n" +
                "23\t贵州\t856\t铜仁市\t520622\t玉屏侗族自治县\n" +
                "23\t贵州\t856\t铜仁市\t520623\t石阡县\n" +
                "23\t贵州\t856\t铜仁市\t520624\t思南县\n" +
                "23\t贵州\t856\t铜仁市\t520625\t印江土家族苗族自治县\n" +
                "23\t贵州\t856\t铜仁市\t520626\t德江县\n" +
                "23\t贵州\t856\t铜仁市\t520627\t沿河土家族自治县\n" +
                "23\t贵州\t856\t铜仁市\t520628\t松桃苗族自治县\n" +
                "23\t贵州\t857\t毕节市\t520502\t七星关区\n" +
                "23\t贵州\t857\t毕节市\t520521\t大方县\n" +
                "23\t贵州\t857\t毕节市\t520522\t黔西县\n" +
                "23\t贵州\t857\t毕节市\t520523\t金沙县\n" +
                "23\t贵州\t857\t毕节市\t520524\t织金县\n" +
                "23\t贵州\t857\t毕节市\t520525\t纳雍县\n" +
                "23\t贵州\t857\t毕节市\t520526\t威宁彝族回族苗族自治县\n" +
                "23\t贵州\t857\t毕节市\t520527\t赫章县\n" +
                "23\t贵州\t858\t六盘水市\t520201\t钟山区\n" +
                "23\t贵州\t858\t六盘水市\t520203\t六枝特区\n" +
                "23\t贵州\t858\t六盘水市\t520221\t水城县\n" +
                "23\t贵州\t858\t六盘水市\t520222\t盘县\n" +
                "23\t贵州\t859\t兴义市\t522322\t兴仁县\n" +
                "23\t贵州\t859\t兴义市\t522323\t普安县\n" +
                "23\t贵州\t859\t兴义市\t522324\t晴隆县\n" +
                "23\t贵州\t859\t兴义市\t522325\t贞丰县\n" +
                "23\t贵州\t859\t兴义市\t522326\t望谟县\n" +
                "23\t贵州\t859\t兴义市\t522327\t册亨县\n" +
                "23\t贵州\t859\t兴义市\t522328\t安龙县\n" +
                "24\t云南省\t872\t大理市\t532928\t永平县\n" +
                "24\t云南省\t872\t大理市\t532929\t云龙县\n" +
                "24\t云南省\t872\t大理市\t532930\t洱源县\n" +
                "24\t云南省\t872\t大理市\t532931\t剑川县\n" +
                "24\t云南省\t872\t大理市\t532932\t鹤庆县\n" +
                "24\t云南省\t873\t红河市\t532501\t个旧市\n" +
                "24\t云南省\t873\t红河市\t532502\t开远市\n" +
                "24\t云南省\t873\t红河市\t532503\t蒙自市\n" +
                "24\t云南省\t873\t红河市\t532504\t弥勒市\n" +
                "24\t云南省\t873\t红河市\t532523\t屏边苗族自治县\n" +
                "24\t云南省\t873\t红河市\t532524\t建水县\n" +
                "24\t云南省\t873\t红河市\t532525\t石屏县\n" +
                "24\t云南省\t873\t红河市\t532527\t泸西县\n" +
                "24\t云南省\t873\t红河市\t532528\t元阳县\n" +
                "24\t云南省\t873\t红河市\t532529\t红河县\n" +
                "24\t云南省\t873\t红河市\t532530\t金平苗族瑶族傣族自治县\n" +
                "24\t云南省\t873\t红河市\t532531\t绿春县\n" +
                "24\t云南省\t873\t红河市\t532532\t河口瑶族自治县\n" +
                "24\t云南省\t874\t曲靖市\t530302\t麒麟区\n" +
                "24\t云南省\t874\t曲靖市\t530303\t沾益区\n" +
                "24\t云南省\t874\t曲靖市\t530321\t马龙县\n" +
                "24\t云南省\t874\t曲靖市\t530322\t陆良县\n" +
                "24\t云南省\t874\t曲靖市\t530323\t师宗县\n" +
                "24\t云南省\t874\t曲靖市\t530324\t罗平县\n" +
                "24\t云南省\t874\t曲靖市\t530325\t富源县\n" +
                "24\t云南省\t874\t曲靖市\t530326\t会泽县\n" +
                "24\t云南省\t874\t曲靖市\t530381\t宣威市\n" +
                "24\t云南省\t875\t保山市\t530502\t隆阳区\n" +
                "24\t云南省\t875\t保山市\t530521\t施甸县\n" +
                "24\t云南省\t875\t保山市\t530523\t龙陵县\n" +
                "24\t云南省\t875\t保山市\t530524\t昌宁县\n" +
                "24\t云南省\t875\t保山市\t530581\t腾冲市\n" +
                "24\t云南省\t876\t文山市\t532601\t文山市\n" +
                "24\t云南省\t876\t文山市\t532622\t砚山县\n" +
                "24\t云南省\t876\t文山市\t532623\t西畴县\n" +
                "24\t云南省\t876\t文山市\t532624\t麻栗坡县\n" +
                "24\t云南省\t876\t文山市\t532625\t马关县\n" +
                "24\t云南省\t876\t文山市\t532626\t丘北县\n" +
                "24\t云南省\t876\t文山市\t532627\t广南县\n" +
                "24\t云南省\t876\t文山市\t532628\t富宁县\n" +
                "24\t云南省\t877\t玉溪市\t530402\t红塔区\n" +
                "24\t云南省\t877\t玉溪市\t530403\t江川区\n" +
                "24\t云南省\t877\t玉溪市\t530422\t澄江县\n" +
                "24\t云南省\t877\t玉溪市\t530423\t通海县\n" +
                "24\t云南省\t877\t玉溪市\t530424\t华宁县\n" +
                "24\t云南省\t877\t玉溪市\t530425\t易门县\n" +
                "24\t云南省\t877\t玉溪市\t530426\t峨山彝族自治县\n" +
                "24\t云南省\t877\t玉溪市\t530427\t新平彝族傣族自治县\n" +
                "24\t云南省\t877\t玉溪市\t530428\t元江哈尼族彝族傣族自治县\n" +
                "24\t云南省\t878\t楚雄市\t532322\t双柏县\n" +
                "24\t云南省\t878\t楚雄市\t532323\t牟定县\n" +
                "24\t云南省\t878\t楚雄市\t532324\t南华县\n" +
                "24\t云南省\t878\t楚雄市\t532325\t姚安县\n" +
                "24\t云南省\t878\t楚雄市\t532326\t大姚县\n" +
                "24\t云南省\t878\t楚雄市\t532327\t永仁县\n" +
                "24\t云南省\t878\t楚雄市\t532328\t元谋县\n" +
                "24\t云南省\t878\t楚雄市\t532329\t武定县\n" +
                "24\t云南省\t878\t楚雄市\t532331\t禄丰县\n" +
                "24\t云南省\t879\t思茅市\t530802\t思茅区\n" +
                "24\t云南省\t879\t思茅市\t530821\t宁洱哈尼族彝族自治县\n" +
                "24\t云南省\t879\t思茅市\t530822\t墨江哈尼族自治县\n" +
                "24\t云南省\t879\t思茅市\t530823\t景东彝族自治县\n" +
                "24\t云南省\t879\t思茅市\t530824\t景谷傣族彝族自治县\n" +
                "24\t云南省\t879\t思茅市\t530825\t镇沅彝族哈尼族拉祜族自治县\n" +
                "24\t云南省\t879\t思茅市\t530826\t江城哈尼族彝族自治县\n" +
                "24\t云南省\t879\t思茅市\t530827\t孟连傣族拉祜族佤族自治县\n" +
                "24\t云南省\t879\t思茅市\t530828\t澜沧拉祜族自治县\n" +
                "24\t云南省\t879\t思茅市\t530829\t西盟佤族自治县\n" +
                "24\t云南省\t881\t东川市\t530182\t东川市\n" +
                "24\t云南省\t883\t临沧市\t530902\t临翔区\n" +
                "24\t云南省\t883\t临沧市\t530921\t凤庆县\n" +
                "24\t云南省\t883\t临沧市\t530922\t云县\n" +
                "24\t云南省\t883\t临沧市\t530923\t永德县\n" +
                "24\t云南省\t883\t临沧市\t530924\t镇康县\n" +
                "24\t云南省\t883\t临沧市\t530925\t双江拉祜族佤族布朗族傣族自治县\n" +
                "24\t云南省\t883\t临沧市\t530926\t耿马傣族佤族自治县\n" +
                "24\t云南省\t883\t临沧市\t530927\t沧源佤族自治县\n" +
                "24\t云南省\t886\t怒江市\t533301\t泸水市\n" +
                "24\t云南省\t886\t怒江市\t533323\t福贡县\n" +
                "24\t云南省\t886\t怒江市\t533324\t贡山独龙族怒族自治县\n" +
                "24\t云南省\t886\t怒江市\t533325\t兰坪白族普米族自治县\n" +
                "24\t云南省\t887\t迪庆市\t533401\t香格里拉市\n" +
                "24\t云南省\t887\t迪庆市\t533422\t德钦县\n" +
                "24\t云南省\t887\t迪庆市\t533423\t维西傈僳族自治县\n" +
                "24\t云南省\t888\t丽江市\t530702\t古城区\n" +
                "24\t云南省\t888\t丽江市\t530721\t玉龙纳西族自治县\n" +
                "24\t云南省\t888\t丽江市\t530722\t永胜县\n" +
                "24\t云南省\t888\t丽江市\t530723\t华坪县\n" +
                "24\t云南省\t888\t丽江市\t530724\t宁蒗彝族自治县\n" +
                "24\t云南省\t691\t版纳市\t532801\t景洪市\n" +
                "24\t云南省\t691\t版纳市\t532822\t勐海县\n" +
                "24\t云南省\t691\t版纳市\t532823\t勐腊县\n" +
                "24\t云南省\t692\t德宏市\t533102\t瑞丽市\n" +
                "24\t云南省\t692\t德宏市\t533103\t芒市\n" +
                "24\t云南省\t692\t德宏市\t533122\t梁河县\n" +
                "24\t云南省\t692\t德宏市\t533123\t盈江县\n" +
                "24\t云南省\t692\t德宏市\t533124\t陇川县\n" +
                "24\t云南省\t870\t昭通市\t530602\t昭阳区\n" +
                "24\t云南省\t870\t昭通市\t530621\t鲁甸县\n" +
                "24\t云南省\t870\t昭通市\t530622\t巧家县\n" +
                "24\t云南省\t870\t昭通市\t530623\t盐津县\n" +
                "24\t云南省\t870\t昭通市\t530624\t大关县\n" +
                "24\t云南省\t870\t昭通市\t530625\t永善县\n" +
                "24\t云南省\t870\t昭通市\t530626\t绥江县\n" +
                "24\t云南省\t870\t昭通市\t530627\t镇雄县\n" +
                "24\t云南省\t870\t昭通市\t530628\t彝良县\n" +
                "24\t云南省\t870\t昭通市\t530629\t威信县\n" +
                "24\t云南省\t870\t昭通市\t530630\t水富县\n" +
                "24\t云南省\t871\t昆明市\t530102\t五华区\n" +
                "24\t云南省\t871\t昆明市\t530103\t盘龙区\n" +
                "24\t云南省\t871\t昆明市\t530111\t官渡区\n" +
                "24\t云南省\t871\t昆明市\t530112\t西山区\n" +
                "24\t云南省\t871\t昆明市\t530113\t东川区\n" +
                "24\t云南省\t871\t昆明市\t530114\t呈贡区\n" +
                "24\t云南省\t871\t昆明市\t530122\t晋宁县\n" +
                "24\t云南省\t871\t昆明市\t530124\t富民县\n" +
                "24\t云南省\t871\t昆明市\t530125\t宜良县\n" +
                "24\t云南省\t871\t昆明市\t530126\t石林彝族自治县\n" +
                "24\t云南省\t871\t昆明市\t530127\t嵩明县\n" +
                "24\t云南省\t871\t昆明市\t530128\t禄劝彝族苗族自治县\n" +
                "24\t云南省\t871\t昆明市\t530129\t寻甸回族彝族自治县\n" +
                "24\t云南省\t871\t昆明市\t530181\t安宁市\n" +
                "24\t云南省\t872\t大理市\t532901\t大理市\n" +
                "24\t云南省\t872\t大理市\t532922\t漾濞彝族自治县\n" +
                "24\t云南省\t872\t大理市\t532923\t祥云县\n" +
                "24\t云南省\t872\t大理市\t532924\t宾川县\n" +
                "24\t云南省\t872\t大理市\t532925\t弥渡县\n" +
                "24\t云南省\t872\t大理市\t532926\t南涧彝族自治县\n" +
                "24\t云南省\t872\t大理市\t532927\t巍山彝族回族自治县\n" +
                "25\t西藏自治区\t891\t拉萨市\t540102\t城关区\n" +
                "25\t西藏自治区\t891\t拉萨市\t540103\t堆龙德庆区\n" +
                "25\t西藏自治区\t891\t拉萨市\t540121\t林周县\n" +
                "25\t西藏自治区\t891\t拉萨市\t540122\t当雄县\n" +
                "25\t西藏自治区\t891\t拉萨市\t540123\t尼木县\n" +
                "25\t西藏自治区\t891\t拉萨市\t540124\t曲水县\n" +
                "25\t西藏自治区\t891\t拉萨市\t540126\t达孜县\n" +
                "25\t西藏自治区\t891\t拉萨市\t540127\t墨竹工卡县\n" +
                "25\t西藏自治区\t892\t日喀则市\t540202\t桑珠孜区\n" +
                "25\t西藏自治区\t892\t日喀则市\t540221\t南木林县\n" +
                "25\t西藏自治区\t892\t日喀则市\t540222\t江孜县\n" +
                "25\t西藏自治区\t892\t日喀则市\t540223\t定日县\n" +
                "25\t西藏自治区\t892\t日喀则市\t540224\t萨迦县\n" +
                "25\t西藏自治区\t892\t日喀则市\t540225\t拉孜县\n" +
                "25\t西藏自治区\t892\t日喀则市\t540226\t昂仁县\n" +
                "25\t西藏自治区\t892\t日喀则市\t540227\t谢通门县\n" +
                "25\t西藏自治区\t892\t日喀则市\t540228\t白朗县\n" +
                "25\t西藏自治区\t892\t日喀则市\t540229\t仁布县\n" +
                "25\t西藏自治区\t892\t日喀则市\t540230\t康马县\n" +
                "25\t西藏自治区\t892\t日喀则市\t540231\t定结县\n" +
                "25\t西藏自治区\t892\t日喀则市\t540232\t仲巴县\n" +
                "25\t西藏自治区\t892\t日喀则市\t540233\t亚东县\n" +
                "25\t西藏自治区\t892\t日喀则市\t540234\t吉隆县\n" +
                "25\t西藏自治区\t892\t日喀则市\t540235\t聂拉木县\n" +
                "25\t西藏自治区\t892\t日喀则市\t540236\t萨嘎县\n" +
                "25\t西藏自治区\t892\t日喀则市\t540237\t岗巴县\n" +
                "25\t西藏自治区\t893\t山南市\t540502\t乃东区\n" +
                "25\t西藏自治区\t893\t山南市\t540521\t扎囊县\n" +
                "25\t西藏自治区\t893\t山南市\t540522\t贡嘎县\n" +
                "25\t西藏自治区\t893\t山南市\t540523\t桑日县\n" +
                "25\t西藏自治区\t893\t山南市\t540524\t琼结县\n" +
                "25\t西藏自治区\t893\t山南市\t540525\t曲松县\n" +
                "25\t西藏自治区\t893\t山南市\t540526\t措美县\n" +
                "25\t西藏自治区\t893\t山南市\t540527\t洛扎县\n" +
                "25\t西藏自治区\t893\t山南市\t540528\t加查县\n" +
                "25\t西藏自治区\t893\t山南市\t540529\t隆子县\n" +
                "25\t西藏自治区\t893\t山南市\t540530\t错那县\n" +
                "25\t西藏自治区\t893\t山南市\t540531\t浪卡子县\n" +
                "25\t西藏自治区\t894\t林芝市\t540402\t巴宜区\n" +
                "25\t西藏自治区\t894\t林芝市\t540421\t工布江达县\n" +
                "25\t西藏自治区\t894\t林芝市\t540422\t米林县\n" +
                "25\t西藏自治区\t894\t林芝市\t540423\t墨脱县\n" +
                "25\t西藏自治区\t894\t林芝市\t540424\t波密县\n" +
                "25\t西藏自治区\t894\t林芝市\t540425\t察隅县\n" +
                "25\t西藏自治区\t894\t林芝市\t540426\t朗县\n" +
                "25\t西藏自治区\t895\t昌都市\t540302\t卡若区\n" +
                "25\t西藏自治区\t895\t昌都市\t540321\t江达县\n" +
                "25\t西藏自治区\t895\t昌都市\t540322\t贡觉县\n" +
                "25\t西藏自治区\t895\t昌都市\t540323\t类乌齐县\n" +
                "25\t西藏自治区\t895\t昌都市\t540324\t丁青县\n" +
                "25\t西藏自治区\t895\t昌都市\t540325\t察雅县\n" +
                "25\t西藏自治区\t895\t昌都市\t540326\t八宿县\n" +
                "25\t西藏自治区\t895\t昌都市\t540327\t左贡县\n" +
                "25\t西藏自治区\t895\t昌都市\t540328\t芒康县\n" +
                "25\t西藏自治区\t895\t昌都市\t540329\t洛隆县\n" +
                "25\t西藏自治区\t895\t昌都市\t540330\t边坝县\n" +
                "25\t西藏自治区\t896\t那曲市\t542421\t那曲县\n" +
                "25\t西藏自治区\t896\t那曲市\t542422\t嘉黎县\n" +
                "25\t西藏自治区\t896\t那曲市\t542423\t比如县\n" +
                "25\t西藏自治区\t896\t那曲市\t542424\t聂荣县\n" +
                "25\t西藏自治区\t896\t那曲市\t542425\t安多县\n" +
                "25\t西藏自治区\t896\t那曲市\t542426\t申扎县\n" +
                "25\t西藏自治区\t896\t那曲市\t542427\t索县\n" +
                "25\t西藏自治区\t896\t那曲市\t542428\t班戈县\n" +
                "25\t西藏自治区\t896\t那曲市\t542429\t巴青县\n" +
                "25\t西藏自治区\t896\t那曲市\t542430\t尼玛县\n" +
                "25\t西藏自治区\t896\t那曲市\t542431\t双湖县\n" +
                "25\t西藏自治区\t897\t阿里市\t542521\t普兰县\n" +
                "25\t西藏自治区\t897\t阿里市\t542522\t札达县\n" +
                "25\t西藏自治区\t897\t阿里市\t542523\t噶尔县\n" +
                "25\t西藏自治区\t897\t阿里市\t542524\t日土县\n" +
                "25\t西藏自治区\t897\t阿里市\t542525\t革吉县\n" +
                "25\t西藏自治区\t897\t阿里市\t542526\t改则县\n" +
                "25\t西藏自治区\t897\t阿里市\t542527\t措勤县\n" +
                "26\t陕西省\t912\t榆林市\t610825\t定边县\n" +
                "26\t陕西省\t912\t榆林市\t610826\t绥德县\n" +
                "26\t陕西省\t912\t榆林市\t610827\t米脂县\n" +
                "26\t陕西省\t912\t榆林市\t610828\t佳县\n" +
                "26\t陕西省\t912\t榆林市\t610829\t吴堡县\n" +
                "26\t陕西省\t912\t榆林市\t610830\t清涧县\n" +
                "26\t陕西省\t912\t榆林市\t610831\t子洲县\n" +
                "26\t陕西省\t913\t渭南市\t610502\t临渭区\n" +
                "26\t陕西省\t913\t渭南市\t610503\t华州区\n" +
                "26\t陕西省\t913\t渭南市\t610522\t潼关县\n" +
                "26\t陕西省\t913\t渭南市\t610523\t大荔县\n" +
                "26\t陕西省\t913\t渭南市\t610524\t合阳县\n" +
                "26\t陕西省\t913\t渭南市\t610525\t澄城县\n" +
                "26\t陕西省\t913\t渭南市\t610526\t蒲城县\n" +
                "26\t陕西省\t913\t渭南市\t610527\t白水县\n" +
                "26\t陕西省\t913\t渭南市\t610528\t富平县\n" +
                "26\t陕西省\t913\t渭南市\t610581\t韩城市\n" +
                "26\t陕西省\t913\t渭南市\t610582\t华阴市\n" +
                "26\t陕西省\t914\t商洛市\t611002\t商州区\n" +
                "26\t陕西省\t914\t商洛市\t611021\t洛南县\n" +
                "26\t陕西省\t914\t商洛市\t611022\t丹凤县\n" +
                "26\t陕西省\t914\t商洛市\t611023\t商南县\n" +
                "26\t陕西省\t914\t商洛市\t611024\t山阳县\n" +
                "26\t陕西省\t914\t商洛市\t611025\t镇安县\n" +
                "26\t陕西省\t914\t商洛市\t611026\t柞水县\n" +
                "26\t陕西省\t915\t安康市\t610902\t汉滨区\n" +
                "26\t陕西省\t915\t安康市\t610921\t汉阴县\n" +
                "26\t陕西省\t915\t安康市\t610922\t石泉县\n" +
                "26\t陕西省\t915\t安康市\t610923\t宁陕县\n" +
                "26\t陕西省\t915\t安康市\t610924\t紫阳县\n" +
                "26\t陕西省\t915\t安康市\t610925\t岚皋县\n" +
                "26\t陕西省\t915\t安康市\t610926\t平利县\n" +
                "26\t陕西省\t915\t安康市\t610927\t镇坪县\n" +
                "26\t陕西省\t915\t安康市\t610928\t旬阳县\n" +
                "26\t陕西省\t915\t安康市\t610929\t白河县\n" +
                "26\t陕西省\t916\t汉中市\t610702\t汉台区\n" +
                "26\t陕西省\t916\t汉中市\t610721\t南郑县\n" +
                "26\t陕西省\t916\t汉中市\t610722\t城固县\n" +
                "26\t陕西省\t916\t汉中市\t610723\t洋县\n" +
                "26\t陕西省\t916\t汉中市\t610724\t西乡县\n" +
                "26\t陕西省\t916\t汉中市\t610725\t勉县\n" +
                "26\t陕西省\t916\t汉中市\t610726\t宁强县\n" +
                "26\t陕西省\t916\t汉中市\t610727\t略阳县\n" +
                "26\t陕西省\t916\t汉中市\t610728\t镇巴县\n" +
                "26\t陕西省\t916\t汉中市\t610729\t留坝县\n" +
                "26\t陕西省\t916\t汉中市\t610730\t佛坪县\n" +
                "26\t陕西省\t917\t宝鸡市\t610302\t渭滨区\n" +
                "26\t陕西省\t917\t宝鸡市\t610303\t金台区\n" +
                "26\t陕西省\t917\t宝鸡市\t610304\t陈仓区\n" +
                "26\t陕西省\t917\t宝鸡市\t610322\t凤翔县\n" +
                "26\t陕西省\t917\t宝鸡市\t610323\t岐山县\n" +
                "26\t陕西省\t917\t宝鸡市\t610324\t扶风县\n" +
                "26\t陕西省\t917\t宝鸡市\t610326\t眉县\n" +
                "26\t陕西省\t917\t宝鸡市\t610327\t陇县\n" +
                "26\t陕西省\t917\t宝鸡市\t610328\t千阳县\n" +
                "26\t陕西省\t917\t宝鸡市\t610329\t麟游县\n" +
                "26\t陕西省\t917\t宝鸡市\t610330\t凤县\n" +
                "26\t陕西省\t917\t宝鸡市\t610331\t太白县\n" +
                "26\t陕西省\t919\t铜川市\t610202\t王益区\n" +
                "26\t陕西省\t919\t铜川市\t610203\t印台区\n" +
                "26\t陕西省\t919\t铜川市\t610204\t耀州区\n" +
                "26\t陕西省\t919\t铜川市\t610222\t宜君县\n" +
                "26\t陕西省\t290\t西安\t610102\t新城区\n" +
                "26\t陕西省\t290\t西安\t610103\t碑林区\n" +
                "26\t陕西省\t290\t西安\t610104\t莲湖区\n" +
                "26\t陕西省\t290\t西安\t610111\t灞桥区\n" +
                "26\t陕西省\t290\t西安\t610112\t未央区\n" +
                "26\t陕西省\t290\t西安\t610113\t雁塔区\n" +
                "26\t陕西省\t290\t西安\t610114\t阎良区\n" +
                "26\t陕西省\t290\t西安\t610115\t临潼区\n" +
                "26\t陕西省\t290\t西安\t610116\t长安区\n" +
                "26\t陕西省\t290\t西安\t610117\t高陵区\n" +
                "26\t陕西省\t290\t西安\t610122\t蓝田县\n" +
                "26\t陕西省\t290\t西安\t610124\t周至县\n" +
                "26\t陕西省\t290\t西安\t610125\t户县\n" +
                "26\t陕西省\t291\t咸阳\t610402\t秦都区\n" +
                "26\t陕西省\t291\t咸阳\t610403\t杨陵区\n" +
                "26\t陕西省\t291\t咸阳\t610404\t渭城区\n" +
                "26\t陕西省\t291\t咸阳\t610422\t三原县\n" +
                "26\t陕西省\t291\t咸阳\t610423\t泾阳县\n" +
                "26\t陕西省\t291\t咸阳\t610424\t乾县\n" +
                "26\t陕西省\t291\t咸阳\t610425\t礼泉县\n" +
                "26\t陕西省\t291\t咸阳\t610426\t永寿县\n" +
                "26\t陕西省\t291\t咸阳\t610427\t彬县\n" +
                "26\t陕西省\t291\t咸阳\t610428\t长武县\n" +
                "26\t陕西省\t291\t咸阳\t610429\t旬邑县\n" +
                "26\t陕西省\t291\t咸阳\t610430\t淳化县\n" +
                "26\t陕西省\t291\t咸阳\t610431\t武功县\n" +
                "26\t陕西省\t291\t咸阳\t610481\t兴平市\n" +
                "26\t陕西省\t911\t延安市\t610602\t宝塔区\n" +
                "26\t陕西省\t911\t延安市\t610603\t安塞区\n" +
                "26\t陕西省\t911\t延安市\t610621\t延长县\n" +
                "26\t陕西省\t911\t延安市\t610622\t延川县\n" +
                "26\t陕西省\t911\t延安市\t610623\t子长县\n" +
                "26\t陕西省\t911\t延安市\t610625\t志丹县\n" +
                "26\t陕西省\t911\t延安市\t610626\t吴起县\n" +
                "26\t陕西省\t911\t延安市\t610627\t甘泉县\n" +
                "26\t陕西省\t911\t延安市\t610628\t富县\n" +
                "26\t陕西省\t911\t延安市\t610629\t洛川县\n" +
                "26\t陕西省\t911\t延安市\t610630\t宜川县\n" +
                "26\t陕西省\t911\t延安市\t610631\t黄龙县\n" +
                "26\t陕西省\t911\t延安市\t610632\t黄陵县\n" +
                "26\t陕西省\t912\t榆林市\t610802\t榆阳区\n" +
                "26\t陕西省\t912\t榆林市\t610803\t横山区\n" +
                "26\t陕西省\t912\t榆林市\t610821\t神木县\n" +
                "26\t陕西省\t912\t榆林市\t610822\t府谷县\n" +
                "26\t陕西省\t912\t榆林市\t610824\t靖边县\n" +
                "27\t甘肃省\t929\t武威市\t620602\t凉州区\n" +
                "27\t甘肃省\t929\t武威市\t620621\t民勤县\n" +
                "27\t甘肃省\t929\t武威市\t620622\t古浪县\n" +
                "27\t甘肃省\t929\t武威市\t620623\t天祝藏族自治县\n" +
                "27\t甘肃省\t930\t临夏市\t622901\t临夏市\n" +
                "27\t甘肃省\t930\t临夏市\t622921\t临夏县\n" +
                "27\t甘肃省\t930\t临夏市\t622922\t康乐县\n" +
                "27\t甘肃省\t930\t临夏市\t622923\t永靖县\n" +
                "27\t甘肃省\t930\t临夏市\t622924\t广河县\n" +
                "27\t甘肃省\t930\t临夏市\t622925\t和政县\n" +
                "27\t甘肃省\t930\t临夏市\t622926\t东乡族自治县\n" +
                "27\t甘肃省\t930\t临夏市\t622927\t积石山保安族东乡族撒拉族自治县\n" +
                "27\t甘肃省\t931\t兰州市\t620102\t城关区\n" +
                "27\t甘肃省\t931\t兰州市\t620103\t七里河区\n" +
                "27\t甘肃省\t931\t兰州市\t620104\t西固区\n" +
                "27\t甘肃省\t931\t兰州市\t620105\t安宁区\n" +
                "27\t甘肃省\t931\t兰州市\t620111\t红古区\n" +
                "27\t甘肃省\t931\t兰州市\t620121\t永登县\n" +
                "27\t甘肃省\t931\t兰州市\t620122\t皋兰县\n" +
                "27\t甘肃省\t931\t兰州市\t620123\t榆中县\n" +
                "27\t甘肃省\t932\t定西市\t621102\t安定区\n" +
                "27\t甘肃省\t932\t定西市\t621121\t通渭县\n" +
                "27\t甘肃省\t932\t定西市\t621122\t陇西县\n" +
                "27\t甘肃省\t932\t定西市\t621123\t渭源县\n" +
                "27\t甘肃省\t932\t定西市\t621124\t临洮县\n" +
                "27\t甘肃省\t932\t定西市\t621125\t漳县\n" +
                "27\t甘肃省\t932\t定西市\t621126\t岷县\n" +
                "27\t甘肃省\t933\t平凉市\t620802\t崆峒区\n" +
                "27\t甘肃省\t933\t平凉市\t620821\t泾川县\n" +
                "27\t甘肃省\t933\t平凉市\t620822\t灵台县\n" +
                "27\t甘肃省\t933\t平凉市\t620823\t崇信县\n" +
                "27\t甘肃省\t933\t平凉市\t620824\t华亭县\n" +
                "27\t甘肃省\t933\t平凉市\t620825\t庄浪县\n" +
                "27\t甘肃省\t933\t平凉市\t620826\t静宁县\n" +
                "27\t甘肃省\t934\t庆阳市\t621002\t西峰区\n" +
                "27\t甘肃省\t934\t庆阳市\t621021\t庆城县\n" +
                "27\t甘肃省\t934\t庆阳市\t621022\t环县\n" +
                "27\t甘肃省\t934\t庆阳市\t621023\t华池县\n" +
                "27\t甘肃省\t934\t庆阳市\t621024\t合水县\n" +
                "27\t甘肃省\t934\t庆阳市\t621025\t正宁县\n" +
                "27\t甘肃省\t934\t庆阳市\t621026\t宁县\n" +
                "27\t甘肃省\t934\t庆阳市\t621027\t镇原县\n" +
                "27\t甘肃省\t935\t金昌市\t620302\t金川区\n" +
                "27\t甘肃省\t935\t金昌市\t620321\t永昌县\n" +
                "27\t甘肃省\t936\t张掖市\t620702\t甘州区\n" +
                "27\t甘肃省\t936\t张掖市\t620721\t肃南裕固族自治县\n" +
                "27\t甘肃省\t936\t张掖市\t620722\t民乐县\n" +
                "27\t甘肃省\t936\t张掖市\t620723\t临泽县\n" +
                "27\t甘肃省\t936\t张掖市\t620724\t高台县\n" +
                "27\t甘肃省\t936\t张掖市\t620725\t山丹县\n" +
                "27\t甘肃省\t937\t酒泉\t620902\t肃州区\n" +
                "27\t甘肃省\t937\t酒泉\t620921\t金塔县\n" +
                "27\t甘肃省\t937\t酒泉\t620922\t瓜州县\n" +
                "27\t甘肃省\t937\t酒泉\t620923\t肃北蒙古族自治县\n" +
                "27\t甘肃省\t937\t酒泉\t620924\t阿克塞哈萨克族自治县\n" +
                "27\t甘肃省\t937\t酒泉\t620981\t玉门市\n" +
                "27\t甘肃省\t937\t酒泉\t620982\t敦煌市\n" +
                "27\t甘肃省\t938\t天水市\t620502\t秦州区\n" +
                "27\t甘肃省\t938\t天水市\t620503\t麦积区\n" +
                "27\t甘肃省\t938\t天水市\t620521\t清水县\n" +
                "27\t甘肃省\t938\t天水市\t620522\t秦安县\n" +
                "27\t甘肃省\t938\t天水市\t620523\t甘谷县\n" +
                "27\t甘肃省\t938\t天水市\t620524\t武山县\n" +
                "27\t甘肃省\t938\t天水市\t620525\t张家川回族自治县\n" +
                "27\t甘肃省\t939\t陇南市\t621202\t武都区\n" +
                "27\t甘肃省\t939\t陇南市\t621221\t成县\n" +
                "27\t甘肃省\t939\t陇南市\t621222\t文县\n" +
                "27\t甘肃省\t939\t陇南市\t621223\t宕昌县\n" +
                "27\t甘肃省\t939\t陇南市\t621224\t康县\n" +
                "27\t甘肃省\t939\t陇南市\t621225\t西和县\n" +
                "27\t甘肃省\t939\t陇南市\t621226\t礼县\n" +
                "27\t甘肃省\t939\t陇南市\t621227\t徽县\n" +
                "27\t甘肃省\t939\t陇南市\t621228\t两当县\n" +
                "27\t甘肃省\t940\t \t620301\t金昌武威\n" +
                "27\t甘肃省\t941\t甘南市\t623001\t合作市\n" +
                "27\t甘肃省\t941\t甘南市\t623021\t临潭县\n" +
                "27\t甘肃省\t941\t甘南市\t623022\t卓尼县\n" +
                "27\t甘肃省\t941\t甘南市\t623023\t舟曲县\n" +
                "27\t甘肃省\t941\t甘南市\t623024\t迭部县\n" +
                "27\t甘肃省\t941\t甘南市\t623025\t玛曲县\n" +
                "27\t甘肃省\t941\t甘南市\t623026\t碌曲县\n" +
                "27\t甘肃省\t941\t甘南市\t623027\t夏河县\n" +
                "27\t甘肃省\t942\t嘉峪关\t620200\t嘉峪关市\n" +
                "27\t甘肃省\t943\t白银市\t620402\t白银区\n" +
                "27\t甘肃省\t943\t白银市\t620403\t平川区\n" +
                "27\t甘肃省\t943\t白银市\t620421\t靖远县\n" +
                "27\t甘肃省\t943\t白银市\t620422\t会宁县\n" +
                "27\t甘肃省\t943\t白银市\t620423\t景泰县\n" +
                "27\t甘肃省\t944\t \t620201\t酒泉嘉峪关\n" +
                "28\t青海省\t976\t玉树市\t632701\t玉树市\n" +
                "28\t青海省\t970\t海晏市\t632223\t海晏县\n" +
                "28\t青海省\t971\t西宁市\t630102\t城东区\n" +
                "28\t青海省\t971\t西宁市\t630103\t城中区\n" +
                "28\t青海省\t971\t西宁市\t630104\t城西区\n" +
                "28\t青海省\t971\t西宁市\t630105\t城北区\n" +
                "28\t青海省\t971\t西宁市\t630121\t大通回族土族自治县\n" +
                "28\t青海省\t971\t西宁市\t630122\t湟中县\n" +
                "28\t青海省\t971\t西宁市\t630123\t湟源县\n" +
                "28\t青海省\t972\t海东市\t630202\t乐都区\n" +
                "28\t青海省\t972\t海东市\t630203\t平安区\n" +
                "28\t青海省\t972\t海东市\t630222\t民和回族土族自治县\n" +
                "28\t青海省\t972\t海东市\t630223\t互助土族自治县\n" +
                "28\t青海省\t972\t海东市\t630224\t化隆回族自治县\n" +
                "28\t青海省\t972\t海东市\t630225\t循化撒拉族自治县\n" +
                "28\t青海省\t973\t黄南市\t632321\t同仁县\n" +
                "28\t青海省\t973\t黄南市\t632322\t尖扎县\n" +
                "28\t青海省\t973\t黄南市\t632323\t泽库县\n" +
                "28\t青海省\t973\t黄南市\t632324\t河南蒙古族自治县\n" +
                "28\t青海省\t974\t共和市\t632521\t共和县\n" +
                "28\t青海省\t974\t共和市\t632522\t同德县\n" +
                "28\t青海省\t974\t共和市\t632523\t贵德县\n" +
                "28\t青海省\t974\t共和市\t632524\t兴海县\n" +
                "28\t青海省\t974\t共和市\t632525\t贵南县\n" +
                "28\t青海省\t975\t果洛市\t632621\t玛沁县\n" +
                "28\t青海省\t975\t果洛市\t632622\t班玛县\n" +
                "28\t青海省\t975\t果洛市\t632623\t甘德县\n" +
                "28\t青海省\t975\t果洛市\t632624\t达日县\n" +
                "28\t青海省\t975\t果洛市\t632625\t久治县\n" +
                "28\t青海省\t975\t果洛市\t632626\t玛多县\n" +
                "28\t青海省\t976\t玉树市\t632722\t杂多县\n" +
                "28\t青海省\t976\t玉树市\t632723\t称多县\n" +
                "28\t青海省\t976\t玉树市\t632724\t治多县\n" +
                "28\t青海省\t976\t玉树市\t632725\t囊谦县\n" +
                "28\t青海省\t976\t玉树市\t632726\t曲麻莱县\n" +
                "28\t青海省\t977\t德令哈市\t632802\t德令哈市\n" +
                "28\t青海省\t978\t门源市\t632221\t门源回族自治县\n" +
                "28\t青海省\t978\t门源市\t632222\t祁连县\n" +
                "28\t青海省\t978\t门源市\t632224\t刚察县\n" +
                "28\t青海省\t979\t格尔木市\t632801\t格尔木市\n" +
                "28\t青海省\t979\t格尔木市\t632821\t乌兰县\n" +
                "28\t青海省\t979\t格尔木市\t632822\t都兰县\n" +
                "28\t青海省\t979\t格尔木市\t632823\t天峻县\n" +
                "29\t宁夏自治区\t951\t银川市\t640104\t兴庆区\n" +
                "29\t宁夏自治区\t951\t银川市\t640105\t西夏区\n" +
                "29\t宁夏自治区\t951\t银川市\t640106\t金凤区\n" +
                "29\t宁夏自治区\t951\t银川市\t640121\t永宁县\n" +
                "29\t宁夏自治区\t951\t银川市\t640122\t贺兰县\n" +
                "29\t宁夏自治区\t951\t银川市\t640181\t灵武市\n" +
                "29\t宁夏自治区\t952\t石嘴山市\t640202\t大武口区\n" +
                "29\t宁夏自治区\t952\t石嘴山市\t640205\t惠农区\n" +
                "29\t宁夏自治区\t952\t石嘴山市\t640221\t平罗县\n" +
                "29\t宁夏自治区\t953\t吴忠市\t640302\t利通区\n" +
                "29\t宁夏自治区\t953\t吴忠市\t640303\t红寺堡区\n" +
                "29\t宁夏自治区\t953\t吴忠市\t640323\t盐池县\n" +
                "29\t宁夏自治区\t953\t吴忠市\t640324\t同心县\n" +
                "29\t宁夏自治区\t953\t吴忠市\t640381\t青铜峡市\n" +
                "29\t宁夏自治区\t954\t固原市\t640402\t原州区\n" +
                "29\t宁夏自治区\t954\t固原市\t640422\t西吉县\n" +
                "29\t宁夏自治区\t954\t固原市\t640423\t隆德县\n" +
                "29\t宁夏自治区\t954\t固原市\t640424\t泾源县\n" +
                "29\t宁夏自治区\t954\t固原市\t640425\t彭阳县\n" +
                "29\t宁夏自治区\t955\t中卫市\t640502\t沙坡头区\n" +
                "29\t宁夏自治区\t955\t中卫市\t640521\t中宁县\n" +
                "29\t宁夏自治区\t955\t中卫市\t640522\t海原县\n" +
                "30\t新疆自治区\t991\t乌鲁木齐市\t650103\t沙依巴克区\n" +
                "30\t新疆自治区\t991\t乌鲁木齐市\t650104\t新市区\n" +
                "30\t新疆自治区\t991\t乌鲁木齐市\t650105\t水磨沟区\n" +
                "30\t新疆自治区\t991\t乌鲁木齐市\t650106\t头屯河区\n" +
                "30\t新疆自治区\t991\t乌鲁木齐市\t650107\t达坂城区\n" +
                "30\t新疆自治区\t991\t乌鲁木齐市\t650109\t米东区\n" +
                "30\t新疆自治区\t991\t乌鲁木齐市\t650121\t乌鲁木齐县\n" +
                "30\t新疆自治区\t992\t奎屯市\t654005\t奎屯市\n" +
                "30\t新疆自治区\t993\t石河子市\t659001\t石河子市\n" +
                "30\t新疆自治区\t994\t昌吉市\t652301\t昌吉市\n" +
                "30\t新疆自治区\t994\t昌吉市\t652302\t阜康市\n" +
                "30\t新疆自治区\t994\t昌吉市\t652323\t呼图壁县\n" +
                "30\t新疆自治区\t994\t昌吉市\t652324\t玛纳斯县\n" +
                "30\t新疆自治区\t994\t昌吉市\t652325\t奇台县\n" +
                "30\t新疆自治区\t994\t昌吉市\t652327\t吉木萨尔县\n" +
                "30\t新疆自治区\t994\t昌吉市\t652328\t木垒哈萨克自治县\n" +
                "30\t新疆自治区\t995\t吐鲁番市\t650402\t高昌区\n" +
                "30\t新疆自治区\t995\t吐鲁番市\t650421\t鄯善县\n" +
                "30\t新疆自治区\t995\t吐鲁番市\t650422\t托克逊县\n" +
                "30\t新疆自治区\t996\t库尔勒市\t652801\t库尔勒市\n" +
                "30\t新疆自治区\t996\t库尔勒市\t652822\t轮台县\n" +
                "30\t新疆自治区\t996\t库尔勒市\t652823\t尉犁县\n" +
                "30\t新疆自治区\t996\t库尔勒市\t652824\t若羌县\n" +
                "30\t新疆自治区\t996\t库尔勒市\t652825\t且末县\n" +
                "30\t新疆自治区\t996\t库尔勒市\t652826\t焉耆回族自治县\n" +
                "30\t新疆自治区\t996\t库尔勒市\t652827\t和静县\n" +
                "30\t新疆自治区\t996\t库尔勒市\t652828\t和硕县\n" +
                "30\t新疆自治区\t996\t库尔勒市\t652829\t博湖县\n" +
                "30\t新疆自治区\t997\t阿克苏市\t652922\t温宿县\n" +
                "30\t新疆自治区\t997\t阿克苏市\t652923\t库车县\n" +
                "30\t新疆自治区\t997\t阿克苏市\t652924\t沙雅县\n" +
                "30\t新疆自治区\t997\t阿克苏市\t652925\t新和县\n" +
                "30\t新疆自治区\t997\t阿克苏市\t652926\t拜城县\n" +
                "30\t新疆自治区\t997\t阿克苏市\t652927\t乌什县\n" +
                "30\t新疆自治区\t997\t阿克苏市\t652928\t阿瓦提县\n" +
                "30\t新疆自治区\t997\t阿克苏市\t652929\t柯坪县\n" +
                "30\t新疆自治区\t998\t喀什市\t653101\t喀什市\n" +
                "30\t新疆自治区\t998\t喀什市\t653121\t疏附县\n" +
                "30\t新疆自治区\t998\t喀什市\t653122\t疏勒县\n" +
                "30\t新疆自治区\t998\t喀什市\t653123\t英吉沙县\n" +
                "30\t新疆自治区\t998\t喀什市\t653124\t泽普县\n" +
                "30\t新疆自治区\t998\t喀什市\t653125\t莎车县\n" +
                "30\t新疆自治区\t998\t喀什市\t653126\t叶城县\n" +
                "30\t新疆自治区\t998\t喀什市\t653127\t麦盖提县\n" +
                "30\t新疆自治区\t998\t喀什市\t653128\t岳普湖县\n" +
                "30\t新疆自治区\t998\t喀什市\t653129\t伽师县\n" +
                "30\t新疆自治区\t998\t喀什市\t653130\t巴楚县\n" +
                "30\t新疆自治区\t998\t喀什市\t653131\t塔什库尔干塔吉克自治县\n" +
                "30\t新疆自治区\t999\t伊犁市\t654002\t伊宁市\n" +
                "30\t新疆自治区\t999\t伊犁市\t654003\t奎屯市\n" +
                "30\t新疆自治区\t999\t伊犁市\t654004\t霍尔果斯市\n" +
                "30\t新疆自治区\t999\t伊犁市\t654021\t伊宁县\n" +
                "30\t新疆自治区\t999\t伊犁市\t654022\t察布查尔锡伯自治县\n" +
                "30\t新疆自治区\t999\t伊犁市\t654023\t霍城县\n" +
                "30\t新疆自治区\t999\t伊犁市\t654024\t巩留县\n" +
                "30\t新疆自治区\t999\t伊犁市\t654025\t新源县\n" +
                "30\t新疆自治区\t999\t伊犁市\t654026\t昭苏县\n" +
                "30\t新疆自治区\t999\t伊犁市\t654027\t特克斯县\n" +
                "30\t新疆自治区\t999\t伊犁市\t654028\t尼勒克县\n" +
                "30\t新疆自治区\t997\t阿克苏市\t652901\t阿克苏市\n" +
                "30\t新疆自治区\t901\t塔城市\t654201\t塔城市\n" +
                "30\t新疆自治区\t901\t塔城市\t654202\t乌苏市\n" +
                "30\t新疆自治区\t901\t塔城市\t654221\t额敏县\n" +
                "30\t新疆自治区\t901\t塔城市\t654223\t沙湾县\n" +
                "30\t新疆自治区\t901\t塔城市\t654224\t托里县\n" +
                "30\t新疆自治区\t901\t塔城市\t654225\t裕民县\n" +
                "30\t新疆自治区\t901\t塔城市\t654226\t和布克赛尔蒙古自治县\n" +
                "30\t新疆自治区\t902\t哈密市\t650502\t伊州区\n" +
                "30\t新疆自治区\t902\t哈密市\t650521\t巴里坤哈萨克自治县\n" +
                "30\t新疆自治区\t902\t哈密市\t650522\t伊吾县\n" +
                "30\t新疆自治区\t903\t和田市\t653201\t和田市\n" +
                "30\t新疆自治区\t903\t和田市\t653221\t和田县\n" +
                "30\t新疆自治区\t903\t和田市\t653222\t墨玉县\n" +
                "30\t新疆自治区\t903\t和田市\t653223\t皮山县\n" +
                "30\t新疆自治区\t903\t和田市\t653224\t洛浦县\n" +
                "30\t新疆自治区\t903\t和田市\t653225\t策勒县\n" +
                "30\t新疆自治区\t903\t和田市\t653226\t于田县\n" +
                "30\t新疆自治区\t903\t和田市\t653227\t民丰县\n" +
                "30\t新疆自治区\t906\t阿勒泰市\t654301\t阿勒泰市\n" +
                "30\t新疆自治区\t906\t阿勒泰市\t654321\t布尔津县\n" +
                "30\t新疆自治区\t906\t阿勒泰市\t654322\t富蕴县\n" +
                "30\t新疆自治区\t906\t阿勒泰市\t654323\t福海县\n" +
                "30\t新疆自治区\t906\t阿勒泰市\t654324\t哈巴河县\n" +
                "30\t新疆自治区\t906\t阿勒泰市\t654325\t青河县\n" +
                "30\t新疆自治区\t906\t阿勒泰市\t654326\t吉木乃县\n" +
                "30\t新疆自治区\t908\t克州市\t653001\t阿图什市\n" +
                "30\t新疆自治区\t908\t克州市\t653022\t阿克陶县\n" +
                "30\t新疆自治区\t908\t克州市\t653023\t阿合奇县\n" +
                "30\t新疆自治区\t908\t克州市\t653024\t乌恰县\n" +
                "30\t新疆自治区\t909\t博乐市\t652701\t博乐市\n" +
                "30\t新疆自治区\t909\t博乐市\t652702\t阿拉山口市\n" +
                "30\t新疆自治区\t909\t博乐市\t652722\t精河县\n" +
                "30\t新疆自治区\t909\t博乐市\t652723\t温泉县\n" +
                "30\t新疆自治区\t990\t克拉玛依市\t650202\t独山子区\n" +
                "30\t新疆自治区\t990\t克拉玛依市\t650203\t克拉玛依区\n" +
                "30\t新疆自治区\t990\t克拉玛依市\t650204\t白碱滩区\n" +
                "30\t新疆自治区\t990\t克拉玛依市\t650205\t乌尔禾区\n" +
                "30\t新疆自治区\t991\t乌鲁木齐市\t650102\t天山区\n" +
                "30\t新疆自治区\t904\t阿拉尔市\t659002\t阿拉尔市\n" +
                "30\t新疆自治区\t905\t图木舒克市\t659003\t图木舒克市\n" +
                "30\t新疆自治区\t907\t五家渠市\t659004\t五家渠市\n" +
                "30\t新疆自治区\t910\t铁门关市\t659006\t铁门关市\n" +
                "31\t重庆\t230\t重庆市\t500101\t万州区\n" +
                "31\t重庆\t230\t重庆市\t500102\t涪陵区\n" +
                "31\t重庆\t230\t重庆市\t500103\t渝中区\n" +
                "31\t重庆\t230\t重庆市\t500104\t大渡口区\n" +
                "31\t重庆\t230\t重庆市\t500105\t江北区\n" +
                "31\t重庆\t230\t重庆市\t500106\t沙坪坝区\n" +
                "31\t重庆\t230\t重庆市\t500107\t九龙坡区\n" +
                "31\t重庆\t230\t重庆市\t500108\t南岸区\n" +
                "31\t重庆\t230\t重庆市\t500109\t北碚区\n" +
                "31\t重庆\t230\t重庆市\t500110\t綦江区\n" +
                "31\t重庆\t230\t重庆市\t500111\t大足区\n" +
                "31\t重庆\t230\t重庆市\t500112\t渝北区\n" +
                "31\t重庆\t230\t重庆市\t500113\t巴南区\n" +
                "31\t重庆\t230\t重庆市\t500114\t黔江区\n" +
                "31\t重庆\t230\t重庆市\t500115\t长寿区\n" +
                "31\t重庆\t230\t重庆市\t500116\t江津区\n" +
                "31\t重庆\t230\t重庆市\t500117\t合川区\n" +
                "31\t重庆\t230\t重庆市\t500118\t永川区\n" +
                "31\t重庆\t230\t重庆市\t500119\t南川区\n" +
                "31\t重庆\t230\t重庆市\t500120\t璧山区\n" +
                "31\t重庆\t230\t重庆市\t500151\t铜梁区\n" +
                "31\t重庆\t230\t重庆市\t500152\t潼南区\n" +
                "31\t重庆\t230\t重庆市\t500153\t荣昌区\n" +
                "31\t重庆\t230\t重庆市\t500154\t开州区\n" +
                "31\t重庆\t230\t重庆市\t500228\t梁平县\n" +
                "31\t重庆\t230\t重庆市\t500229\t城口县\n" +
                "31\t重庆\t230\t重庆市\t500230\t丰都县\n" +
                "31\t重庆\t230\t重庆市\t500231\t垫江县\n" +
                "31\t重庆\t230\t重庆市\t500232\t武隆县\n" +
                "31\t重庆\t230\t重庆市\t500233\t忠县\n" +
                "31\t重庆\t230\t重庆市\t500235\t云阳县\n" +
                "31\t重庆\t230\t重庆市\t500236\t奉节县\n" +
                "31\t重庆\t230\t重庆市\t500237\t巫山县\n" +
                "31\t重庆\t230\t重庆市\t500238\t巫溪县\n" +
                "31\t重庆\t230\t重庆市\t500240\t石柱土家族自治县\n" +
                "31\t重庆\t230\t重庆市\t500241\t秀山土家族苗族自治县\n" +
                "31\t重庆\t230\t重庆市\t500242\t酉阳土家族苗族自治县\n" +
                "31\t重庆\t230\t重庆市\t500243\t彭水苗族土家族自治县\n" +
                "31\t重庆\t230\t重庆市\t500200\t重庆郊县\n";


        String a="[{\n" +
                "        name: \"北京\",\n" +
                "        code: \"110000\",\n" +
                "        sub: [{\n" +
                "            name: \"北京市\",\n" +
                "            code: \"110000\",\n" +
                "            sub: [{\n" +
                "                name: \"东城区\",\n" +
                "                code: \"110101\"\n" +
                "            }, {\n" +
                "                name: \"西城区\",\n" +
                "                code: \"110102\"\n" +
                "            }, {\n" +
                "                name: \"朝阳区\",\n" +
                "                code: \"110105\"\n" +
                "            }, {\n" +
                "                name: \"丰台区\",\n" +
                "                code: \"110106\"\n" +
                "            }, {\n" +
                "                name: \"石景山区\",\n" +
                "                code: \"110107\"\n" +
                "            }, {\n" +
                "                name: \"海淀区\",\n" +
                "                code: \"110108\"\n" +
                "            }, {\n" +
                "                name: \"门头沟区\",\n" +
                "                code: \"110109\"\n" +
                "            }, {\n" +
                "                name: \"房山区\",\n" +
                "                code: \"110111\"\n" +
                "            }, {\n" +
                "                name: \"通州区\",\n" +
                "                code: \"110112\"\n" +
                "            }, {\n" +
                "                name: \"顺义区\",\n" +
                "                code: \"110113\"\n" +
                "            }, {\n" +
                "                name: \"昌平区\",\n" +
                "                code: \"110114\"\n" +
                "            }, {\n" +
                "                name: \"大兴区\",\n" +
                "                code: \"110115\"\n" +
                "            }, {\n" +
                "                name: \"怀柔区\",\n" +
                "                code: \"110116\"\n" +
                "            }, {\n" +
                "                name: \"平谷区\",\n" +
                "                code: \"110117\"\n" +
                "            }, {\n" +
                "                name: \"密云县\",\n" +
                "                code: \"110228\"\n" +
                "            }, {\n" +
                "                name: \"延庆县\",\n" +
                "                code: \"110229\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"天津\",\n" +
                "        code: \"120000\",\n" +
                "        sub: [{\n" +
                "            name: \"天津市\",\n" +
                "            code: \"120000\",\n" +
                "            sub: [{\n" +
                "                name: \"和平区\",\n" +
                "                code: \"120101\"\n" +
                "            }, {\n" +
                "                name: \"河东区\",\n" +
                "                code: \"120102\"\n" +
                "            }, {\n" +
                "                name: \"河西区\",\n" +
                "                code: \"120103\"\n" +
                "            }, {\n" +
                "                name: \"南开区\",\n" +
                "                code: \"120104\"\n" +
                "            }, {\n" +
                "                name: \"河北区\",\n" +
                "                code: \"120105\"\n" +
                "            }, {\n" +
                "                name: \"红桥区\",\n" +
                "                code: \"120106\"\n" +
                "            }, {\n" +
                "                name: \"东丽区\",\n" +
                "                code: \"120110\"\n" +
                "            }, {\n" +
                "                name: \"西青区\",\n" +
                "                code: \"120111\"\n" +
                "            }, {\n" +
                "                name: \"津南区\",\n" +
                "                code: \"120112\"\n" +
                "            }, {\n" +
                "                name: \"北辰区\",\n" +
                "                code: \"120113\"\n" +
                "            }, {\n" +
                "                name: \"武清区\",\n" +
                "                code: \"120114\"\n" +
                "            }, {\n" +
                "                name: \"宝坻区\",\n" +
                "                code: \"120115\"\n" +
                "            }, {\n" +
                "                name: \"滨海新区\",\n" +
                "                code: \"120116\"\n" +
                "            }, {\n" +
                "                name: \"宁河县\",\n" +
                "                code: \"120221\"\n" +
                "            }, {\n" +
                "                name: \"静海县\",\n" +
                "                code: \"120223\"\n" +
                "            }, {\n" +
                "                name: \"蓟县\",\n" +
                "                code: \"120225\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"河北省\",\n" +
                "        code: \"130000\",\n" +
                "        sub: [{\n" +
                "            name: \"石家庄市\",\n" +
                "            code: \"130100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"130101\"\n" +
                "            }, {\n" +
                "                name: \"长安区\",\n" +
                "                code: \"130102\"\n" +
                "            }, {\n" +
                "                name: \"桥西区\",\n" +
                "                code: \"130104\"\n" +
                "            }, {\n" +
                "                name: \"新华区\",\n" +
                "                code: \"130105\"\n" +
                "            }, {\n" +
                "                name: \"井陉矿区\",\n" +
                "                code: \"130107\"\n" +
                "            }, {\n" +
                "                name: \"裕华区\",\n" +
                "                code: \"130108\"\n" +
                "            }, {\n" +
                "                name: \"藁城区\",\n" +
                "                code: \"130109\"\n" +
                "            }, {\n" +
                "                name: \"鹿泉区\",\n" +
                "                code: \"130110\"\n" +
                "            }, {\n" +
                "                name: \"栾城区\",\n" +
                "                code: \"130111\"\n" +
                "            }, {\n" +
                "                name: \"井陉县\",\n" +
                "                code: \"130121\"\n" +
                "            }, {\n" +
                "                name: \"正定县\",\n" +
                "                code: \"130123\"\n" +
                "            }, {\n" +
                "                name: \"行唐县\",\n" +
                "                code: \"130125\"\n" +
                "            }, {\n" +
                "                name: \"灵寿县\",\n" +
                "                code: \"130126\"\n" +
                "            }, {\n" +
                "                name: \"高邑县\",\n" +
                "                code: \"130127\"\n" +
                "            }, {\n" +
                "                name: \"深泽县\",\n" +
                "                code: \"130128\"\n" +
                "            }, {\n" +
                "                name: \"赞皇县\",\n" +
                "                code: \"130129\"\n" +
                "            }, {\n" +
                "                name: \"无极县\",\n" +
                "                code: \"130130\"\n" +
                "            }, {\n" +
                "                name: \"平山县\",\n" +
                "                code: \"130131\"\n" +
                "            }, {\n" +
                "                name: \"元氏县\",\n" +
                "                code: \"130132\"\n" +
                "            }, {\n" +
                "                name: \"赵县\",\n" +
                "                code: \"130133\"\n" +
                "            }, {\n" +
                "                name: \"辛集市\",\n" +
                "                code: \"130181\"\n" +
                "            }, {\n" +
                "                name: \"晋州市\",\n" +
                "                code: \"130183\"\n" +
                "            }, {\n" +
                "                name: \"新乐市\",\n" +
                "                code: \"130184\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"唐山市\",\n" +
                "            code: \"130200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"130201\"\n" +
                "            }, {\n" +
                "                name: \"路南区\",\n" +
                "                code: \"130202\"\n" +
                "            }, {\n" +
                "                name: \"路北区\",\n" +
                "                code: \"130203\"\n" +
                "            }, {\n" +
                "                name: \"古冶区\",\n" +
                "                code: \"130204\"\n" +
                "            }, {\n" +
                "                name: \"开平区\",\n" +
                "                code: \"130205\"\n" +
                "            }, {\n" +
                "                name: \"丰南区\",\n" +
                "                code: \"130207\"\n" +
                "            }, {\n" +
                "                name: \"丰润区\",\n" +
                "                code: \"130208\"\n" +
                "            }, {\n" +
                "                name: \"曹妃甸区\",\n" +
                "                code: \"130209\"\n" +
                "            }, {\n" +
                "                name: \"滦县\",\n" +
                "                code: \"130223\"\n" +
                "            }, {\n" +
                "                name: \"滦南县\",\n" +
                "                code: \"130224\"\n" +
                "            }, {\n" +
                "                name: \"乐亭县\",\n" +
                "                code: \"130225\"\n" +
                "            }, {\n" +
                "                name: \"迁西县\",\n" +
                "                code: \"130227\"\n" +
                "            }, {\n" +
                "                name: \"玉田县\",\n" +
                "                code: \"130229\"\n" +
                "            }, {\n" +
                "                name: \"遵化市\",\n" +
                "                code: \"130281\"\n" +
                "            }, {\n" +
                "                name: \"迁安市\",\n" +
                "                code: \"130283\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"秦皇岛市\",\n" +
                "            code: \"130300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"130301\"\n" +
                "            }, {\n" +
                "                name: \"海港区\",\n" +
                "                code: \"130302\"\n" +
                "            }, {\n" +
                "                name: \"山海关区\",\n" +
                "                code: \"130303\"\n" +
                "            }, {\n" +
                "                name: \"北戴河区\",\n" +
                "                code: \"130304\"\n" +
                "            }, {\n" +
                "                name: \"青龙满族自治县\",\n" +
                "                code: \"130321\"\n" +
                "            }, {\n" +
                "                name: \"昌黎县\",\n" +
                "                code: \"130322\"\n" +
                "            }, {\n" +
                "                name: \"抚宁县\",\n" +
                "                code: \"130323\"\n" +
                "            }, {\n" +
                "                name: \"卢龙县\",\n" +
                "                code: \"130324\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"邯郸市\",\n" +
                "            code: \"130400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"130401\"\n" +
                "            }, {\n" +
                "                name: \"邯山区\",\n" +
                "                code: \"130402\"\n" +
                "            }, {\n" +
                "                name: \"丛台区\",\n" +
                "                code: \"130403\"\n" +
                "            }, {\n" +
                "                name: \"复兴区\",\n" +
                "                code: \"130404\"\n" +
                "            }, {\n" +
                "                name: \"峰峰矿区\",\n" +
                "                code: \"130406\"\n" +
                "            }, {\n" +
                "                name: \"邯郸县\",\n" +
                "                code: \"130421\"\n" +
                "            }, {\n" +
                "                name: \"临漳县\",\n" +
                "                code: \"130423\"\n" +
                "            }, {\n" +
                "                name: \"成安县\",\n" +
                "                code: \"130424\"\n" +
                "            }, {\n" +
                "                name: \"大名县\",\n" +
                "                code: \"130425\"\n" +
                "            }, {\n" +
                "                name: \"涉县\",\n" +
                "                code: \"130426\"\n" +
                "            }, {\n" +
                "                name: \"磁县\",\n" +
                "                code: \"130427\"\n" +
                "            }, {\n" +
                "                name: \"肥乡县\",\n" +
                "                code: \"130428\"\n" +
                "            }, {\n" +
                "                name: \"永年县\",\n" +
                "                code: \"130429\"\n" +
                "            }, {\n" +
                "                name: \"邱县\",\n" +
                "                code: \"130430\"\n" +
                "            }, {\n" +
                "                name: \"鸡泽县\",\n" +
                "                code: \"130431\"\n" +
                "            }, {\n" +
                "                name: \"广平县\",\n" +
                "                code: \"130432\"\n" +
                "            }, {\n" +
                "                name: \"馆陶县\",\n" +
                "                code: \"130433\"\n" +
                "            }, {\n" +
                "                name: \"魏县\",\n" +
                "                code: \"130434\"\n" +
                "            }, {\n" +
                "                name: \"曲周县\",\n" +
                "                code: \"130435\"\n" +
                "            }, {\n" +
                "                name: \"武安市\",\n" +
                "                code: \"130481\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"邢台市\",\n" +
                "            code: \"130500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"130501\"\n" +
                "            }, {\n" +
                "                name: \"桥东区\",\n" +
                "                code: \"130502\"\n" +
                "            }, {\n" +
                "                name: \"桥西区\",\n" +
                "                code: \"130503\"\n" +
                "            }, {\n" +
                "                name: \"邢台县\",\n" +
                "                code: \"130521\"\n" +
                "            }, {\n" +
                "                name: \"临城县\",\n" +
                "                code: \"130522\"\n" +
                "            }, {\n" +
                "                name: \"内丘县\",\n" +
                "                code: \"130523\"\n" +
                "            }, {\n" +
                "                name: \"柏乡县\",\n" +
                "                code: \"130524\"\n" +
                "            }, {\n" +
                "                name: \"隆尧县\",\n" +
                "                code: \"130525\"\n" +
                "            }, {\n" +
                "                name: \"任县\",\n" +
                "                code: \"130526\"\n" +
                "            }, {\n" +
                "                name: \"南和县\",\n" +
                "                code: \"130527\"\n" +
                "            }, {\n" +
                "                name: \"宁晋县\",\n" +
                "                code: \"130528\"\n" +
                "            }, {\n" +
                "                name: \"巨鹿县\",\n" +
                "                code: \"130529\"\n" +
                "            }, {\n" +
                "                name: \"新河县\",\n" +
                "                code: \"130530\"\n" +
                "            }, {\n" +
                "                name: \"广宗县\",\n" +
                "                code: \"130531\"\n" +
                "            }, {\n" +
                "                name: \"平乡县\",\n" +
                "                code: \"130532\"\n" +
                "            }, {\n" +
                "                name: \"威县\",\n" +
                "                code: \"130533\"\n" +
                "            }, {\n" +
                "                name: \"清河县\",\n" +
                "                code: \"130534\"\n" +
                "            }, {\n" +
                "                name: \"临西县\",\n" +
                "                code: \"130535\"\n" +
                "            }, {\n" +
                "                name: \"南宫市\",\n" +
                "                code: \"130581\"\n" +
                "            }, {\n" +
                "                name: \"沙河市\",\n" +
                "                code: \"130582\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"保定市\",\n" +
                "            code: \"130600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"130601\"\n" +
                "            }, {\n" +
                "                name: \"新市区\",\n" +
                "                code: \"130602\"\n" +
                "            }, {\n" +
                "                name: \"北市区\",\n" +
                "                code: \"130603\"\n" +
                "            }, {\n" +
                "                name: \"南市区\",\n" +
                "                code: \"130604\"\n" +
                "            }, {\n" +
                "                name: \"满城县\",\n" +
                "                code: \"130621\"\n" +
                "            }, {\n" +
                "                name: \"清苑县\",\n" +
                "                code: \"130622\"\n" +
                "            }, {\n" +
                "                name: \"涞水县\",\n" +
                "                code: \"130623\"\n" +
                "            }, {\n" +
                "                name: \"阜平县\",\n" +
                "                code: \"130624\"\n" +
                "            }, {\n" +
                "                name: \"徐水县\",\n" +
                "                code: \"130625\"\n" +
                "            }, {\n" +
                "                name: \"定兴县\",\n" +
                "                code: \"130626\"\n" +
                "            }, {\n" +
                "                name: \"唐县\",\n" +
                "                code: \"130627\"\n" +
                "            }, {\n" +
                "                name: \"高阳县\",\n" +
                "                code: \"130628\"\n" +
                "            }, {\n" +
                "                name: \"容城县\",\n" +
                "                code: \"130629\"\n" +
                "            }, {\n" +
                "                name: \"涞源县\",\n" +
                "                code: \"130630\"\n" +
                "            }, {\n" +
                "                name: \"望都县\",\n" +
                "                code: \"130631\"\n" +
                "            }, {\n" +
                "                name: \"安新县\",\n" +
                "                code: \"130632\"\n" +
                "            }, {\n" +
                "                name: \"易县\",\n" +
                "                code: \"130633\"\n" +
                "            }, {\n" +
                "                name: \"曲阳县\",\n" +
                "                code: \"130634\"\n" +
                "            }, {\n" +
                "                name: \"蠡县\",\n" +
                "                code: \"130635\"\n" +
                "            }, {\n" +
                "                name: \"顺平县\",\n" +
                "                code: \"130636\"\n" +
                "            }, {\n" +
                "                name: \"博野县\",\n" +
                "                code: \"130637\"\n" +
                "            }, {\n" +
                "                name: \"雄县\",\n" +
                "                code: \"130638\"\n" +
                "            }, {\n" +
                "                name: \"涿州市\",\n" +
                "                code: \"130681\"\n" +
                "            }, {\n" +
                "                name: \"定州市\",\n" +
                "                code: \"130682\"\n" +
                "            }, {\n" +
                "                name: \"安国市\",\n" +
                "                code: \"130683\"\n" +
                "            }, {\n" +
                "                name: \"高碑店市\",\n" +
                "                code: \"130684\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"张家口市\",\n" +
                "            code: \"130700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"130701\"\n" +
                "            }, {\n" +
                "                name: \"桥东区\",\n" +
                "                code: \"130702\"\n" +
                "            }, {\n" +
                "                name: \"桥西区\",\n" +
                "                code: \"130703\"\n" +
                "            }, {\n" +
                "                name: \"宣化区\",\n" +
                "                code: \"130705\"\n" +
                "            }, {\n" +
                "                name: \"下花园区\",\n" +
                "                code: \"130706\"\n" +
                "            }, {\n" +
                "                name: \"宣化县\",\n" +
                "                code: \"130721\"\n" +
                "            }, {\n" +
                "                name: \"张北县\",\n" +
                "                code: \"130722\"\n" +
                "            }, {\n" +
                "                name: \"康保县\",\n" +
                "                code: \"130723\"\n" +
                "            }, {\n" +
                "                name: \"沽源县\",\n" +
                "                code: \"130724\"\n" +
                "            }, {\n" +
                "                name: \"尚义县\",\n" +
                "                code: \"130725\"\n" +
                "            }, {\n" +
                "                name: \"蔚县\",\n" +
                "                code: \"130726\"\n" +
                "            }, {\n" +
                "                name: \"阳原县\",\n" +
                "                code: \"130727\"\n" +
                "            }, {\n" +
                "                name: \"怀安县\",\n" +
                "                code: \"130728\"\n" +
                "            }, {\n" +
                "                name: \"万全县\",\n" +
                "                code: \"130729\"\n" +
                "            }, {\n" +
                "                name: \"怀来县\",\n" +
                "                code: \"130730\"\n" +
                "            }, {\n" +
                "                name: \"涿鹿县\",\n" +
                "                code: \"130731\"\n" +
                "            }, {\n" +
                "                name: \"赤城县\",\n" +
                "                code: \"130732\"\n" +
                "            }, {\n" +
                "                name: \"崇礼县\",\n" +
                "                code: \"130733\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"承德市\",\n" +
                "            code: \"130800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"130801\"\n" +
                "            }, {\n" +
                "                name: \"双桥区\",\n" +
                "                code: \"130802\"\n" +
                "            }, {\n" +
                "                name: \"双滦区\",\n" +
                "                code: \"130803\"\n" +
                "            }, {\n" +
                "                name: \"鹰手营子矿区\",\n" +
                "                code: \"130804\"\n" +
                "            }, {\n" +
                "                name: \"承德县\",\n" +
                "                code: \"130821\"\n" +
                "            }, {\n" +
                "                name: \"兴隆县\",\n" +
                "                code: \"130822\"\n" +
                "            }, {\n" +
                "                name: \"平泉县\",\n" +
                "                code: \"130823\"\n" +
                "            }, {\n" +
                "                name: \"滦平县\",\n" +
                "                code: \"130824\"\n" +
                "            }, {\n" +
                "                name: \"隆化县\",\n" +
                "                code: \"130825\"\n" +
                "            }, {\n" +
                "                name: \"丰宁满族自治县\",\n" +
                "                code: \"130826\"\n" +
                "            }, {\n" +
                "                name: \"宽城满族自治县\",\n" +
                "                code: \"130827\"\n" +
                "            }, {\n" +
                "                name: \"围场满族蒙古族自治县\",\n" +
                "                code: \"130828\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"沧州市\",\n" +
                "            code: \"130900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"130901\"\n" +
                "            }, {\n" +
                "                name: \"新华区\",\n" +
                "                code: \"130902\"\n" +
                "            }, {\n" +
                "                name: \"运河区\",\n" +
                "                code: \"130903\"\n" +
                "            }, {\n" +
                "                name: \"沧县\",\n" +
                "                code: \"130921\"\n" +
                "            }, {\n" +
                "                name: \"青县\",\n" +
                "                code: \"130922\"\n" +
                "            }, {\n" +
                "                name: \"东光县\",\n" +
                "                code: \"130923\"\n" +
                "            }, {\n" +
                "                name: \"海兴县\",\n" +
                "                code: \"130924\"\n" +
                "            }, {\n" +
                "                name: \"盐山县\",\n" +
                "                code: \"130925\"\n" +
                "            }, {\n" +
                "                name: \"肃宁县\",\n" +
                "                code: \"130926\"\n" +
                "            }, {\n" +
                "                name: \"南皮县\",\n" +
                "                code: \"130927\"\n" +
                "            }, {\n" +
                "                name: \"吴桥县\",\n" +
                "                code: \"130928\"\n" +
                "            }, {\n" +
                "                name: \"献县\",\n" +
                "                code: \"130929\"\n" +
                "            }, {\n" +
                "                name: \"孟村回族自治县\",\n" +
                "                code: \"130930\"\n" +
                "            }, {\n" +
                "                name: \"泊头市\",\n" +
                "                code: \"130981\"\n" +
                "            }, {\n" +
                "                name: \"任丘市\",\n" +
                "                code: \"130982\"\n" +
                "            }, {\n" +
                "                name: \"黄骅市\",\n" +
                "                code: \"130983\"\n" +
                "            }, {\n" +
                "                name: \"河间市\",\n" +
                "                code: \"130984\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"廊坊市\",\n" +
                "            code: \"131000\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"131001\"\n" +
                "            }, {\n" +
                "                name: \"安次区\",\n" +
                "                code: \"131002\"\n" +
                "            }, {\n" +
                "                name: \"广阳区\",\n" +
                "                code: \"131003\"\n" +
                "            }, {\n" +
                "                name: \"固安县\",\n" +
                "                code: \"131022\"\n" +
                "            }, {\n" +
                "                name: \"永清县\",\n" +
                "                code: \"131023\"\n" +
                "            }, {\n" +
                "                name: \"香河县\",\n" +
                "                code: \"131024\"\n" +
                "            }, {\n" +
                "                name: \"大城县\",\n" +
                "                code: \"131025\"\n" +
                "            }, {\n" +
                "                name: \"文安县\",\n" +
                "                code: \"131026\"\n" +
                "            }, {\n" +
                "                name: \"大厂回族自治县\",\n" +
                "                code: \"131028\"\n" +
                "            }, {\n" +
                "                name: \"霸州市\",\n" +
                "                code: \"131081\"\n" +
                "            }, {\n" +
                "                name: \"三河市\",\n" +
                "                code: \"131082\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"衡水市\",\n" +
                "            code: \"131100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"131101\"\n" +
                "            }, {\n" +
                "                name: \"桃城区\",\n" +
                "                code: \"131102\"\n" +
                "            }, {\n" +
                "                name: \"枣强县\",\n" +
                "                code: \"131121\"\n" +
                "            }, {\n" +
                "                name: \"武邑县\",\n" +
                "                code: \"131122\"\n" +
                "            }, {\n" +
                "                name: \"武强县\",\n" +
                "                code: \"131123\"\n" +
                "            }, {\n" +
                "                name: \"饶阳县\",\n" +
                "                code: \"131124\"\n" +
                "            }, {\n" +
                "                name: \"安平县\",\n" +
                "                code: \"131125\"\n" +
                "            }, {\n" +
                "                name: \"故城县\",\n" +
                "                code: \"131126\"\n" +
                "            }, {\n" +
                "                name: \"景县\",\n" +
                "                code: \"131127\"\n" +
                "            }, {\n" +
                "                name: \"阜城县\",\n" +
                "                code: \"131128\"\n" +
                "            }, {\n" +
                "                name: \"冀州市\",\n" +
                "                code: \"131181\"\n" +
                "            }, {\n" +
                "                name: \"深州市\",\n" +
                "                code: \"131182\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"山西省\",\n" +
                "        code: \"140000\",\n" +
                "        sub: [{\n" +
                "            name: \"太原市\",\n" +
                "            code: \"140100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"140101\"\n" +
                "            }, {\n" +
                "                name: \"小店区\",\n" +
                "                code: \"140105\"\n" +
                "            }, {\n" +
                "                name: \"迎泽区\",\n" +
                "                code: \"140106\"\n" +
                "            }, {\n" +
                "                name: \"杏花岭区\",\n" +
                "                code: \"140107\"\n" +
                "            }, {\n" +
                "                name: \"尖草坪区\",\n" +
                "                code: \"140108\"\n" +
                "            }, {\n" +
                "                name: \"万柏林区\",\n" +
                "                code: \"140109\"\n" +
                "            }, {\n" +
                "                name: \"晋源区\",\n" +
                "                code: \"140110\"\n" +
                "            }, {\n" +
                "                name: \"清徐县\",\n" +
                "                code: \"140121\"\n" +
                "            }, {\n" +
                "                name: \"阳曲县\",\n" +
                "                code: \"140122\"\n" +
                "            }, {\n" +
                "                name: \"娄烦县\",\n" +
                "                code: \"140123\"\n" +
                "            }, {\n" +
                "                name: \"古交市\",\n" +
                "                code: \"140181\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"大同市\",\n" +
                "            code: \"140200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"140201\"\n" +
                "            }, {\n" +
                "                name: \"城区\",\n" +
                "                code: \"140202\"\n" +
                "            }, {\n" +
                "                name: \"矿区\",\n" +
                "                code: \"140203\"\n" +
                "            }, {\n" +
                "                name: \"南郊区\",\n" +
                "                code: \"140211\"\n" +
                "            }, {\n" +
                "                name: \"新荣区\",\n" +
                "                code: \"140212\"\n" +
                "            }, {\n" +
                "                name: \"阳高县\",\n" +
                "                code: \"140221\"\n" +
                "            }, {\n" +
                "                name: \"天镇县\",\n" +
                "                code: \"140222\"\n" +
                "            }, {\n" +
                "                name: \"广灵县\",\n" +
                "                code: \"140223\"\n" +
                "            }, {\n" +
                "                name: \"灵丘县\",\n" +
                "                code: \"140224\"\n" +
                "            }, {\n" +
                "                name: \"浑源县\",\n" +
                "                code: \"140225\"\n" +
                "            }, {\n" +
                "                name: \"左云县\",\n" +
                "                code: \"140226\"\n" +
                "            }, {\n" +
                "                name: \"大同县\",\n" +
                "                code: \"140227\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"阳泉市\",\n" +
                "            code: \"140300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"140301\"\n" +
                "            }, {\n" +
                "                name: \"城区\",\n" +
                "                code: \"140302\"\n" +
                "            }, {\n" +
                "                name: \"矿区\",\n" +
                "                code: \"140303\"\n" +
                "            }, {\n" +
                "                name: \"郊区\",\n" +
                "                code: \"140311\"\n" +
                "            }, {\n" +
                "                name: \"平定县\",\n" +
                "                code: \"140321\"\n" +
                "            }, {\n" +
                "                name: \"盂县\",\n" +
                "                code: \"140322\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"长治市\",\n" +
                "            code: \"140400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"140401\"\n" +
                "            }, {\n" +
                "                name: \"城区\",\n" +
                "                code: \"140402\"\n" +
                "            }, {\n" +
                "                name: \"郊区\",\n" +
                "                code: \"140411\"\n" +
                "            }, {\n" +
                "                name: \"长治县\",\n" +
                "                code: \"140421\"\n" +
                "            }, {\n" +
                "                name: \"襄垣县\",\n" +
                "                code: \"140423\"\n" +
                "            }, {\n" +
                "                name: \"屯留县\",\n" +
                "                code: \"140424\"\n" +
                "            }, {\n" +
                "                name: \"平顺县\",\n" +
                "                code: \"140425\"\n" +
                "            }, {\n" +
                "                name: \"黎城县\",\n" +
                "                code: \"140426\"\n" +
                "            }, {\n" +
                "                name: \"壶关县\",\n" +
                "                code: \"140427\"\n" +
                "            }, {\n" +
                "                name: \"长子县\",\n" +
                "                code: \"140428\"\n" +
                "            }, {\n" +
                "                name: \"武乡县\",\n" +
                "                code: \"140429\"\n" +
                "            }, {\n" +
                "                name: \"沁县\",\n" +
                "                code: \"140430\"\n" +
                "            }, {\n" +
                "                name: \"沁源县\",\n" +
                "                code: \"140431\"\n" +
                "            }, {\n" +
                "                name: \"潞城市\",\n" +
                "                code: \"140481\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"晋城市\",\n" +
                "            code: \"140500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"140501\"\n" +
                "            }, {\n" +
                "                name: \"城区\",\n" +
                "                code: \"140502\"\n" +
                "            }, {\n" +
                "                name: \"沁水县\",\n" +
                "                code: \"140521\"\n" +
                "            }, {\n" +
                "                name: \"阳城县\",\n" +
                "                code: \"140522\"\n" +
                "            }, {\n" +
                "                name: \"陵川县\",\n" +
                "                code: \"140524\"\n" +
                "            }, {\n" +
                "                name: \"泽州县\",\n" +
                "                code: \"140525\"\n" +
                "            }, {\n" +
                "                name: \"高平市\",\n" +
                "                code: \"140581\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"朔州市\",\n" +
                "            code: \"140600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"140601\"\n" +
                "            }, {\n" +
                "                name: \"朔城区\",\n" +
                "                code: \"140602\"\n" +
                "            }, {\n" +
                "                name: \"平鲁区\",\n" +
                "                code: \"140603\"\n" +
                "            }, {\n" +
                "                name: \"山阴县\",\n" +
                "                code: \"140621\"\n" +
                "            }, {\n" +
                "                name: \"应县\",\n" +
                "                code: \"140622\"\n" +
                "            }, {\n" +
                "                name: \"右玉县\",\n" +
                "                code: \"140623\"\n" +
                "            }, {\n" +
                "                name: \"怀仁县\",\n" +
                "                code: \"140624\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"晋中市\",\n" +
                "            code: \"140700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"140701\"\n" +
                "            }, {\n" +
                "                name: \"榆次区\",\n" +
                "                code: \"140702\"\n" +
                "            }, {\n" +
                "                name: \"榆社县\",\n" +
                "                code: \"140721\"\n" +
                "            }, {\n" +
                "                name: \"左权县\",\n" +
                "                code: \"140722\"\n" +
                "            }, {\n" +
                "                name: \"和顺县\",\n" +
                "                code: \"140723\"\n" +
                "            }, {\n" +
                "                name: \"昔阳县\",\n" +
                "                code: \"140724\"\n" +
                "            }, {\n" +
                "                name: \"寿阳县\",\n" +
                "                code: \"140725\"\n" +
                "            }, {\n" +
                "                name: \"太谷县\",\n" +
                "                code: \"140726\"\n" +
                "            }, {\n" +
                "                name: \"祁县\",\n" +
                "                code: \"140727\"\n" +
                "            }, {\n" +
                "                name: \"平遥县\",\n" +
                "                code: \"140728\"\n" +
                "            }, {\n" +
                "                name: \"灵石县\",\n" +
                "                code: \"140729\"\n" +
                "            }, {\n" +
                "                name: \"介休市\",\n" +
                "                code: \"140781\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"运城市\",\n" +
                "            code: \"140800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"140801\"\n" +
                "            }, {\n" +
                "                name: \"盐湖区\",\n" +
                "                code: \"140802\"\n" +
                "            }, {\n" +
                "                name: \"临猗县\",\n" +
                "                code: \"140821\"\n" +
                "            }, {\n" +
                "                name: \"万荣县\",\n" +
                "                code: \"140822\"\n" +
                "            }, {\n" +
                "                name: \"闻喜县\",\n" +
                "                code: \"140823\"\n" +
                "            }, {\n" +
                "                name: \"稷山县\",\n" +
                "                code: \"140824\"\n" +
                "            }, {\n" +
                "                name: \"新绛县\",\n" +
                "                code: \"140825\"\n" +
                "            }, {\n" +
                "                name: \"绛县\",\n" +
                "                code: \"140826\"\n" +
                "            }, {\n" +
                "                name: \"垣曲县\",\n" +
                "                code: \"140827\"\n" +
                "            }, {\n" +
                "                name: \"夏县\",\n" +
                "                code: \"140828\"\n" +
                "            }, {\n" +
                "                name: \"平陆县\",\n" +
                "                code: \"140829\"\n" +
                "            }, {\n" +
                "                name: \"芮城县\",\n" +
                "                code: \"140830\"\n" +
                "            }, {\n" +
                "                name: \"永济市\",\n" +
                "                code: \"140881\"\n" +
                "            }, {\n" +
                "                name: \"河津市\",\n" +
                "                code: \"140882\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"忻州市\",\n" +
                "            code: \"140900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"140901\"\n" +
                "            }, {\n" +
                "                name: \"忻府区\",\n" +
                "                code: \"140902\"\n" +
                "            }, {\n" +
                "                name: \"定襄县\",\n" +
                "                code: \"140921\"\n" +
                "            }, {\n" +
                "                name: \"五台县\",\n" +
                "                code: \"140922\"\n" +
                "            }, {\n" +
                "                name: \"代县\",\n" +
                "                code: \"140923\"\n" +
                "            }, {\n" +
                "                name: \"繁峙县\",\n" +
                "                code: \"140924\"\n" +
                "            }, {\n" +
                "                name: \"宁武县\",\n" +
                "                code: \"140925\"\n" +
                "            }, {\n" +
                "                name: \"静乐县\",\n" +
                "                code: \"140926\"\n" +
                "            }, {\n" +
                "                name: \"神池县\",\n" +
                "                code: \"140927\"\n" +
                "            }, {\n" +
                "                name: \"五寨县\",\n" +
                "                code: \"140928\"\n" +
                "            }, {\n" +
                "                name: \"岢岚县\",\n" +
                "                code: \"140929\"\n" +
                "            }, {\n" +
                "                name: \"河曲县\",\n" +
                "                code: \"140930\"\n" +
                "            }, {\n" +
                "                name: \"保德县\",\n" +
                "                code: \"140931\"\n" +
                "            }, {\n" +
                "                name: \"偏关县\",\n" +
                "                code: \"140932\"\n" +
                "            }, {\n" +
                "                name: \"原平市\",\n" +
                "                code: \"140981\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"临汾市\",\n" +
                "            code: \"141000\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"141001\"\n" +
                "            }, {\n" +
                "                name: \"尧都区\",\n" +
                "                code: \"141002\"\n" +
                "            }, {\n" +
                "                name: \"曲沃县\",\n" +
                "                code: \"141021\"\n" +
                "            }, {\n" +
                "                name: \"翼城县\",\n" +
                "                code: \"141022\"\n" +
                "            }, {\n" +
                "                name: \"襄汾县\",\n" +
                "                code: \"141023\"\n" +
                "            }, {\n" +
                "                name: \"洪洞县\",\n" +
                "                code: \"141024\"\n" +
                "            }, {\n" +
                "                name: \"古县\",\n" +
                "                code: \"141025\"\n" +
                "            }, {\n" +
                "                name: \"安泽县\",\n" +
                "                code: \"141026\"\n" +
                "            }, {\n" +
                "                name: \"浮山县\",\n" +
                "                code: \"141027\"\n" +
                "            }, {\n" +
                "                name: \"吉县\",\n" +
                "                code: \"141028\"\n" +
                "            }, {\n" +
                "                name: \"乡宁县\",\n" +
                "                code: \"141029\"\n" +
                "            }, {\n" +
                "                name: \"大宁县\",\n" +
                "                code: \"141030\"\n" +
                "            }, {\n" +
                "                name: \"隰县\",\n" +
                "                code: \"141031\"\n" +
                "            }, {\n" +
                "                name: \"永和县\",\n" +
                "                code: \"141032\"\n" +
                "            }, {\n" +
                "                name: \"蒲县\",\n" +
                "                code: \"141033\"\n" +
                "            }, {\n" +
                "                name: \"汾西县\",\n" +
                "                code: \"141034\"\n" +
                "            }, {\n" +
                "                name: \"侯马市\",\n" +
                "                code: \"141081\"\n" +
                "            }, {\n" +
                "                name: \"霍州市\",\n" +
                "                code: \"141082\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"吕梁市\",\n" +
                "            code: \"141100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"141101\"\n" +
                "            }, {\n" +
                "                name: \"离石区\",\n" +
                "                code: \"141102\"\n" +
                "            }, {\n" +
                "                name: \"文水县\",\n" +
                "                code: \"141121\"\n" +
                "            }, {\n" +
                "                name: \"交城县\",\n" +
                "                code: \"141122\"\n" +
                "            }, {\n" +
                "                name: \"兴县\",\n" +
                "                code: \"141123\"\n" +
                "            }, {\n" +
                "                name: \"临县\",\n" +
                "                code: \"141124\"\n" +
                "            }, {\n" +
                "                name: \"柳林县\",\n" +
                "                code: \"141125\"\n" +
                "            }, {\n" +
                "                name: \"石楼县\",\n" +
                "                code: \"141126\"\n" +
                "            }, {\n" +
                "                name: \"岚县\",\n" +
                "                code: \"141127\"\n" +
                "            }, {\n" +
                "                name: \"方山县\",\n" +
                "                code: \"141128\"\n" +
                "            }, {\n" +
                "                name: \"中阳县\",\n" +
                "                code: \"141129\"\n" +
                "            }, {\n" +
                "                name: \"交口县\",\n" +
                "                code: \"141130\"\n" +
                "            }, {\n" +
                "                name: \"孝义市\",\n" +
                "                code: \"141181\"\n" +
                "            }, {\n" +
                "                name: \"汾阳市\",\n" +
                "                code: \"141182\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"内蒙古自治区\",\n" +
                "        code: \"150000\",\n" +
                "        sub: [{\n" +
                "            name: \"呼和浩特市\",\n" +
                "            code: \"150100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"150101\"\n" +
                "            }, {\n" +
                "                name: \"新城区\",\n" +
                "                code: \"150102\"\n" +
                "            }, {\n" +
                "                name: \"回民区\",\n" +
                "                code: \"150103\"\n" +
                "            }, {\n" +
                "                name: \"玉泉区\",\n" +
                "                code: \"150104\"\n" +
                "            }, {\n" +
                "                name: \"赛罕区\",\n" +
                "                code: \"150105\"\n" +
                "            }, {\n" +
                "                name: \"土默特左旗\",\n" +
                "                code: \"150121\"\n" +
                "            }, {\n" +
                "                name: \"托克托县\",\n" +
                "                code: \"150122\"\n" +
                "            }, {\n" +
                "                name: \"和林格尔县\",\n" +
                "                code: \"150123\"\n" +
                "            }, {\n" +
                "                name: \"清水河县\",\n" +
                "                code: \"150124\"\n" +
                "            }, {\n" +
                "                name: \"武川县\",\n" +
                "                code: \"150125\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"包头市\",\n" +
                "            code: \"150200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"150201\"\n" +
                "            }, {\n" +
                "                name: \"东河区\",\n" +
                "                code: \"150202\"\n" +
                "            }, {\n" +
                "                name: \"昆都仑区\",\n" +
                "                code: \"150203\"\n" +
                "            }, {\n" +
                "                name: \"青山区\",\n" +
                "                code: \"150204\"\n" +
                "            }, {\n" +
                "                name: \"石拐区\",\n" +
                "                code: \"150205\"\n" +
                "            }, {\n" +
                "                name: \"白云鄂博矿区\",\n" +
                "                code: \"150206\"\n" +
                "            }, {\n" +
                "                name: \"九原区\",\n" +
                "                code: \"150207\"\n" +
                "            }, {\n" +
                "                name: \"土默特右旗\",\n" +
                "                code: \"150221\"\n" +
                "            }, {\n" +
                "                name: \"固阳县\",\n" +
                "                code: \"150222\"\n" +
                "            }, {\n" +
                "                name: \"达尔罕茂明安联合旗\",\n" +
                "                code: \"150223\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"乌海市\",\n" +
                "            code: \"150300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"150301\"\n" +
                "            }, {\n" +
                "                name: \"海勃湾区\",\n" +
                "                code: \"150302\"\n" +
                "            }, {\n" +
                "                name: \"海南区\",\n" +
                "                code: \"150303\"\n" +
                "            }, {\n" +
                "                name: \"乌达区\",\n" +
                "                code: \"150304\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"赤峰市\",\n" +
                "            code: \"150400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"150401\"\n" +
                "            }, {\n" +
                "                name: \"红山区\",\n" +
                "                code: \"150402\"\n" +
                "            }, {\n" +
                "                name: \"元宝山区\",\n" +
                "                code: \"150403\"\n" +
                "            }, {\n" +
                "                name: \"松山区\",\n" +
                "                code: \"150404\"\n" +
                "            }, {\n" +
                "                name: \"阿鲁科尔沁旗\",\n" +
                "                code: \"150421\"\n" +
                "            }, {\n" +
                "                name: \"巴林左旗\",\n" +
                "                code: \"150422\"\n" +
                "            }, {\n" +
                "                name: \"巴林右旗\",\n" +
                "                code: \"150423\"\n" +
                "            }, {\n" +
                "                name: \"林西县\",\n" +
                "                code: \"150424\"\n" +
                "            }, {\n" +
                "                name: \"克什克腾旗\",\n" +
                "                code: \"150425\"\n" +
                "            }, {\n" +
                "                name: \"翁牛特旗\",\n" +
                "                code: \"150426\"\n" +
                "            }, {\n" +
                "                name: \"喀喇沁旗\",\n" +
                "                code: \"150428\"\n" +
                "            }, {\n" +
                "                name: \"宁城县\",\n" +
                "                code: \"150429\"\n" +
                "            }, {\n" +
                "                name: \"敖汉旗\",\n" +
                "                code: \"150430\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"通辽市\",\n" +
                "            code: \"150500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"150501\"\n" +
                "            }, {\n" +
                "                name: \"科尔沁区\",\n" +
                "                code: \"150502\"\n" +
                "            }, {\n" +
                "                name: \"科尔沁左翼中旗\",\n" +
                "                code: \"150521\"\n" +
                "            }, {\n" +
                "                name: \"科尔沁左翼后旗\",\n" +
                "                code: \"150522\"\n" +
                "            }, {\n" +
                "                name: \"开鲁县\",\n" +
                "                code: \"150523\"\n" +
                "            }, {\n" +
                "                name: \"库伦旗\",\n" +
                "                code: \"150524\"\n" +
                "            }, {\n" +
                "                name: \"奈曼旗\",\n" +
                "                code: \"150525\"\n" +
                "            }, {\n" +
                "                name: \"扎鲁特旗\",\n" +
                "                code: \"150526\"\n" +
                "            }, {\n" +
                "                name: \"霍林郭勒市\",\n" +
                "                code: \"150581\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"鄂尔多斯市\",\n" +
                "            code: \"150600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"150601\"\n" +
                "            }, {\n" +
                "                name: \"东胜区\",\n" +
                "                code: \"150602\"\n" +
                "            }, {\n" +
                "                name: \"达拉特旗\",\n" +
                "                code: \"150621\"\n" +
                "            }, {\n" +
                "                name: \"准格尔旗\",\n" +
                "                code: \"150622\"\n" +
                "            }, {\n" +
                "                name: \"鄂托克前旗\",\n" +
                "                code: \"150623\"\n" +
                "            }, {\n" +
                "                name: \"鄂托克旗\",\n" +
                "                code: \"150624\"\n" +
                "            }, {\n" +
                "                name: \"杭锦旗\",\n" +
                "                code: \"150625\"\n" +
                "            }, {\n" +
                "                name: \"乌审旗\",\n" +
                "                code: \"150626\"\n" +
                "            }, {\n" +
                "                name: \"伊金霍洛旗\",\n" +
                "                code: \"150627\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"呼伦贝尔市\",\n" +
                "            code: \"150700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"150701\"\n" +
                "            }, {\n" +
                "                name: \"海拉尔区\",\n" +
                "                code: \"150702\"\n" +
                "            }, {\n" +
                "                name: \"扎赉诺尔区\",\n" +
                "                code: \"150703\"\n" +
                "            }, {\n" +
                "                name: \"阿荣旗\",\n" +
                "                code: \"150721\"\n" +
                "            }, {\n" +
                "                name: \"莫力达瓦达斡尔族自治旗\",\n" +
                "                code: \"150722\"\n" +
                "            }, {\n" +
                "                name: \"鄂伦春自治旗\",\n" +
                "                code: \"150723\"\n" +
                "            }, {\n" +
                "                name: \"鄂温克族自治旗\",\n" +
                "                code: \"150724\"\n" +
                "            }, {\n" +
                "                name: \"陈巴尔虎旗\",\n" +
                "                code: \"150725\"\n" +
                "            }, {\n" +
                "                name: \"新巴尔虎左旗\",\n" +
                "                code: \"150726\"\n" +
                "            }, {\n" +
                "                name: \"新巴尔虎右旗\",\n" +
                "                code: \"150727\"\n" +
                "            }, {\n" +
                "                name: \"满洲里市\",\n" +
                "                code: \"150781\"\n" +
                "            }, {\n" +
                "                name: \"牙克石市\",\n" +
                "                code: \"150782\"\n" +
                "            }, {\n" +
                "                name: \"扎兰屯市\",\n" +
                "                code: \"150783\"\n" +
                "            }, {\n" +
                "                name: \"额尔古纳市\",\n" +
                "                code: \"150784\"\n" +
                "            }, {\n" +
                "                name: \"根河市\",\n" +
                "                code: \"150785\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"巴彦淖尔市\",\n" +
                "            code: \"150800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"150801\"\n" +
                "            }, {\n" +
                "                name: \"临河区\",\n" +
                "                code: \"150802\"\n" +
                "            }, {\n" +
                "                name: \"五原县\",\n" +
                "                code: \"150821\"\n" +
                "            }, {\n" +
                "                name: \"磴口县\",\n" +
                "                code: \"150822\"\n" +
                "            }, {\n" +
                "                name: \"乌拉特前旗\",\n" +
                "                code: \"150823\"\n" +
                "            }, {\n" +
                "                name: \"乌拉特中旗\",\n" +
                "                code: \"150824\"\n" +
                "            }, {\n" +
                "                name: \"乌拉特后旗\",\n" +
                "                code: \"150825\"\n" +
                "            }, {\n" +
                "                name: \"杭锦后旗\",\n" +
                "                code: \"150826\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"乌兰察布市\",\n" +
                "            code: \"150900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"150901\"\n" +
                "            }, {\n" +
                "                name: \"集宁区\",\n" +
                "                code: \"150902\"\n" +
                "            }, {\n" +
                "                name: \"卓资县\",\n" +
                "                code: \"150921\"\n" +
                "            }, {\n" +
                "                name: \"化德县\",\n" +
                "                code: \"150922\"\n" +
                "            }, {\n" +
                "                name: \"商都县\",\n" +
                "                code: \"150923\"\n" +
                "            }, {\n" +
                "                name: \"兴和县\",\n" +
                "                code: \"150924\"\n" +
                "            }, {\n" +
                "                name: \"凉城县\",\n" +
                "                code: \"150925\"\n" +
                "            }, {\n" +
                "                name: \"察哈尔右翼前旗\",\n" +
                "                code: \"150926\"\n" +
                "            }, {\n" +
                "                name: \"察哈尔右翼中旗\",\n" +
                "                code: \"150927\"\n" +
                "            }, {\n" +
                "                name: \"察哈尔右翼后旗\",\n" +
                "                code: \"150928\"\n" +
                "            }, {\n" +
                "                name: \"四子王旗\",\n" +
                "                code: \"150929\"\n" +
                "            }, {\n" +
                "                name: \"丰镇市\",\n" +
                "                code: \"150981\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"兴安盟\",\n" +
                "            code: \"152200\",\n" +
                "            sub: [{\n" +
                "                name: \"乌兰浩特市\",\n" +
                "                code: \"152201\"\n" +
                "            }, {\n" +
                "                name: \"阿尔山市\",\n" +
                "                code: \"152202\"\n" +
                "            }, {\n" +
                "                name: \"科尔沁右翼前旗\",\n" +
                "                code: \"152221\"\n" +
                "            }, {\n" +
                "                name: \"科尔沁右翼中旗\",\n" +
                "                code: \"152222\"\n" +
                "            }, {\n" +
                "                name: \"扎赉特旗\",\n" +
                "                code: \"152223\"\n" +
                "            }, {\n" +
                "                name: \"突泉县\",\n" +
                "                code: \"152224\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"锡林郭勒盟\",\n" +
                "            code: \"152500\",\n" +
                "            sub: [{\n" +
                "                name: \"二连浩特市\",\n" +
                "                code: \"152501\"\n" +
                "            }, {\n" +
                "                name: \"锡林浩特市\",\n" +
                "                code: \"152502\"\n" +
                "            }, {\n" +
                "                name: \"阿巴嘎旗\",\n" +
                "                code: \"152522\"\n" +
                "            }, {\n" +
                "                name: \"苏尼特左旗\",\n" +
                "                code: \"152523\"\n" +
                "            }, {\n" +
                "                name: \"苏尼特右旗\",\n" +
                "                code: \"152524\"\n" +
                "            }, {\n" +
                "                name: \"东乌珠穆沁旗\",\n" +
                "                code: \"152525\"\n" +
                "            }, {\n" +
                "                name: \"西乌珠穆沁旗\",\n" +
                "                code: \"152526\"\n" +
                "            }, {\n" +
                "                name: \"太仆寺旗\",\n" +
                "                code: \"152527\"\n" +
                "            }, {\n" +
                "                name: \"镶黄旗\",\n" +
                "                code: \"152528\"\n" +
                "            }, {\n" +
                "                name: \"正镶白旗\",\n" +
                "                code: \"152529\"\n" +
                "            }, {\n" +
                "                name: \"正蓝旗\",\n" +
                "                code: \"152530\"\n" +
                "            }, {\n" +
                "                name: \"多伦县\",\n" +
                "                code: \"152531\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"阿拉善盟\",\n" +
                "            code: \"152900\",\n" +
                "            sub: [{\n" +
                "                name: \"阿拉善左旗\",\n" +
                "                code: \"152921\"\n" +
                "            }, {\n" +
                "                name: \"阿拉善右旗\",\n" +
                "                code: \"152922\"\n" +
                "            }, {\n" +
                "                name: \"额济纳旗\",\n" +
                "                code: \"152923\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"辽宁省\",\n" +
                "        code: \"210000\",\n" +
                "        sub: [{\n" +
                "            name: \"沈阳市\",\n" +
                "            code: \"210100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"210101\"\n" +
                "            }, {\n" +
                "                name: \"和平区\",\n" +
                "                code: \"210102\"\n" +
                "            }, {\n" +
                "                name: \"沈河区\",\n" +
                "                code: \"210103\"\n" +
                "            }, {\n" +
                "                name: \"大东区\",\n" +
                "                code: \"210104\"\n" +
                "            }, {\n" +
                "                name: \"皇姑区\",\n" +
                "                code: \"210105\"\n" +
                "            }, {\n" +
                "                name: \"铁西区\",\n" +
                "                code: \"210106\"\n" +
                "            }, {\n" +
                "                name: \"苏家屯区\",\n" +
                "                code: \"210111\"\n" +
                "            }, {\n" +
                "                name: \"浑南区\",\n" +
                "                code: \"210112\"\n" +
                "            }, {\n" +
                "                name: \"沈北新区\",\n" +
                "                code: \"210113\"\n" +
                "            }, {\n" +
                "                name: \"于洪区\",\n" +
                "                code: \"210114\"\n" +
                "            }, {\n" +
                "                name: \"辽中县\",\n" +
                "                code: \"210122\"\n" +
                "            }, {\n" +
                "                name: \"康平县\",\n" +
                "                code: \"210123\"\n" +
                "            }, {\n" +
                "                name: \"法库县\",\n" +
                "                code: \"210124\"\n" +
                "            }, {\n" +
                "                name: \"新民市\",\n" +
                "                code: \"210181\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"大连市\",\n" +
                "            code: \"210200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"210201\"\n" +
                "            }, {\n" +
                "                name: \"中山区\",\n" +
                "                code: \"210202\"\n" +
                "            }, {\n" +
                "                name: \"西岗区\",\n" +
                "                code: \"210203\"\n" +
                "            }, {\n" +
                "                name: \"沙河口区\",\n" +
                "                code: \"210204\"\n" +
                "            }, {\n" +
                "                name: \"甘井子区\",\n" +
                "                code: \"210211\"\n" +
                "            }, {\n" +
                "                name: \"旅顺口区\",\n" +
                "                code: \"210212\"\n" +
                "            }, {\n" +
                "                name: \"金州区\",\n" +
                "                code: \"210213\"\n" +
                "            }, {\n" +
                "                name: \"长海县\",\n" +
                "                code: \"210224\"\n" +
                "            }, {\n" +
                "                name: \"瓦房店市\",\n" +
                "                code: \"210281\"\n" +
                "            }, {\n" +
                "                name: \"普兰店市\",\n" +
                "                code: \"210282\"\n" +
                "            }, {\n" +
                "                name: \"庄河市\",\n" +
                "                code: \"210283\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"鞍山市\",\n" +
                "            code: \"210300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"210301\"\n" +
                "            }, {\n" +
                "                name: \"铁东区\",\n" +
                "                code: \"210302\"\n" +
                "            }, {\n" +
                "                name: \"铁西区\",\n" +
                "                code: \"210303\"\n" +
                "            }, {\n" +
                "                name: \"立山区\",\n" +
                "                code: \"210304\"\n" +
                "            }, {\n" +
                "                name: \"千山区\",\n" +
                "                code: \"210311\"\n" +
                "            }, {\n" +
                "                name: \"台安县\",\n" +
                "                code: \"210321\"\n" +
                "            }, {\n" +
                "                name: \"岫岩满族自治县\",\n" +
                "                code: \"210323\"\n" +
                "            }, {\n" +
                "                name: \"海城市\",\n" +
                "                code: \"210381\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"抚顺市\",\n" +
                "            code: \"210400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"210401\"\n" +
                "            }, {\n" +
                "                name: \"新抚区\",\n" +
                "                code: \"210402\"\n" +
                "            }, {\n" +
                "                name: \"东洲区\",\n" +
                "                code: \"210403\"\n" +
                "            }, {\n" +
                "                name: \"望花区\",\n" +
                "                code: \"210404\"\n" +
                "            }, {\n" +
                "                name: \"顺城区\",\n" +
                "                code: \"210411\"\n" +
                "            }, {\n" +
                "                name: \"抚顺县\",\n" +
                "                code: \"210421\"\n" +
                "            }, {\n" +
                "                name: \"新宾满族自治县\",\n" +
                "                code: \"210422\"\n" +
                "            }, {\n" +
                "                name: \"清原满族自治县\",\n" +
                "                code: \"210423\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"本溪市\",\n" +
                "            code: \"210500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"210501\"\n" +
                "            }, {\n" +
                "                name: \"平山区\",\n" +
                "                code: \"210502\"\n" +
                "            }, {\n" +
                "                name: \"溪湖区\",\n" +
                "                code: \"210503\"\n" +
                "            }, {\n" +
                "                name: \"明山区\",\n" +
                "                code: \"210504\"\n" +
                "            }, {\n" +
                "                name: \"南芬区\",\n" +
                "                code: \"210505\"\n" +
                "            }, {\n" +
                "                name: \"本溪满族自治县\",\n" +
                "                code: \"210521\"\n" +
                "            }, {\n" +
                "                name: \"桓仁满族自治县\",\n" +
                "                code: \"210522\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"丹东市\",\n" +
                "            code: \"210600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"210601\"\n" +
                "            }, {\n" +
                "                name: \"元宝区\",\n" +
                "                code: \"210602\"\n" +
                "            }, {\n" +
                "                name: \"振兴区\",\n" +
                "                code: \"210603\"\n" +
                "            }, {\n" +
                "                name: \"振安区\",\n" +
                "                code: \"210604\"\n" +
                "            }, {\n" +
                "                name: \"宽甸满族自治县\",\n" +
                "                code: \"210624\"\n" +
                "            }, {\n" +
                "                name: \"东港市\",\n" +
                "                code: \"210681\"\n" +
                "            }, {\n" +
                "                name: \"凤城市\",\n" +
                "                code: \"210682\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"锦州市\",\n" +
                "            code: \"210700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"210701\"\n" +
                "            }, {\n" +
                "                name: \"古塔区\",\n" +
                "                code: \"210702\"\n" +
                "            }, {\n" +
                "                name: \"凌河区\",\n" +
                "                code: \"210703\"\n" +
                "            }, {\n" +
                "                name: \"太和区\",\n" +
                "                code: \"210711\"\n" +
                "            }, {\n" +
                "                name: \"黑山县\",\n" +
                "                code: \"210726\"\n" +
                "            }, {\n" +
                "                name: \"义县\",\n" +
                "                code: \"210727\"\n" +
                "            }, {\n" +
                "                name: \"凌海市\",\n" +
                "                code: \"210781\"\n" +
                "            }, {\n" +
                "                name: \"北镇市\",\n" +
                "                code: \"210782\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"营口市\",\n" +
                "            code: \"210800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"210801\"\n" +
                "            }, {\n" +
                "                name: \"站前区\",\n" +
                "                code: \"210802\"\n" +
                "            }, {\n" +
                "                name: \"西市区\",\n" +
                "                code: \"210803\"\n" +
                "            }, {\n" +
                "                name: \"鲅鱼圈区\",\n" +
                "                code: \"210804\"\n" +
                "            }, {\n" +
                "                name: \"老边区\",\n" +
                "                code: \"210811\"\n" +
                "            }, {\n" +
                "                name: \"盖州市\",\n" +
                "                code: \"210881\"\n" +
                "            }, {\n" +
                "                name: \"大石桥市\",\n" +
                "                code: \"210882\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"阜新市\",\n" +
                "            code: \"210900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"210901\"\n" +
                "            }, {\n" +
                "                name: \"海州区\",\n" +
                "                code: \"210902\"\n" +
                "            }, {\n" +
                "                name: \"新邱区\",\n" +
                "                code: \"210903\"\n" +
                "            }, {\n" +
                "                name: \"太平区\",\n" +
                "                code: \"210904\"\n" +
                "            }, {\n" +
                "                name: \"清河门区\",\n" +
                "                code: \"210905\"\n" +
                "            }, {\n" +
                "                name: \"细河区\",\n" +
                "                code: \"210911\"\n" +
                "            }, {\n" +
                "                name: \"阜新蒙古族自治县\",\n" +
                "                code: \"210921\"\n" +
                "            }, {\n" +
                "                name: \"彰武县\",\n" +
                "                code: \"210922\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"辽阳市\",\n" +
                "            code: \"211000\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"211001\"\n" +
                "            }, {\n" +
                "                name: \"白塔区\",\n" +
                "                code: \"211002\"\n" +
                "            }, {\n" +
                "                name: \"文圣区\",\n" +
                "                code: \"211003\"\n" +
                "            }, {\n" +
                "                name: \"宏伟区\",\n" +
                "                code: \"211004\"\n" +
                "            }, {\n" +
                "                name: \"弓长岭区\",\n" +
                "                code: \"211005\"\n" +
                "            }, {\n" +
                "                name: \"太子河区\",\n" +
                "                code: \"211011\"\n" +
                "            }, {\n" +
                "                name: \"辽阳县\",\n" +
                "                code: \"211021\"\n" +
                "            }, {\n" +
                "                name: \"灯塔市\",\n" +
                "                code: \"211081\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"盘锦市\",\n" +
                "            code: \"211100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"211101\"\n" +
                "            }, {\n" +
                "                name: \"双台子区\",\n" +
                "                code: \"211102\"\n" +
                "            }, {\n" +
                "                name: \"兴隆台区\",\n" +
                "                code: \"211103\"\n" +
                "            }, {\n" +
                "                name: \"大洼县\",\n" +
                "                code: \"211121\"\n" +
                "            }, {\n" +
                "                name: \"盘山县\",\n" +
                "                code: \"211122\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"铁岭市\",\n" +
                "            code: \"211200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"211201\"\n" +
                "            }, {\n" +
                "                name: \"银州区\",\n" +
                "                code: \"211202\"\n" +
                "            }, {\n" +
                "                name: \"清河区\",\n" +
                "                code: \"211204\"\n" +
                "            }, {\n" +
                "                name: \"铁岭县\",\n" +
                "                code: \"211221\"\n" +
                "            }, {\n" +
                "                name: \"西丰县\",\n" +
                "                code: \"211223\"\n" +
                "            }, {\n" +
                "                name: \"昌图县\",\n" +
                "                code: \"211224\"\n" +
                "            }, {\n" +
                "                name: \"调兵山市\",\n" +
                "                code: \"211281\"\n" +
                "            }, {\n" +
                "                name: \"开原市\",\n" +
                "                code: \"211282\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"朝阳市\",\n" +
                "            code: \"211300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"211301\"\n" +
                "            }, {\n" +
                "                name: \"双塔区\",\n" +
                "                code: \"211302\"\n" +
                "            }, {\n" +
                "                name: \"龙城区\",\n" +
                "                code: \"211303\"\n" +
                "            }, {\n" +
                "                name: \"朝阳县\",\n" +
                "                code: \"211321\"\n" +
                "            }, {\n" +
                "                name: \"建平县\",\n" +
                "                code: \"211322\"\n" +
                "            }, {\n" +
                "                name: \"喀喇沁左翼蒙古族自治县\",\n" +
                "                code: \"211324\"\n" +
                "            }, {\n" +
                "                name: \"北票市\",\n" +
                "                code: \"211381\"\n" +
                "            }, {\n" +
                "                name: \"凌源市\",\n" +
                "                code: \"211382\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"葫芦岛市\",\n" +
                "            code: \"211400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"211401\"\n" +
                "            }, {\n" +
                "                name: \"连山区\",\n" +
                "                code: \"211402\"\n" +
                "            }, {\n" +
                "                name: \"龙港区\",\n" +
                "                code: \"211403\"\n" +
                "            }, {\n" +
                "                name: \"南票区\",\n" +
                "                code: \"211404\"\n" +
                "            }, {\n" +
                "                name: \"绥中县\",\n" +
                "                code: \"211421\"\n" +
                "            }, {\n" +
                "                name: \"建昌县\",\n" +
                "                code: \"211422\"\n" +
                "            }, {\n" +
                "                name: \"兴城市\",\n" +
                "                code: \"211481\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"吉林省\",\n" +
                "        code: \"220000\",\n" +
                "        sub: [{\n" +
                "            name: \"长春市\",\n" +
                "            code: \"220100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"220101\"\n" +
                "            }, {\n" +
                "                name: \"南关区\",\n" +
                "                code: \"220102\"\n" +
                "            }, {\n" +
                "                name: \"宽城区\",\n" +
                "                code: \"220103\"\n" +
                "            }, {\n" +
                "                name: \"朝阳区\",\n" +
                "                code: \"220104\"\n" +
                "            }, {\n" +
                "                name: \"二道区\",\n" +
                "                code: \"220105\"\n" +
                "            }, {\n" +
                "                name: \"绿园区\",\n" +
                "                code: \"220106\"\n" +
                "            }, {\n" +
                "                name: \"双阳区\",\n" +
                "                code: \"220112\"\n" +
                "            }, {\n" +
                "                name: \"九台区\",\n" +
                "                code: \"220113\"\n" +
                "            }, {\n" +
                "                name: \"农安县\",\n" +
                "                code: \"220122\"\n" +
                "            }, {\n" +
                "                name: \"榆树市\",\n" +
                "                code: \"220182\"\n" +
                "            }, {\n" +
                "                name: \"德惠市\",\n" +
                "                code: \"220183\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"吉林市\",\n" +
                "            code: \"220200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"220201\"\n" +
                "            }, {\n" +
                "                name: \"昌邑区\",\n" +
                "                code: \"220202\"\n" +
                "            }, {\n" +
                "                name: \"龙潭区\",\n" +
                "                code: \"220203\"\n" +
                "            }, {\n" +
                "                name: \"船营区\",\n" +
                "                code: \"220204\"\n" +
                "            }, {\n" +
                "                name: \"丰满区\",\n" +
                "                code: \"220211\"\n" +
                "            }, {\n" +
                "                name: \"永吉县\",\n" +
                "                code: \"220221\"\n" +
                "            }, {\n" +
                "                name: \"蛟河市\",\n" +
                "                code: \"220281\"\n" +
                "            }, {\n" +
                "                name: \"桦甸市\",\n" +
                "                code: \"220282\"\n" +
                "            }, {\n" +
                "                name: \"舒兰市\",\n" +
                "                code: \"220283\"\n" +
                "            }, {\n" +
                "                name: \"磐石市\",\n" +
                "                code: \"220284\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"四平市\",\n" +
                "            code: \"220300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"220301\"\n" +
                "            }, {\n" +
                "                name: \"铁西区\",\n" +
                "                code: \"220302\"\n" +
                "            }, {\n" +
                "                name: \"铁东区\",\n" +
                "                code: \"220303\"\n" +
                "            }, {\n" +
                "                name: \"梨树县\",\n" +
                "                code: \"220322\"\n" +
                "            }, {\n" +
                "                name: \"伊通满族自治县\",\n" +
                "                code: \"220323\"\n" +
                "            }, {\n" +
                "                name: \"公主岭市\",\n" +
                "                code: \"220381\"\n" +
                "            }, {\n" +
                "                name: \"双辽市\",\n" +
                "                code: \"220382\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"辽源市\",\n" +
                "            code: \"220400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"220401\"\n" +
                "            }, {\n" +
                "                name: \"龙山区\",\n" +
                "                code: \"220402\"\n" +
                "            }, {\n" +
                "                name: \"西安区\",\n" +
                "                code: \"220403\"\n" +
                "            }, {\n" +
                "                name: \"东丰县\",\n" +
                "                code: \"220421\"\n" +
                "            }, {\n" +
                "                name: \"东辽县\",\n" +
                "                code: \"220422\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"通化市\",\n" +
                "            code: \"220500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"220501\"\n" +
                "            }, {\n" +
                "                name: \"东昌区\",\n" +
                "                code: \"220502\"\n" +
                "            }, {\n" +
                "                name: \"二道江区\",\n" +
                "                code: \"220503\"\n" +
                "            }, {\n" +
                "                name: \"通化县\",\n" +
                "                code: \"220521\"\n" +
                "            }, {\n" +
                "                name: \"辉南县\",\n" +
                "                code: \"220523\"\n" +
                "            }, {\n" +
                "                name: \"柳河县\",\n" +
                "                code: \"220524\"\n" +
                "            }, {\n" +
                "                name: \"梅河口市\",\n" +
                "                code: \"220581\"\n" +
                "            }, {\n" +
                "                name: \"集安市\",\n" +
                "                code: \"220582\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"白山市\",\n" +
                "            code: \"220600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"220601\"\n" +
                "            }, {\n" +
                "                name: \"浑江区\",\n" +
                "                code: \"220602\"\n" +
                "            }, {\n" +
                "                name: \"江源区\",\n" +
                "                code: \"220605\"\n" +
                "            }, {\n" +
                "                name: \"抚松县\",\n" +
                "                code: \"220621\"\n" +
                "            }, {\n" +
                "                name: \"靖宇县\",\n" +
                "                code: \"220622\"\n" +
                "            }, {\n" +
                "                name: \"长白朝鲜族自治县\",\n" +
                "                code: \"220623\"\n" +
                "            }, {\n" +
                "                name: \"临江市\",\n" +
                "                code: \"220681\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"松原市\",\n" +
                "            code: \"220700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"220701\"\n" +
                "            }, {\n" +
                "                name: \"宁江区\",\n" +
                "                code: \"220702\"\n" +
                "            }, {\n" +
                "                name: \"前郭尔罗斯蒙古族自治县\",\n" +
                "                code: \"220721\"\n" +
                "            }, {\n" +
                "                name: \"长岭县\",\n" +
                "                code: \"220722\"\n" +
                "            }, {\n" +
                "                name: \"乾安县\",\n" +
                "                code: \"220723\"\n" +
                "            }, {\n" +
                "                name: \"扶余市\",\n" +
                "                code: \"220781\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"白城市\",\n" +
                "            code: \"220800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"220801\"\n" +
                "            }, {\n" +
                "                name: \"洮北区\",\n" +
                "                code: \"220802\"\n" +
                "            }, {\n" +
                "                name: \"镇赉县\",\n" +
                "                code: \"220821\"\n" +
                "            }, {\n" +
                "                name: \"通榆县\",\n" +
                "                code: \"220822\"\n" +
                "            }, {\n" +
                "                name: \"洮南市\",\n" +
                "                code: \"220881\"\n" +
                "            }, {\n" +
                "                name: \"大安市\",\n" +
                "                code: \"220882\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"延边朝鲜族自治州\",\n" +
                "            code: \"222400\",\n" +
                "            sub: [{\n" +
                "                name: \"延吉市\",\n" +
                "                code: \"222401\"\n" +
                "            }, {\n" +
                "                name: \"图们市\",\n" +
                "                code: \"222402\"\n" +
                "            }, {\n" +
                "                name: \"敦化市\",\n" +
                "                code: \"222403\"\n" +
                "            }, {\n" +
                "                name: \"珲春市\",\n" +
                "                code: \"222404\"\n" +
                "            }, {\n" +
                "                name: \"龙井市\",\n" +
                "                code: \"222405\"\n" +
                "            }, {\n" +
                "                name: \"和龙市\",\n" +
                "                code: \"222406\"\n" +
                "            }, {\n" +
                "                name: \"汪清县\",\n" +
                "                code: \"222424\"\n" +
                "            }, {\n" +
                "                name: \"安图县\",\n" +
                "                code: \"222426\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"黑龙江省\",\n" +
                "        code: \"230000\",\n" +
                "        sub: [{\n" +
                "            name: \"哈尔滨市\",\n" +
                "            code: \"230100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"230101\"\n" +
                "            }, {\n" +
                "                name: \"道里区\",\n" +
                "                code: \"230102\"\n" +
                "            }, {\n" +
                "                name: \"南岗区\",\n" +
                "                code: \"230103\"\n" +
                "            }, {\n" +
                "                name: \"道外区\",\n" +
                "                code: \"230104\"\n" +
                "            }, {\n" +
                "                name: \"平房区\",\n" +
                "                code: \"230108\"\n" +
                "            }, {\n" +
                "                name: \"松北区\",\n" +
                "                code: \"230109\"\n" +
                "            }, {\n" +
                "                name: \"香坊区\",\n" +
                "                code: \"230110\"\n" +
                "            }, {\n" +
                "                name: \"呼兰区\",\n" +
                "                code: \"230111\"\n" +
                "            }, {\n" +
                "                name: \"阿城区\",\n" +
                "                code: \"230112\"\n" +
                "            }, {\n" +
                "                name: \"双城区\",\n" +
                "                code: \"230113\"\n" +
                "            }, {\n" +
                "                name: \"依兰县\",\n" +
                "                code: \"230123\"\n" +
                "            }, {\n" +
                "                name: \"方正县\",\n" +
                "                code: \"230124\"\n" +
                "            }, {\n" +
                "                name: \"宾县\",\n" +
                "                code: \"230125\"\n" +
                "            }, {\n" +
                "                name: \"巴彦县\",\n" +
                "                code: \"230126\"\n" +
                "            }, {\n" +
                "                name: \"木兰县\",\n" +
                "                code: \"230127\"\n" +
                "            }, {\n" +
                "                name: \"通河县\",\n" +
                "                code: \"230128\"\n" +
                "            }, {\n" +
                "                name: \"延寿县\",\n" +
                "                code: \"230129\"\n" +
                "            }, {\n" +
                "                name: \"尚志市\",\n" +
                "                code: \"230183\"\n" +
                "            }, {\n" +
                "                name: \"五常市\",\n" +
                "                code: \"230184\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"齐齐哈尔市\",\n" +
                "            code: \"230200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"230201\"\n" +
                "            }, {\n" +
                "                name: \"龙沙区\",\n" +
                "                code: \"230202\"\n" +
                "            }, {\n" +
                "                name: \"建华区\",\n" +
                "                code: \"230203\"\n" +
                "            }, {\n" +
                "                name: \"铁锋区\",\n" +
                "                code: \"230204\"\n" +
                "            }, {\n" +
                "                name: \"昂昂溪区\",\n" +
                "                code: \"230205\"\n" +
                "            }, {\n" +
                "                name: \"富拉尔基区\",\n" +
                "                code: \"230206\"\n" +
                "            }, {\n" +
                "                name: \"碾子山区\",\n" +
                "                code: \"230207\"\n" +
                "            }, {\n" +
                "                name: \"梅里斯达斡尔族区\",\n" +
                "                code: \"230208\"\n" +
                "            }, {\n" +
                "                name: \"龙江县\",\n" +
                "                code: \"230221\"\n" +
                "            }, {\n" +
                "                name: \"依安县\",\n" +
                "                code: \"230223\"\n" +
                "            }, {\n" +
                "                name: \"泰来县\",\n" +
                "                code: \"230224\"\n" +
                "            }, {\n" +
                "                name: \"甘南县\",\n" +
                "                code: \"230225\"\n" +
                "            }, {\n" +
                "                name: \"富裕县\",\n" +
                "                code: \"230227\"\n" +
                "            }, {\n" +
                "                name: \"克山县\",\n" +
                "                code: \"230229\"\n" +
                "            }, {\n" +
                "                name: \"克东县\",\n" +
                "                code: \"230230\"\n" +
                "            }, {\n" +
                "                name: \"拜泉县\",\n" +
                "                code: \"230231\"\n" +
                "            }, {\n" +
                "                name: \"讷河市\",\n" +
                "                code: \"230281\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"鸡西市\",\n" +
                "            code: \"230300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"230301\"\n" +
                "            }, {\n" +
                "                name: \"鸡冠区\",\n" +
                "                code: \"230302\"\n" +
                "            }, {\n" +
                "                name: \"恒山区\",\n" +
                "                code: \"230303\"\n" +
                "            }, {\n" +
                "                name: \"滴道区\",\n" +
                "                code: \"230304\"\n" +
                "            }, {\n" +
                "                name: \"梨树区\",\n" +
                "                code: \"230305\"\n" +
                "            }, {\n" +
                "                name: \"城子河区\",\n" +
                "                code: \"230306\"\n" +
                "            }, {\n" +
                "                name: \"麻山区\",\n" +
                "                code: \"230307\"\n" +
                "            }, {\n" +
                "                name: \"鸡东县\",\n" +
                "                code: \"230321\"\n" +
                "            }, {\n" +
                "                name: \"虎林市\",\n" +
                "                code: \"230381\"\n" +
                "            }, {\n" +
                "                name: \"密山市\",\n" +
                "                code: \"230382\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"鹤岗市\",\n" +
                "            code: \"230400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"230401\"\n" +
                "            }, {\n" +
                "                name: \"向阳区\",\n" +
                "                code: \"230402\"\n" +
                "            }, {\n" +
                "                name: \"工农区\",\n" +
                "                code: \"230403\"\n" +
                "            }, {\n" +
                "                name: \"南山区\",\n" +
                "                code: \"230404\"\n" +
                "            }, {\n" +
                "                name: \"兴安区\",\n" +
                "                code: \"230405\"\n" +
                "            }, {\n" +
                "                name: \"东山区\",\n" +
                "                code: \"230406\"\n" +
                "            }, {\n" +
                "                name: \"兴山区\",\n" +
                "                code: \"230407\"\n" +
                "            }, {\n" +
                "                name: \"萝北县\",\n" +
                "                code: \"230421\"\n" +
                "            }, {\n" +
                "                name: \"绥滨县\",\n" +
                "                code: \"230422\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"双鸭山市\",\n" +
                "            code: \"230500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"230501\"\n" +
                "            }, {\n" +
                "                name: \"尖山区\",\n" +
                "                code: \"230502\"\n" +
                "            }, {\n" +
                "                name: \"岭东区\",\n" +
                "                code: \"230503\"\n" +
                "            }, {\n" +
                "                name: \"四方台区\",\n" +
                "                code: \"230505\"\n" +
                "            }, {\n" +
                "                name: \"宝山区\",\n" +
                "                code: \"230506\"\n" +
                "            }, {\n" +
                "                name: \"集贤县\",\n" +
                "                code: \"230521\"\n" +
                "            }, {\n" +
                "                name: \"友谊县\",\n" +
                "                code: \"230522\"\n" +
                "            }, {\n" +
                "                name: \"宝清县\",\n" +
                "                code: \"230523\"\n" +
                "            }, {\n" +
                "                name: \"饶河县\",\n" +
                "                code: \"230524\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"大庆市\",\n" +
                "            code: \"230600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"230601\"\n" +
                "            }, {\n" +
                "                name: \"萨尔图区\",\n" +
                "                code: \"230602\"\n" +
                "            }, {\n" +
                "                name: \"龙凤区\",\n" +
                "                code: \"230603\"\n" +
                "            }, {\n" +
                "                name: \"让胡路区\",\n" +
                "                code: \"230604\"\n" +
                "            }, {\n" +
                "                name: \"红岗区\",\n" +
                "                code: \"230605\"\n" +
                "            }, {\n" +
                "                name: \"大同区\",\n" +
                "                code: \"230606\"\n" +
                "            }, {\n" +
                "                name: \"肇州县\",\n" +
                "                code: \"230621\"\n" +
                "            }, {\n" +
                "                name: \"肇源县\",\n" +
                "                code: \"230622\"\n" +
                "            }, {\n" +
                "                name: \"林甸县\",\n" +
                "                code: \"230623\"\n" +
                "            }, {\n" +
                "                name: \"杜尔伯特蒙古族自治县\",\n" +
                "                code: \"230624\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"伊春市\",\n" +
                "            code: \"230700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"230701\"\n" +
                "            }, {\n" +
                "                name: \"伊春区\",\n" +
                "                code: \"230702\"\n" +
                "            }, {\n" +
                "                name: \"南岔区\",\n" +
                "                code: \"230703\"\n" +
                "            }, {\n" +
                "                name: \"友好区\",\n" +
                "                code: \"230704\"\n" +
                "            }, {\n" +
                "                name: \"西林区\",\n" +
                "                code: \"230705\"\n" +
                "            }, {\n" +
                "                name: \"翠峦区\",\n" +
                "                code: \"230706\"\n" +
                "            }, {\n" +
                "                name: \"新青区\",\n" +
                "                code: \"230707\"\n" +
                "            }, {\n" +
                "                name: \"美溪区\",\n" +
                "                code: \"230708\"\n" +
                "            }, {\n" +
                "                name: \"金山屯区\",\n" +
                "                code: \"230709\"\n" +
                "            }, {\n" +
                "                name: \"五营区\",\n" +
                "                code: \"230710\"\n" +
                "            }, {\n" +
                "                name: \"乌马河区\",\n" +
                "                code: \"230711\"\n" +
                "            }, {\n" +
                "                name: \"汤旺河区\",\n" +
                "                code: \"230712\"\n" +
                "            }, {\n" +
                "                name: \"带岭区\",\n" +
                "                code: \"230713\"\n" +
                "            }, {\n" +
                "                name: \"乌伊岭区\",\n" +
                "                code: \"230714\"\n" +
                "            }, {\n" +
                "                name: \"红星区\",\n" +
                "                code: \"230715\"\n" +
                "            }, {\n" +
                "                name: \"上甘岭区\",\n" +
                "                code: \"230716\"\n" +
                "            }, {\n" +
                "                name: \"嘉荫县\",\n" +
                "                code: \"230722\"\n" +
                "            }, {\n" +
                "                name: \"铁力市\",\n" +
                "                code: \"230781\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"佳木斯市\",\n" +
                "            code: \"230800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"230801\"\n" +
                "            }, {\n" +
                "                name: \"向阳区\",\n" +
                "                code: \"230803\"\n" +
                "            }, {\n" +
                "                name: \"前进区\",\n" +
                "                code: \"230804\"\n" +
                "            }, {\n" +
                "                name: \"东风区\",\n" +
                "                code: \"230805\"\n" +
                "            }, {\n" +
                "                name: \"郊区\",\n" +
                "                code: \"230811\"\n" +
                "            }, {\n" +
                "                name: \"桦南县\",\n" +
                "                code: \"230822\"\n" +
                "            }, {\n" +
                "                name: \"桦川县\",\n" +
                "                code: \"230826\"\n" +
                "            }, {\n" +
                "                name: \"汤原县\",\n" +
                "                code: \"230828\"\n" +
                "            }, {\n" +
                "                name: \"抚远县\",\n" +
                "                code: \"230833\"\n" +
                "            }, {\n" +
                "                name: \"同江市\",\n" +
                "                code: \"230881\"\n" +
                "            }, {\n" +
                "                name: \"富锦市\",\n" +
                "                code: \"230882\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"七台河市\",\n" +
                "            code: \"230900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"230901\"\n" +
                "            }, {\n" +
                "                name: \"新兴区\",\n" +
                "                code: \"230902\"\n" +
                "            }, {\n" +
                "                name: \"桃山区\",\n" +
                "                code: \"230903\"\n" +
                "            }, {\n" +
                "                name: \"茄子河区\",\n" +
                "                code: \"230904\"\n" +
                "            }, {\n" +
                "                name: \"勃利县\",\n" +
                "                code: \"230921\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"牡丹江市\",\n" +
                "            code: \"231000\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"231001\"\n" +
                "            }, {\n" +
                "                name: \"东安区\",\n" +
                "                code: \"231002\"\n" +
                "            }, {\n" +
                "                name: \"阳明区\",\n" +
                "                code: \"231003\"\n" +
                "            }, {\n" +
                "                name: \"爱民区\",\n" +
                "                code: \"231004\"\n" +
                "            }, {\n" +
                "                name: \"西安区\",\n" +
                "                code: \"231005\"\n" +
                "            }, {\n" +
                "                name: \"东宁县\",\n" +
                "                code: \"231024\"\n" +
                "            }, {\n" +
                "                name: \"林口县\",\n" +
                "                code: \"231025\"\n" +
                "            }, {\n" +
                "                name: \"绥芬河市\",\n" +
                "                code: \"231081\"\n" +
                "            }, {\n" +
                "                name: \"海林市\",\n" +
                "                code: \"231083\"\n" +
                "            }, {\n" +
                "                name: \"宁安市\",\n" +
                "                code: \"231084\"\n" +
                "            }, {\n" +
                "                name: \"穆棱市\",\n" +
                "                code: \"231085\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"黑河市\",\n" +
                "            code: \"231100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"231101\"\n" +
                "            }, {\n" +
                "                name: \"爱辉区\",\n" +
                "                code: \"231102\"\n" +
                "            }, {\n" +
                "                name: \"嫩江县\",\n" +
                "                code: \"231121\"\n" +
                "            }, {\n" +
                "                name: \"逊克县\",\n" +
                "                code: \"231123\"\n" +
                "            }, {\n" +
                "                name: \"孙吴县\",\n" +
                "                code: \"231124\"\n" +
                "            }, {\n" +
                "                name: \"北安市\",\n" +
                "                code: \"231181\"\n" +
                "            }, {\n" +
                "                name: \"五大连池市\",\n" +
                "                code: \"231182\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"绥化市\",\n" +
                "            code: \"231200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"231201\"\n" +
                "            }, {\n" +
                "                name: \"北林区\",\n" +
                "                code: \"231202\"\n" +
                "            }, {\n" +
                "                name: \"望奎县\",\n" +
                "                code: \"231221\"\n" +
                "            }, {\n" +
                "                name: \"兰西县\",\n" +
                "                code: \"231222\"\n" +
                "            }, {\n" +
                "                name: \"青冈县\",\n" +
                "                code: \"231223\"\n" +
                "            }, {\n" +
                "                name: \"庆安县\",\n" +
                "                code: \"231224\"\n" +
                "            }, {\n" +
                "                name: \"明水县\",\n" +
                "                code: \"231225\"\n" +
                "            }, {\n" +
                "                name: \"绥棱县\",\n" +
                "                code: \"231226\"\n" +
                "            }, {\n" +
                "                name: \"安达市\",\n" +
                "                code: \"231281\"\n" +
                "            }, {\n" +
                "                name: \"肇东市\",\n" +
                "                code: \"231282\"\n" +
                "            }, {\n" +
                "                name: \"海伦市\",\n" +
                "                code: \"231283\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"大兴安岭地区\",\n" +
                "            code: \"232700\",\n" +
                "            sub: [{\n" +
                "                name: \"呼玛县\",\n" +
                "                code: \"232721\"\n" +
                "            }, {\n" +
                "                name: \"塔河县\",\n" +
                "                code: \"232722\"\n" +
                "            }, {\n" +
                "                name: \"漠河县\",\n" +
                "                code: \"232723\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"上海\",\n" +
                "        code: \"310000\",\n" +
                "        sub: [{\n" +
                "            name: \"上海市\",\n" +
                "            code: \"310000\",\n" +
                "            sub: [{\n" +
                "                name: \"黄浦区\",\n" +
                "                code: \"310101\"\n" +
                "            }, {\n" +
                "                name: \"徐汇区\",\n" +
                "                code: \"310104\"\n" +
                "            }, {\n" +
                "                name: \"长宁区\",\n" +
                "                code: \"310105\"\n" +
                "            }, {\n" +
                "                name: \"静安区\",\n" +
                "                code: \"310106\"\n" +
                "            }, {\n" +
                "                name: \"普陀区\",\n" +
                "                code: \"310107\"\n" +
                "            }, {\n" +
                "                name: \"闸北区\",\n" +
                "                code: \"310108\"\n" +
                "            }, {\n" +
                "                name: \"虹口区\",\n" +
                "                code: \"310109\"\n" +
                "            }, {\n" +
                "                name: \"杨浦区\",\n" +
                "                code: \"310110\"\n" +
                "            }, {\n" +
                "                name: \"闵行区\",\n" +
                "                code: \"310112\"\n" +
                "            }, {\n" +
                "                name: \"宝山区\",\n" +
                "                code: \"310113\"\n" +
                "            }, {\n" +
                "                name: \"嘉定区\",\n" +
                "                code: \"310114\"\n" +
                "            }, {\n" +
                "                name: \"浦东新区\",\n" +
                "                code: \"310115\"\n" +
                "            }, {\n" +
                "                name: \"金山区\",\n" +
                "                code: \"310116\"\n" +
                "            }, {\n" +
                "                name: \"松江区\",\n" +
                "                code: \"310117\"\n" +
                "            }, {\n" +
                "                name: \"青浦区\",\n" +
                "                code: \"310118\"\n" +
                "            }, {\n" +
                "                name: \"奉贤区\",\n" +
                "                code: \"310120\"\n" +
                "            }, {\n" +
                "                name: \"崇明县\",\n" +
                "                code: \"310230\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"江苏省\",\n" +
                "        code: \"320000\",\n" +
                "        sub: [{\n" +
                "            name: \"南京市\",\n" +
                "            code: \"320100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"320101\"\n" +
                "            }, {\n" +
                "                name: \"玄武区\",\n" +
                "                code: \"320102\"\n" +
                "            }, {\n" +
                "                name: \"秦淮区\",\n" +
                "                code: \"320104\"\n" +
                "            }, {\n" +
                "                name: \"建邺区\",\n" +
                "                code: \"320105\"\n" +
                "            }, {\n" +
                "                name: \"鼓楼区\",\n" +
                "                code: \"320106\"\n" +
                "            }, {\n" +
                "                name: \"浦口区\",\n" +
                "                code: \"320111\"\n" +
                "            }, {\n" +
                "                name: \"栖霞区\",\n" +
                "                code: \"320113\"\n" +
                "            }, {\n" +
                "                name: \"雨花台区\",\n" +
                "                code: \"320114\"\n" +
                "            }, {\n" +
                "                name: \"江宁区\",\n" +
                "                code: \"320115\"\n" +
                "            }, {\n" +
                "                name: \"六合区\",\n" +
                "                code: \"320116\"\n" +
                "            }, {\n" +
                "                name: \"溧水区\",\n" +
                "                code: \"320117\"\n" +
                "            }, {\n" +
                "                name: \"高淳区\",\n" +
                "                code: \"320118\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"无锡市\",\n" +
                "            code: \"320200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"320201\"\n" +
                "            }, {\n" +
                "                name: \"崇安区\",\n" +
                "                code: \"320202\"\n" +
                "            }, {\n" +
                "                name: \"南长区\",\n" +
                "                code: \"320203\"\n" +
                "            }, {\n" +
                "                name: \"北塘区\",\n" +
                "                code: \"320204\"\n" +
                "            }, {\n" +
                "                name: \"锡山区\",\n" +
                "                code: \"320205\"\n" +
                "            }, {\n" +
                "                name: \"惠山区\",\n" +
                "                code: \"320206\"\n" +
                "            }, {\n" +
                "                name: \"滨湖区\",\n" +
                "                code: \"320211\"\n" +
                "            }, {\n" +
                "                name: \"江阴市\",\n" +
                "                code: \"320281\"\n" +
                "            }, {\n" +
                "                name: \"宜兴市\",\n" +
                "                code: \"320282\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"徐州市\",\n" +
                "            code: \"320300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"320301\"\n" +
                "            }, {\n" +
                "                name: \"鼓楼区\",\n" +
                "                code: \"320302\"\n" +
                "            }, {\n" +
                "                name: \"云龙区\",\n" +
                "                code: \"320303\"\n" +
                "            }, {\n" +
                "                name: \"贾汪区\",\n" +
                "                code: \"320305\"\n" +
                "            }, {\n" +
                "                name: \"泉山区\",\n" +
                "                code: \"320311\"\n" +
                "            }, {\n" +
                "                name: \"铜山区\",\n" +
                "                code: \"320312\"\n" +
                "            }, {\n" +
                "                name: \"丰县\",\n" +
                "                code: \"320321\"\n" +
                "            }, {\n" +
                "                name: \"沛县\",\n" +
                "                code: \"320322\"\n" +
                "            }, {\n" +
                "                name: \"睢宁县\",\n" +
                "                code: \"320324\"\n" +
                "            }, {\n" +
                "                name: \"新沂市\",\n" +
                "                code: \"320381\"\n" +
                "            }, {\n" +
                "                name: \"邳州市\",\n" +
                "                code: \"320382\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"常州市\",\n" +
                "            code: \"320400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"320401\"\n" +
                "            }, {\n" +
                "                name: \"天宁区\",\n" +
                "                code: \"320402\"\n" +
                "            }, {\n" +
                "                name: \"钟楼区\",\n" +
                "                code: \"320404\"\n" +
                "            }, {\n" +
                "                name: \"戚墅堰区\",\n" +
                "                code: \"320405\"\n" +
                "            }, {\n" +
                "                name: \"新北区\",\n" +
                "                code: \"320411\"\n" +
                "            }, {\n" +
                "                name: \"武进区\",\n" +
                "                code: \"320412\"\n" +
                "            }, {\n" +
                "                name: \"溧阳市\",\n" +
                "                code: \"320481\"\n" +
                "            }, {\n" +
                "                name: \"金坛市\",\n" +
                "                code: \"320482\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"苏州市\",\n" +
                "            code: \"320500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"320501\"\n" +
                "            }, {\n" +
                "                name: \"虎丘区\",\n" +
                "                code: \"320505\"\n" +
                "            }, {\n" +
                "                name: \"吴中区\",\n" +
                "                code: \"320506\"\n" +
                "            }, {\n" +
                "                name: \"相城区\",\n" +
                "                code: \"320507\"\n" +
                "            }, {\n" +
                "                name: \"姑苏区\",\n" +
                "                code: \"320508\"\n" +
                "            }, {\n" +
                "                name: \"吴江区\",\n" +
                "                code: \"320509\"\n" +
                "            }, {\n" +
                "                name: \"常熟市\",\n" +
                "                code: \"320581\"\n" +
                "            }, {\n" +
                "                name: \"张家港市\",\n" +
                "                code: \"320582\"\n" +
                "            }, {\n" +
                "                name: \"昆山市\",\n" +
                "                code: \"320583\"\n" +
                "            }, {\n" +
                "                name: \"太仓市\",\n" +
                "                code: \"320585\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"南通市\",\n" +
                "            code: \"320600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"320601\"\n" +
                "            }, {\n" +
                "                name: \"崇川区\",\n" +
                "                code: \"320602\"\n" +
                "            }, {\n" +
                "                name: \"港闸区\",\n" +
                "                code: \"320611\"\n" +
                "            }, {\n" +
                "                name: \"通州区\",\n" +
                "                code: \"320612\"\n" +
                "            }, {\n" +
                "                name: \"海安县\",\n" +
                "                code: \"320621\"\n" +
                "            }, {\n" +
                "                name: \"如东县\",\n" +
                "                code: \"320623\"\n" +
                "            }, {\n" +
                "                name: \"启东市\",\n" +
                "                code: \"320681\"\n" +
                "            }, {\n" +
                "                name: \"如皋市\",\n" +
                "                code: \"320682\"\n" +
                "            }, {\n" +
                "                name: \"海门市\",\n" +
                "                code: \"320684\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"连云港市\",\n" +
                "            code: \"320700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"320701\"\n" +
                "            }, {\n" +
                "                name: \"连云区\",\n" +
                "                code: \"320703\"\n" +
                "            }, {\n" +
                "                name: \"海州区\",\n" +
                "                code: \"320706\"\n" +
                "            }, {\n" +
                "                name: \"赣榆区\",\n" +
                "                code: \"320707\"\n" +
                "            }, {\n" +
                "                name: \"东海县\",\n" +
                "                code: \"320722\"\n" +
                "            }, {\n" +
                "                name: \"灌云县\",\n" +
                "                code: \"320723\"\n" +
                "            }, {\n" +
                "                name: \"灌南县\",\n" +
                "                code: \"320724\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"淮安市\",\n" +
                "            code: \"320800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"320801\"\n" +
                "            }, {\n" +
                "                name: \"清河区\",\n" +
                "                code: \"320802\"\n" +
                "            }, {\n" +
                "                name: \"淮安区\",\n" +
                "                code: \"320803\"\n" +
                "            }, {\n" +
                "                name: \"淮阴区\",\n" +
                "                code: \"320804\"\n" +
                "            }, {\n" +
                "                name: \"清浦区\",\n" +
                "                code: \"320811\"\n" +
                "            }, {\n" +
                "                name: \"涟水县\",\n" +
                "                code: \"320826\"\n" +
                "            }, {\n" +
                "                name: \"洪泽县\",\n" +
                "                code: \"320829\"\n" +
                "            }, {\n" +
                "                name: \"盱眙县\",\n" +
                "                code: \"320830\"\n" +
                "            }, {\n" +
                "                name: \"金湖县\",\n" +
                "                code: \"320831\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"盐城市\",\n" +
                "            code: \"320900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"320901\"\n" +
                "            }, {\n" +
                "                name: \"亭湖区\",\n" +
                "                code: \"320902\"\n" +
                "            }, {\n" +
                "                name: \"盐都区\",\n" +
                "                code: \"320903\"\n" +
                "            }, {\n" +
                "                name: \"响水县\",\n" +
                "                code: \"320921\"\n" +
                "            }, {\n" +
                "                name: \"滨海县\",\n" +
                "                code: \"320922\"\n" +
                "            }, {\n" +
                "                name: \"阜宁县\",\n" +
                "                code: \"320923\"\n" +
                "            }, {\n" +
                "                name: \"射阳县\",\n" +
                "                code: \"320924\"\n" +
                "            }, {\n" +
                "                name: \"建湖县\",\n" +
                "                code: \"320925\"\n" +
                "            }, {\n" +
                "                name: \"东台市\",\n" +
                "                code: \"320981\"\n" +
                "            }, {\n" +
                "                name: \"大丰市\",\n" +
                "                code: \"320982\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"扬州市\",\n" +
                "            code: \"321000\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"321001\"\n" +
                "            }, {\n" +
                "                name: \"广陵区\",\n" +
                "                code: \"321002\"\n" +
                "            }, {\n" +
                "                name: \"邗江区\",\n" +
                "                code: \"321003\"\n" +
                "            }, {\n" +
                "                name: \"江都区\",\n" +
                "                code: \"321012\"\n" +
                "            }, {\n" +
                "                name: \"宝应县\",\n" +
                "                code: \"321023\"\n" +
                "            }, {\n" +
                "                name: \"仪征市\",\n" +
                "                code: \"321081\"\n" +
                "            }, {\n" +
                "                name: \"高邮市\",\n" +
                "                code: \"321084\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"镇江市\",\n" +
                "            code: \"321100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"321101\"\n" +
                "            }, {\n" +
                "                name: \"京口区\",\n" +
                "                code: \"321102\"\n" +
                "            }, {\n" +
                "                name: \"润州区\",\n" +
                "                code: \"321111\"\n" +
                "            }, {\n" +
                "                name: \"丹徒区\",\n" +
                "                code: \"321112\"\n" +
                "            }, {\n" +
                "                name: \"丹阳市\",\n" +
                "                code: \"321181\"\n" +
                "            }, {\n" +
                "                name: \"扬中市\",\n" +
                "                code: \"321182\"\n" +
                "            }, {\n" +
                "                name: \"句容市\",\n" +
                "                code: \"321183\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"泰州市\",\n" +
                "            code: \"321200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"321201\"\n" +
                "            }, {\n" +
                "                name: \"海陵区\",\n" +
                "                code: \"321202\"\n" +
                "            }, {\n" +
                "                name: \"高港区\",\n" +
                "                code: \"321203\"\n" +
                "            }, {\n" +
                "                name: \"姜堰区\",\n" +
                "                code: \"321204\"\n" +
                "            }, {\n" +
                "                name: \"兴化市\",\n" +
                "                code: \"321281\"\n" +
                "            }, {\n" +
                "                name: \"靖江市\",\n" +
                "                code: \"321282\"\n" +
                "            }, {\n" +
                "                name: \"泰兴市\",\n" +
                "                code: \"321283\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"宿迁市\",\n" +
                "            code: \"321300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"321301\"\n" +
                "            }, {\n" +
                "                name: \"宿城区\",\n" +
                "                code: \"321302\"\n" +
                "            }, {\n" +
                "                name: \"宿豫区\",\n" +
                "                code: \"321311\"\n" +
                "            }, {\n" +
                "                name: \"沭阳县\",\n" +
                "                code: \"321322\"\n" +
                "            }, {\n" +
                "                name: \"泗阳县\",\n" +
                "                code: \"321323\"\n" +
                "            }, {\n" +
                "                name: \"泗洪县\",\n" +
                "                code: \"321324\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"浙江省\",\n" +
                "        code: \"330000\",\n" +
                "        sub: [{\n" +
                "            name: \"杭州市\",\n" +
                "            code: \"330100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"330101\"\n" +
                "            }, {\n" +
                "                name: \"上城区\",\n" +
                "                code: \"330102\"\n" +
                "            }, {\n" +
                "                name: \"下城区\",\n" +
                "                code: \"330103\"\n" +
                "            }, {\n" +
                "                name: \"江干区\",\n" +
                "                code: \"330104\"\n" +
                "            }, {\n" +
                "                name: \"拱墅区\",\n" +
                "                code: \"330105\"\n" +
                "            }, {\n" +
                "                name: \"西湖区\",\n" +
                "                code: \"330106\"\n" +
                "            }, {\n" +
                "                name: \"滨江区\",\n" +
                "                code: \"330108\"\n" +
                "            }, {\n" +
                "                name: \"萧山区\",\n" +
                "                code: \"330109\"\n" +
                "            }, {\n" +
                "                name: \"余杭区\",\n" +
                "                code: \"330110\"\n" +
                "            }, {\n" +
                "                name: \"富阳区\",\n" +
                "                code: \"330111\"\n" +
                "            }, {\n" +
                "                name: \"桐庐县\",\n" +
                "                code: \"330122\"\n" +
                "            }, {\n" +
                "                name: \"淳安县\",\n" +
                "                code: \"330127\"\n" +
                "            }, {\n" +
                "                name: \"建德市\",\n" +
                "                code: \"330182\"\n" +
                "            }, {\n" +
                "                name: \"临安市\",\n" +
                "                code: \"330185\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"宁波市\",\n" +
                "            code: \"330200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"330201\"\n" +
                "            }, {\n" +
                "                name: \"海曙区\",\n" +
                "                code: \"330203\"\n" +
                "            }, {\n" +
                "                name: \"江东区\",\n" +
                "                code: \"330204\"\n" +
                "            }, {\n" +
                "                name: \"江北区\",\n" +
                "                code: \"330205\"\n" +
                "            }, {\n" +
                "                name: \"北仑区\",\n" +
                "                code: \"330206\"\n" +
                "            }, {\n" +
                "                name: \"镇海区\",\n" +
                "                code: \"330211\"\n" +
                "            }, {\n" +
                "                name: \"鄞州区\",\n" +
                "                code: \"330212\"\n" +
                "            }, {\n" +
                "                name: \"象山县\",\n" +
                "                code: \"330225\"\n" +
                "            }, {\n" +
                "                name: \"宁海县\",\n" +
                "                code: \"330226\"\n" +
                "            }, {\n" +
                "                name: \"余姚市\",\n" +
                "                code: \"330281\"\n" +
                "            }, {\n" +
                "                name: \"慈溪市\",\n" +
                "                code: \"330282\"\n" +
                "            }, {\n" +
                "                name: \"奉化市\",\n" +
                "                code: \"330283\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"温州市\",\n" +
                "            code: \"330300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"330301\"\n" +
                "            }, {\n" +
                "                name: \"鹿城区\",\n" +
                "                code: \"330302\"\n" +
                "            }, {\n" +
                "                name: \"龙湾区\",\n" +
                "                code: \"330303\"\n" +
                "            }, {\n" +
                "                name: \"瓯海区\",\n" +
                "                code: \"330304\"\n" +
                "            }, {\n" +
                "                name: \"洞头县\",\n" +
                "                code: \"330322\"\n" +
                "            }, {\n" +
                "                name: \"永嘉县\",\n" +
                "                code: \"330324\"\n" +
                "            }, {\n" +
                "                name: \"平阳县\",\n" +
                "                code: \"330326\"\n" +
                "            }, {\n" +
                "                name: \"苍南县\",\n" +
                "                code: \"330327\"\n" +
                "            }, {\n" +
                "                name: \"文成县\",\n" +
                "                code: \"330328\"\n" +
                "            }, {\n" +
                "                name: \"泰顺县\",\n" +
                "                code: \"330329\"\n" +
                "            }, {\n" +
                "                name: \"瑞安市\",\n" +
                "                code: \"330381\"\n" +
                "            }, {\n" +
                "                name: \"乐清市\",\n" +
                "                code: \"330382\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"嘉兴市\",\n" +
                "            code: \"330400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"330401\"\n" +
                "            }, {\n" +
                "                name: \"南湖区\",\n" +
                "                code: \"330402\"\n" +
                "            }, {\n" +
                "                name: \"秀洲区\",\n" +
                "                code: \"330411\"\n" +
                "            }, {\n" +
                "                name: \"嘉善县\",\n" +
                "                code: \"330421\"\n" +
                "            }, {\n" +
                "                name: \"海盐县\",\n" +
                "                code: \"330424\"\n" +
                "            }, {\n" +
                "                name: \"海宁市\",\n" +
                "                code: \"330481\"\n" +
                "            }, {\n" +
                "                name: \"平湖市\",\n" +
                "                code: \"330482\"\n" +
                "            }, {\n" +
                "                name: \"桐乡市\",\n" +
                "                code: \"330483\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"湖州市\",\n" +
                "            code: \"330500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"330501\"\n" +
                "            }, {\n" +
                "                name: \"吴兴区\",\n" +
                "                code: \"330502\"\n" +
                "            }, {\n" +
                "                name: \"南浔区\",\n" +
                "                code: \"330503\"\n" +
                "            }, {\n" +
                "                name: \"德清县\",\n" +
                "                code: \"330521\"\n" +
                "            }, {\n" +
                "                name: \"长兴县\",\n" +
                "                code: \"330522\"\n" +
                "            }, {\n" +
                "                name: \"安吉县\",\n" +
                "                code: \"330523\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"绍兴市\",\n" +
                "            code: \"330600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"330601\"\n" +
                "            }, {\n" +
                "                name: \"越城区\",\n" +
                "                code: \"330602\"\n" +
                "            }, {\n" +
                "                name: \"柯桥区\",\n" +
                "                code: \"330603\"\n" +
                "            }, {\n" +
                "                name: \"上虞区\",\n" +
                "                code: \"330604\"\n" +
                "            }, {\n" +
                "                name: \"新昌县\",\n" +
                "                code: \"330624\"\n" +
                "            }, {\n" +
                "                name: \"诸暨市\",\n" +
                "                code: \"330681\"\n" +
                "            }, {\n" +
                "                name: \"嵊州市\",\n" +
                "                code: \"330683\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"金华市\",\n" +
                "            code: \"330700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"330701\"\n" +
                "            }, {\n" +
                "                name: \"婺城区\",\n" +
                "                code: \"330702\"\n" +
                "            }, {\n" +
                "                name: \"金东区\",\n" +
                "                code: \"330703\"\n" +
                "            }, {\n" +
                "                name: \"武义县\",\n" +
                "                code: \"330723\"\n" +
                "            }, {\n" +
                "                name: \"浦江县\",\n" +
                "                code: \"330726\"\n" +
                "            }, {\n" +
                "                name: \"磐安县\",\n" +
                "                code: \"330727\"\n" +
                "            }, {\n" +
                "                name: \"兰溪市\",\n" +
                "                code: \"330781\"\n" +
                "            }, {\n" +
                "                name: \"义乌市\",\n" +
                "                code: \"330782\"\n" +
                "            }, {\n" +
                "                name: \"东阳市\",\n" +
                "                code: \"330783\"\n" +
                "            }, {\n" +
                "                name: \"永康市\",\n" +
                "                code: \"330784\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"衢州市\",\n" +
                "            code: \"330800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"330801\"\n" +
                "            }, {\n" +
                "                name: \"柯城区\",\n" +
                "                code: \"330802\"\n" +
                "            }, {\n" +
                "                name: \"衢江区\",\n" +
                "                code: \"330803\"\n" +
                "            }, {\n" +
                "                name: \"常山县\",\n" +
                "                code: \"330822\"\n" +
                "            }, {\n" +
                "                name: \"开化县\",\n" +
                "                code: \"330824\"\n" +
                "            }, {\n" +
                "                name: \"龙游县\",\n" +
                "                code: \"330825\"\n" +
                "            }, {\n" +
                "                name: \"江山市\",\n" +
                "                code: \"330881\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"舟山市\",\n" +
                "            code: \"330900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"330901\"\n" +
                "            }, {\n" +
                "                name: \"定海区\",\n" +
                "                code: \"330902\"\n" +
                "            }, {\n" +
                "                name: \"普陀区\",\n" +
                "                code: \"330903\"\n" +
                "            }, {\n" +
                "                name: \"岱山县\",\n" +
                "                code: \"330921\"\n" +
                "            }, {\n" +
                "                name: \"嵊泗县\",\n" +
                "                code: \"330922\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"台州市\",\n" +
                "            code: \"331000\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"331001\"\n" +
                "            }, {\n" +
                "                name: \"椒江区\",\n" +
                "                code: \"331002\"\n" +
                "            }, {\n" +
                "                name: \"黄岩区\",\n" +
                "                code: \"331003\"\n" +
                "            }, {\n" +
                "                name: \"路桥区\",\n" +
                "                code: \"331004\"\n" +
                "            }, {\n" +
                "                name: \"玉环县\",\n" +
                "                code: \"331021\"\n" +
                "            }, {\n" +
                "                name: \"三门县\",\n" +
                "                code: \"331022\"\n" +
                "            }, {\n" +
                "                name: \"天台县\",\n" +
                "                code: \"331023\"\n" +
                "            }, {\n" +
                "                name: \"仙居县\",\n" +
                "                code: \"331024\"\n" +
                "            }, {\n" +
                "                name: \"温岭市\",\n" +
                "                code: \"331081\"\n" +
                "            }, {\n" +
                "                name: \"临海市\",\n" +
                "                code: \"331082\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"丽水市\",\n" +
                "            code: \"331100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"331101\"\n" +
                "            }, {\n" +
                "                name: \"莲都区\",\n" +
                "                code: \"331102\"\n" +
                "            }, {\n" +
                "                name: \"青田县\",\n" +
                "                code: \"331121\"\n" +
                "            }, {\n" +
                "                name: \"缙云县\",\n" +
                "                code: \"331122\"\n" +
                "            }, {\n" +
                "                name: \"遂昌县\",\n" +
                "                code: \"331123\"\n" +
                "            }, {\n" +
                "                name: \"松阳县\",\n" +
                "                code: \"331124\"\n" +
                "            }, {\n" +
                "                name: \"云和县\",\n" +
                "                code: \"331125\"\n" +
                "            }, {\n" +
                "                name: \"庆元县\",\n" +
                "                code: \"331126\"\n" +
                "            }, {\n" +
                "                name: \"景宁畲族自治县\",\n" +
                "                code: \"331127\"\n" +
                "            }, {\n" +
                "                name: \"龙泉市\",\n" +
                "                code: \"331181\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"安徽省\",\n" +
                "        code: \"340000\",\n" +
                "        sub: [{\n" +
                "            name: \"合肥市\",\n" +
                "            code: \"340100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"340101\"\n" +
                "            }, {\n" +
                "                name: \"瑶海区\",\n" +
                "                code: \"340102\"\n" +
                "            }, {\n" +
                "                name: \"庐阳区\",\n" +
                "                code: \"340103\"\n" +
                "            }, {\n" +
                "                name: \"蜀山区\",\n" +
                "                code: \"340104\"\n" +
                "            }, {\n" +
                "                name: \"包河区\",\n" +
                "                code: \"340111\"\n" +
                "            }, {\n" +
                "                name: \"长丰县\",\n" +
                "                code: \"340121\"\n" +
                "            }, {\n" +
                "                name: \"肥东县\",\n" +
                "                code: \"340122\"\n" +
                "            }, {\n" +
                "                name: \"肥西县\",\n" +
                "                code: \"340123\"\n" +
                "            }, {\n" +
                "                name: \"庐江县\",\n" +
                "                code: \"340124\"\n" +
                "            }, {\n" +
                "                name: \"巢湖市\",\n" +
                "                code: \"340181\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"芜湖市\",\n" +
                "            code: \"340200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"340201\"\n" +
                "            }, {\n" +
                "                name: \"镜湖区\",\n" +
                "                code: \"340202\"\n" +
                "            }, {\n" +
                "                name: \"弋江区\",\n" +
                "                code: \"340203\"\n" +
                "            }, {\n" +
                "                name: \"鸠江区\",\n" +
                "                code: \"340207\"\n" +
                "            }, {\n" +
                "                name: \"三山区\",\n" +
                "                code: \"340208\"\n" +
                "            }, {\n" +
                "                name: \"芜湖县\",\n" +
                "                code: \"340221\"\n" +
                "            }, {\n" +
                "                name: \"繁昌县\",\n" +
                "                code: \"340222\"\n" +
                "            }, {\n" +
                "                name: \"南陵县\",\n" +
                "                code: \"340223\"\n" +
                "            }, {\n" +
                "                name: \"无为县\",\n" +
                "                code: \"340225\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"蚌埠市\",\n" +
                "            code: \"340300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"340301\"\n" +
                "            }, {\n" +
                "                name: \"龙子湖区\",\n" +
                "                code: \"340302\"\n" +
                "            }, {\n" +
                "                name: \"蚌山区\",\n" +
                "                code: \"340303\"\n" +
                "            }, {\n" +
                "                name: \"禹会区\",\n" +
                "                code: \"340304\"\n" +
                "            }, {\n" +
                "                name: \"淮上区\",\n" +
                "                code: \"340311\"\n" +
                "            }, {\n" +
                "                name: \"怀远县\",\n" +
                "                code: \"340321\"\n" +
                "            }, {\n" +
                "                name: \"五河县\",\n" +
                "                code: \"340322\"\n" +
                "            }, {\n" +
                "                name: \"固镇县\",\n" +
                "                code: \"340323\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"淮南市\",\n" +
                "            code: \"340400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"340401\"\n" +
                "            }, {\n" +
                "                name: \"大通区\",\n" +
                "                code: \"340402\"\n" +
                "            }, {\n" +
                "                name: \"田家庵区\",\n" +
                "                code: \"340403\"\n" +
                "            }, {\n" +
                "                name: \"谢家集区\",\n" +
                "                code: \"340404\"\n" +
                "            }, {\n" +
                "                name: \"八公山区\",\n" +
                "                code: \"340405\"\n" +
                "            }, {\n" +
                "                name: \"潘集区\",\n" +
                "                code: \"340406\"\n" +
                "            }, {\n" +
                "                name: \"凤台县\",\n" +
                "                code: \"340421\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"马鞍山市\",\n" +
                "            code: \"340500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"340501\"\n" +
                "            }, {\n" +
                "                name: \"花山区\",\n" +
                "                code: \"340503\"\n" +
                "            }, {\n" +
                "                name: \"雨山区\",\n" +
                "                code: \"340504\"\n" +
                "            }, {\n" +
                "                name: \"博望区\",\n" +
                "                code: \"340506\"\n" +
                "            }, {\n" +
                "                name: \"当涂县\",\n" +
                "                code: \"340521\"\n" +
                "            }, {\n" +
                "                name: \"含山县\",\n" +
                "                code: \"340522\"\n" +
                "            }, {\n" +
                "                name: \"和县\",\n" +
                "                code: \"340523\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"淮北市\",\n" +
                "            code: \"340600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"340601\"\n" +
                "            }, {\n" +
                "                name: \"杜集区\",\n" +
                "                code: \"340602\"\n" +
                "            }, {\n" +
                "                name: \"相山区\",\n" +
                "                code: \"340603\"\n" +
                "            }, {\n" +
                "                name: \"烈山区\",\n" +
                "                code: \"340604\"\n" +
                "            }, {\n" +
                "                name: \"濉溪县\",\n" +
                "                code: \"340621\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"铜陵市\",\n" +
                "            code: \"340700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"340701\"\n" +
                "            }, {\n" +
                "                name: \"铜官山区\",\n" +
                "                code: \"340702\"\n" +
                "            }, {\n" +
                "                name: \"狮子山区\",\n" +
                "                code: \"340703\"\n" +
                "            }, {\n" +
                "                name: \"郊区\",\n" +
                "                code: \"340711\"\n" +
                "            }, {\n" +
                "                name: \"铜陵县\",\n" +
                "                code: \"340721\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"安庆市\",\n" +
                "            code: \"340800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"340801\"\n" +
                "            }, {\n" +
                "                name: \"迎江区\",\n" +
                "                code: \"340802\"\n" +
                "            }, {\n" +
                "                name: \"大观区\",\n" +
                "                code: \"340803\"\n" +
                "            }, {\n" +
                "                name: \"宜秀区\",\n" +
                "                code: \"340811\"\n" +
                "            }, {\n" +
                "                name: \"怀宁县\",\n" +
                "                code: \"340822\"\n" +
                "            }, {\n" +
                "                name: \"枞阳县\",\n" +
                "                code: \"340823\"\n" +
                "            }, {\n" +
                "                name: \"潜山县\",\n" +
                "                code: \"340824\"\n" +
                "            }, {\n" +
                "                name: \"太湖县\",\n" +
                "                code: \"340825\"\n" +
                "            }, {\n" +
                "                name: \"宿松县\",\n" +
                "                code: \"340826\"\n" +
                "            }, {\n" +
                "                name: \"望江县\",\n" +
                "                code: \"340827\"\n" +
                "            }, {\n" +
                "                name: \"岳西县\",\n" +
                "                code: \"340828\"\n" +
                "            }, {\n" +
                "                name: \"桐城市\",\n" +
                "                code: \"340881\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"黄山市\",\n" +
                "            code: \"341000\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"341001\"\n" +
                "            }, {\n" +
                "                name: \"屯溪区\",\n" +
                "                code: \"341002\"\n" +
                "            }, {\n" +
                "                name: \"黄山区\",\n" +
                "                code: \"341003\"\n" +
                "            }, {\n" +
                "                name: \"徽州区\",\n" +
                "                code: \"341004\"\n" +
                "            }, {\n" +
                "                name: \"歙县\",\n" +
                "                code: \"341021\"\n" +
                "            }, {\n" +
                "                name: \"休宁县\",\n" +
                "                code: \"341022\"\n" +
                "            }, {\n" +
                "                name: \"黟县\",\n" +
                "                code: \"341023\"\n" +
                "            }, {\n" +
                "                name: \"祁门县\",\n" +
                "                code: \"341024\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"滁州市\",\n" +
                "            code: \"341100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"341101\"\n" +
                "            }, {\n" +
                "                name: \"琅琊区\",\n" +
                "                code: \"341102\"\n" +
                "            }, {\n" +
                "                name: \"南谯区\",\n" +
                "                code: \"341103\"\n" +
                "            }, {\n" +
                "                name: \"来安县\",\n" +
                "                code: \"341122\"\n" +
                "            }, {\n" +
                "                name: \"全椒县\",\n" +
                "                code: \"341124\"\n" +
                "            }, {\n" +
                "                name: \"定远县\",\n" +
                "                code: \"341125\"\n" +
                "            }, {\n" +
                "                name: \"凤阳县\",\n" +
                "                code: \"341126\"\n" +
                "            }, {\n" +
                "                name: \"天长市\",\n" +
                "                code: \"341181\"\n" +
                "            }, {\n" +
                "                name: \"明光市\",\n" +
                "                code: \"341182\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"阜阳市\",\n" +
                "            code: \"341200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"341201\"\n" +
                "            }, {\n" +
                "                name: \"颍州区\",\n" +
                "                code: \"341202\"\n" +
                "            }, {\n" +
                "                name: \"颍东区\",\n" +
                "                code: \"341203\"\n" +
                "            }, {\n" +
                "                name: \"颍泉区\",\n" +
                "                code: \"341204\"\n" +
                "            }, {\n" +
                "                name: \"临泉县\",\n" +
                "                code: \"341221\"\n" +
                "            }, {\n" +
                "                name: \"太和县\",\n" +
                "                code: \"341222\"\n" +
                "            }, {\n" +
                "                name: \"阜南县\",\n" +
                "                code: \"341225\"\n" +
                "            }, {\n" +
                "                name: \"颍上县\",\n" +
                "                code: \"341226\"\n" +
                "            }, {\n" +
                "                name: \"界首市\",\n" +
                "                code: \"341282\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"宿州市\",\n" +
                "            code: \"341300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"341301\"\n" +
                "            }, {\n" +
                "                name: \"埇桥区\",\n" +
                "                code: \"341302\"\n" +
                "            }, {\n" +
                "                name: \"砀山县\",\n" +
                "                code: \"341321\"\n" +
                "            }, {\n" +
                "                name: \"萧县\",\n" +
                "                code: \"341322\"\n" +
                "            }, {\n" +
                "                name: \"灵璧县\",\n" +
                "                code: \"341323\"\n" +
                "            }, {\n" +
                "                name: \"泗县\",\n" +
                "                code: \"341324\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"六安市\",\n" +
                "            code: \"341500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"341501\"\n" +
                "            }, {\n" +
                "                name: \"金安区\",\n" +
                "                code: \"341502\"\n" +
                "            }, {\n" +
                "                name: \"裕安区\",\n" +
                "                code: \"341503\"\n" +
                "            }, {\n" +
                "                name: \"寿县\",\n" +
                "                code: \"341521\"\n" +
                "            }, {\n" +
                "                name: \"霍邱县\",\n" +
                "                code: \"341522\"\n" +
                "            }, {\n" +
                "                name: \"舒城县\",\n" +
                "                code: \"341523\"\n" +
                "            }, {\n" +
                "                name: \"金寨县\",\n" +
                "                code: \"341524\"\n" +
                "            }, {\n" +
                "                name: \"霍山县\",\n" +
                "                code: \"341525\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"亳州市\",\n" +
                "            code: \"341600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"341601\"\n" +
                "            }, {\n" +
                "                name: \"谯城区\",\n" +
                "                code: \"341602\"\n" +
                "            }, {\n" +
                "                name: \"涡阳县\",\n" +
                "                code: \"341621\"\n" +
                "            }, {\n" +
                "                name: \"蒙城县\",\n" +
                "                code: \"341622\"\n" +
                "            }, {\n" +
                "                name: \"利辛县\",\n" +
                "                code: \"341623\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"池州市\",\n" +
                "            code: \"341700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"341701\"\n" +
                "            }, {\n" +
                "                name: \"贵池区\",\n" +
                "                code: \"341702\"\n" +
                "            }, {\n" +
                "                name: \"东至县\",\n" +
                "                code: \"341721\"\n" +
                "            }, {\n" +
                "                name: \"石台县\",\n" +
                "                code: \"341722\"\n" +
                "            }, {\n" +
                "                name: \"青阳县\",\n" +
                "                code: \"341723\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"宣城市\",\n" +
                "            code: \"341800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"341801\"\n" +
                "            }, {\n" +
                "                name: \"宣州区\",\n" +
                "                code: \"341802\"\n" +
                "            }, {\n" +
                "                name: \"郎溪县\",\n" +
                "                code: \"341821\"\n" +
                "            }, {\n" +
                "                name: \"广德县\",\n" +
                "                code: \"341822\"\n" +
                "            }, {\n" +
                "                name: \"泾县\",\n" +
                "                code: \"341823\"\n" +
                "            }, {\n" +
                "                name: \"绩溪县\",\n" +
                "                code: \"341824\"\n" +
                "            }, {\n" +
                "                name: \"旌德县\",\n" +
                "                code: \"341825\"\n" +
                "            }, {\n" +
                "                name: \"宁国市\",\n" +
                "                code: \"341881\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"福建省\",\n" +
                "        code: \"350000\",\n" +
                "        sub: [{\n" +
                "            name: \"福州市\",\n" +
                "            code: \"350100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"350101\"\n" +
                "            }, {\n" +
                "                name: \"鼓楼区\",\n" +
                "                code: \"350102\"\n" +
                "            }, {\n" +
                "                name: \"台江区\",\n" +
                "                code: \"350103\"\n" +
                "            }, {\n" +
                "                name: \"仓山区\",\n" +
                "                code: \"350104\"\n" +
                "            }, {\n" +
                "                name: \"马尾区\",\n" +
                "                code: \"350105\"\n" +
                "            }, {\n" +
                "                name: \"晋安区\",\n" +
                "                code: \"350111\"\n" +
                "            }, {\n" +
                "                name: \"闽侯县\",\n" +
                "                code: \"350121\"\n" +
                "            }, {\n" +
                "                name: \"连江县\",\n" +
                "                code: \"350122\"\n" +
                "            }, {\n" +
                "                name: \"罗源县\",\n" +
                "                code: \"350123\"\n" +
                "            }, {\n" +
                "                name: \"闽清县\",\n" +
                "                code: \"350124\"\n" +
                "            }, {\n" +
                "                name: \"永泰县\",\n" +
                "                code: \"350125\"\n" +
                "            }, {\n" +
                "                name: \"平潭县\",\n" +
                "                code: \"350128\"\n" +
                "            }, {\n" +
                "                name: \"福清市\",\n" +
                "                code: \"350181\"\n" +
                "            }, {\n" +
                "                name: \"长乐市\",\n" +
                "                code: \"350182\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"厦门市\",\n" +
                "            code: \"350200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"350201\"\n" +
                "            }, {\n" +
                "                name: \"思明区\",\n" +
                "                code: \"350203\"\n" +
                "            }, {\n" +
                "                name: \"海沧区\",\n" +
                "                code: \"350205\"\n" +
                "            }, {\n" +
                "                name: \"湖里区\",\n" +
                "                code: \"350206\"\n" +
                "            }, {\n" +
                "                name: \"集美区\",\n" +
                "                code: \"350211\"\n" +
                "            }, {\n" +
                "                name: \"同安区\",\n" +
                "                code: \"350212\"\n" +
                "            }, {\n" +
                "                name: \"翔安区\",\n" +
                "                code: \"350213\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"莆田市\",\n" +
                "            code: \"350300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"350301\"\n" +
                "            }, {\n" +
                "                name: \"城厢区\",\n" +
                "                code: \"350302\"\n" +
                "            }, {\n" +
                "                name: \"涵江区\",\n" +
                "                code: \"350303\"\n" +
                "            }, {\n" +
                "                name: \"荔城区\",\n" +
                "                code: \"350304\"\n" +
                "            }, {\n" +
                "                name: \"秀屿区\",\n" +
                "                code: \"350305\"\n" +
                "            }, {\n" +
                "                name: \"仙游县\",\n" +
                "                code: \"350322\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"三明市\",\n" +
                "            code: \"350400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"350401\"\n" +
                "            }, {\n" +
                "                name: \"梅列区\",\n" +
                "                code: \"350402\"\n" +
                "            }, {\n" +
                "                name: \"三元区\",\n" +
                "                code: \"350403\"\n" +
                "            }, {\n" +
                "                name: \"明溪县\",\n" +
                "                code: \"350421\"\n" +
                "            }, {\n" +
                "                name: \"清流县\",\n" +
                "                code: \"350423\"\n" +
                "            }, {\n" +
                "                name: \"宁化县\",\n" +
                "                code: \"350424\"\n" +
                "            }, {\n" +
                "                name: \"大田县\",\n" +
                "                code: \"350425\"\n" +
                "            }, {\n" +
                "                name: \"尤溪县\",\n" +
                "                code: \"350426\"\n" +
                "            }, {\n" +
                "                name: \"沙县\",\n" +
                "                code: \"350427\"\n" +
                "            }, {\n" +
                "                name: \"将乐县\",\n" +
                "                code: \"350428\"\n" +
                "            }, {\n" +
                "                name: \"泰宁县\",\n" +
                "                code: \"350429\"\n" +
                "            }, {\n" +
                "                name: \"建宁县\",\n" +
                "                code: \"350430\"\n" +
                "            }, {\n" +
                "                name: \"永安市\",\n" +
                "                code: \"350481\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"泉州市\",\n" +
                "            code: \"350500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"350501\"\n" +
                "            }, {\n" +
                "                name: \"鲤城区\",\n" +
                "                code: \"350502\"\n" +
                "            }, {\n" +
                "                name: \"丰泽区\",\n" +
                "                code: \"350503\"\n" +
                "            }, {\n" +
                "                name: \"洛江区\",\n" +
                "                code: \"350504\"\n" +
                "            }, {\n" +
                "                name: \"泉港区\",\n" +
                "                code: \"350505\"\n" +
                "            }, {\n" +
                "                name: \"惠安县\",\n" +
                "                code: \"350521\"\n" +
                "            }, {\n" +
                "                name: \"安溪县\",\n" +
                "                code: \"350524\"\n" +
                "            }, {\n" +
                "                name: \"永春县\",\n" +
                "                code: \"350525\"\n" +
                "            }, {\n" +
                "                name: \"德化县\",\n" +
                "                code: \"350526\"\n" +
                "            }, {\n" +
                "                name: \"金门县\",\n" +
                "                code: \"350527\"\n" +
                "            }, {\n" +
                "                name: \"石狮市\",\n" +
                "                code: \"350581\"\n" +
                "            }, {\n" +
                "                name: \"晋江市\",\n" +
                "                code: \"350582\"\n" +
                "            }, {\n" +
                "                name: \"南安市\",\n" +
                "                code: \"350583\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"漳州市\",\n" +
                "            code: \"350600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"350601\"\n" +
                "            }, {\n" +
                "                name: \"芗城区\",\n" +
                "                code: \"350602\"\n" +
                "            }, {\n" +
                "                name: \"龙文区\",\n" +
                "                code: \"350603\"\n" +
                "            }, {\n" +
                "                name: \"云霄县\",\n" +
                "                code: \"350622\"\n" +
                "            }, {\n" +
                "                name: \"漳浦县\",\n" +
                "                code: \"350623\"\n" +
                "            }, {\n" +
                "                name: \"诏安县\",\n" +
                "                code: \"350624\"\n" +
                "            }, {\n" +
                "                name: \"长泰县\",\n" +
                "                code: \"350625\"\n" +
                "            }, {\n" +
                "                name: \"东山县\",\n" +
                "                code: \"350626\"\n" +
                "            }, {\n" +
                "                name: \"南靖县\",\n" +
                "                code: \"350627\"\n" +
                "            }, {\n" +
                "                name: \"平和县\",\n" +
                "                code: \"350628\"\n" +
                "            }, {\n" +
                "                name: \"华安县\",\n" +
                "                code: \"350629\"\n" +
                "            }, {\n" +
                "                name: \"龙海市\",\n" +
                "                code: \"350681\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"南平市\",\n" +
                "            code: \"350700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"350701\"\n" +
                "            }, {\n" +
                "                name: \"延平区\",\n" +
                "                code: \"350702\"\n" +
                "            }, {\n" +
                "                name: \"建阳区\",\n" +
                "                code: \"350703\"\n" +
                "            }, {\n" +
                "                name: \"顺昌县\",\n" +
                "                code: \"350721\"\n" +
                "            }, {\n" +
                "                name: \"浦城县\",\n" +
                "                code: \"350722\"\n" +
                "            }, {\n" +
                "                name: \"光泽县\",\n" +
                "                code: \"350723\"\n" +
                "            }, {\n" +
                "                name: \"松溪县\",\n" +
                "                code: \"350724\"\n" +
                "            }, {\n" +
                "                name: \"政和县\",\n" +
                "                code: \"350725\"\n" +
                "            }, {\n" +
                "                name: \"邵武市\",\n" +
                "                code: \"350781\"\n" +
                "            }, {\n" +
                "                name: \"武夷山市\",\n" +
                "                code: \"350782\"\n" +
                "            }, {\n" +
                "                name: \"建瓯市\",\n" +
                "                code: \"350783\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"龙岩市\",\n" +
                "            code: \"350800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"350801\"\n" +
                "            }, {\n" +
                "                name: \"新罗区\",\n" +
                "                code: \"350802\"\n" +
                "            }, {\n" +
                "                name: \"永定区\",\n" +
                "                code: \"350803\"\n" +
                "            }, {\n" +
                "                name: \"长汀县\",\n" +
                "                code: \"350821\"\n" +
                "            }, {\n" +
                "                name: \"上杭县\",\n" +
                "                code: \"350823\"\n" +
                "            }, {\n" +
                "                name: \"武平县\",\n" +
                "                code: \"350824\"\n" +
                "            }, {\n" +
                "                name: \"连城县\",\n" +
                "                code: \"350825\"\n" +
                "            }, {\n" +
                "                name: \"漳平市\",\n" +
                "                code: \"350881\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"宁德市\",\n" +
                "            code: \"350900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"350901\"\n" +
                "            }, {\n" +
                "                name: \"蕉城区\",\n" +
                "                code: \"350902\"\n" +
                "            }, {\n" +
                "                name: \"霞浦县\",\n" +
                "                code: \"350921\"\n" +
                "            }, {\n" +
                "                name: \"古田县\",\n" +
                "                code: \"350922\"\n" +
                "            }, {\n" +
                "                name: \"屏南县\",\n" +
                "                code: \"350923\"\n" +
                "            }, {\n" +
                "                name: \"寿宁县\",\n" +
                "                code: \"350924\"\n" +
                "            }, {\n" +
                "                name: \"周宁县\",\n" +
                "                code: \"350925\"\n" +
                "            }, {\n" +
                "                name: \"柘荣县\",\n" +
                "                code: \"350926\"\n" +
                "            }, {\n" +
                "                name: \"福安市\",\n" +
                "                code: \"350981\"\n" +
                "            }, {\n" +
                "                name: \"福鼎市\",\n" +
                "                code: \"350982\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"江西省\",\n" +
                "        code: \"360000\",\n" +
                "        sub: [{\n" +
                "            name: \"南昌市\",\n" +
                "            code: \"360100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"360101\"\n" +
                "            }, {\n" +
                "                name: \"东湖区\",\n" +
                "                code: \"360102\"\n" +
                "            }, {\n" +
                "                name: \"西湖区\",\n" +
                "                code: \"360103\"\n" +
                "            }, {\n" +
                "                name: \"青云谱区\",\n" +
                "                code: \"360104\"\n" +
                "            }, {\n" +
                "                name: \"湾里区\",\n" +
                "                code: \"360105\"\n" +
                "            }, {\n" +
                "                name: \"青山湖区\",\n" +
                "                code: \"360111\"\n" +
                "            }, {\n" +
                "                name: \"南昌县\",\n" +
                "                code: \"360121\"\n" +
                "            }, {\n" +
                "                name: \"新建县\",\n" +
                "                code: \"360122\"\n" +
                "            }, {\n" +
                "                name: \"安义县\",\n" +
                "                code: \"360123\"\n" +
                "            }, {\n" +
                "                name: \"进贤县\",\n" +
                "                code: \"360124\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"景德镇市\",\n" +
                "            code: \"360200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"360201\"\n" +
                "            }, {\n" +
                "                name: \"昌江区\",\n" +
                "                code: \"360202\"\n" +
                "            }, {\n" +
                "                name: \"珠山区\",\n" +
                "                code: \"360203\"\n" +
                "            }, {\n" +
                "                name: \"浮梁县\",\n" +
                "                code: \"360222\"\n" +
                "            }, {\n" +
                "                name: \"乐平市\",\n" +
                "                code: \"360281\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"萍乡市\",\n" +
                "            code: \"360300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"360301\"\n" +
                "            }, {\n" +
                "                name: \"安源区\",\n" +
                "                code: \"360302\"\n" +
                "            }, {\n" +
                "                name: \"湘东区\",\n" +
                "                code: \"360313\"\n" +
                "            }, {\n" +
                "                name: \"莲花县\",\n" +
                "                code: \"360321\"\n" +
                "            }, {\n" +
                "                name: \"上栗县\",\n" +
                "                code: \"360322\"\n" +
                "            }, {\n" +
                "                name: \"芦溪县\",\n" +
                "                code: \"360323\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"九江市\",\n" +
                "            code: \"360400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"360401\"\n" +
                "            }, {\n" +
                "                name: \"庐山区\",\n" +
                "                code: \"360402\"\n" +
                "            }, {\n" +
                "                name: \"浔阳区\",\n" +
                "                code: \"360403\"\n" +
                "            }, {\n" +
                "                name: \"九江县\",\n" +
                "                code: \"360421\"\n" +
                "            }, {\n" +
                "                name: \"武宁县\",\n" +
                "                code: \"360423\"\n" +
                "            }, {\n" +
                "                name: \"修水县\",\n" +
                "                code: \"360424\"\n" +
                "            }, {\n" +
                "                name: \"永修县\",\n" +
                "                code: \"360425\"\n" +
                "            }, {\n" +
                "                name: \"德安县\",\n" +
                "                code: \"360426\"\n" +
                "            }, {\n" +
                "                name: \"星子县\",\n" +
                "                code: \"360427\"\n" +
                "            }, {\n" +
                "                name: \"都昌县\",\n" +
                "                code: \"360428\"\n" +
                "            }, {\n" +
                "                name: \"湖口县\",\n" +
                "                code: \"360429\"\n" +
                "            }, {\n" +
                "                name: \"彭泽县\",\n" +
                "                code: \"360430\"\n" +
                "            }, {\n" +
                "                name: \"瑞昌市\",\n" +
                "                code: \"360481\"\n" +
                "            }, {\n" +
                "                name: \"共青城市\",\n" +
                "                code: \"360482\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"新余市\",\n" +
                "            code: \"360500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"360501\"\n" +
                "            }, {\n" +
                "                name: \"渝水区\",\n" +
                "                code: \"360502\"\n" +
                "            }, {\n" +
                "                name: \"分宜县\",\n" +
                "                code: \"360521\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"鹰潭市\",\n" +
                "            code: \"360600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"360601\"\n" +
                "            }, {\n" +
                "                name: \"月湖区\",\n" +
                "                code: \"360602\"\n" +
                "            }, {\n" +
                "                name: \"余江县\",\n" +
                "                code: \"360622\"\n" +
                "            }, {\n" +
                "                name: \"贵溪市\",\n" +
                "                code: \"360681\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"赣州市\",\n" +
                "            code: \"360700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"360701\"\n" +
                "            }, {\n" +
                "                name: \"章贡区\",\n" +
                "                code: \"360702\"\n" +
                "            }, {\n" +
                "                name: \"南康区\",\n" +
                "                code: \"360703\"\n" +
                "            }, {\n" +
                "                name: \"赣县\",\n" +
                "                code: \"360721\"\n" +
                "            }, {\n" +
                "                name: \"信丰县\",\n" +
                "                code: \"360722\"\n" +
                "            }, {\n" +
                "                name: \"大余县\",\n" +
                "                code: \"360723\"\n" +
                "            }, {\n" +
                "                name: \"上犹县\",\n" +
                "                code: \"360724\"\n" +
                "            }, {\n" +
                "                name: \"崇义县\",\n" +
                "                code: \"360725\"\n" +
                "            }, {\n" +
                "                name: \"安远县\",\n" +
                "                code: \"360726\"\n" +
                "            }, {\n" +
                "                name: \"龙南县\",\n" +
                "                code: \"360727\"\n" +
                "            }, {\n" +
                "                name: \"定南县\",\n" +
                "                code: \"360728\"\n" +
                "            }, {\n" +
                "                name: \"全南县\",\n" +
                "                code: \"360729\"\n" +
                "            }, {\n" +
                "                name: \"宁都县\",\n" +
                "                code: \"360730\"\n" +
                "            }, {\n" +
                "                name: \"于都县\",\n" +
                "                code: \"360731\"\n" +
                "            }, {\n" +
                "                name: \"兴国县\",\n" +
                "                code: \"360732\"\n" +
                "            }, {\n" +
                "                name: \"会昌县\",\n" +
                "                code: \"360733\"\n" +
                "            }, {\n" +
                "                name: \"寻乌县\",\n" +
                "                code: \"360734\"\n" +
                "            }, {\n" +
                "                name: \"石城县\",\n" +
                "                code: \"360735\"\n" +
                "            }, {\n" +
                "                name: \"瑞金市\",\n" +
                "                code: \"360781\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"吉安市\",\n" +
                "            code: \"360800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"360801\"\n" +
                "            }, {\n" +
                "                name: \"吉州区\",\n" +
                "                code: \"360802\"\n" +
                "            }, {\n" +
                "                name: \"青原区\",\n" +
                "                code: \"360803\"\n" +
                "            }, {\n" +
                "                name: \"吉安县\",\n" +
                "                code: \"360821\"\n" +
                "            }, {\n" +
                "                name: \"吉水县\",\n" +
                "                code: \"360822\"\n" +
                "            }, {\n" +
                "                name: \"峡江县\",\n" +
                "                code: \"360823\"\n" +
                "            }, {\n" +
                "                name: \"新干县\",\n" +
                "                code: \"360824\"\n" +
                "            }, {\n" +
                "                name: \"永丰县\",\n" +
                "                code: \"360825\"\n" +
                "            }, {\n" +
                "                name: \"泰和县\",\n" +
                "                code: \"360826\"\n" +
                "            }, {\n" +
                "                name: \"遂川县\",\n" +
                "                code: \"360827\"\n" +
                "            }, {\n" +
                "                name: \"万安县\",\n" +
                "                code: \"360828\"\n" +
                "            }, {\n" +
                "                name: \"安福县\",\n" +
                "                code: \"360829\"\n" +
                "            }, {\n" +
                "                name: \"永新县\",\n" +
                "                code: \"360830\"\n" +
                "            }, {\n" +
                "                name: \"井冈山市\",\n" +
                "                code: \"360881\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"宜春市\",\n" +
                "            code: \"360900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"360901\"\n" +
                "            }, {\n" +
                "                name: \"袁州区\",\n" +
                "                code: \"360902\"\n" +
                "            }, {\n" +
                "                name: \"奉新县\",\n" +
                "                code: \"360921\"\n" +
                "            }, {\n" +
                "                name: \"万载县\",\n" +
                "                code: \"360922\"\n" +
                "            }, {\n" +
                "                name: \"上高县\",\n" +
                "                code: \"360923\"\n" +
                "            }, {\n" +
                "                name: \"宜丰县\",\n" +
                "                code: \"360924\"\n" +
                "            }, {\n" +
                "                name: \"靖安县\",\n" +
                "                code: \"360925\"\n" +
                "            }, {\n" +
                "                name: \"铜鼓县\",\n" +
                "                code: \"360926\"\n" +
                "            }, {\n" +
                "                name: \"丰城市\",\n" +
                "                code: \"360981\"\n" +
                "            }, {\n" +
                "                name: \"樟树市\",\n" +
                "                code: \"360982\"\n" +
                "            }, {\n" +
                "                name: \"高安市\",\n" +
                "                code: \"360983\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"抚州市\",\n" +
                "            code: \"361000\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"361001\"\n" +
                "            }, {\n" +
                "                name: \"临川区\",\n" +
                "                code: \"361002\"\n" +
                "            }, {\n" +
                "                name: \"南城县\",\n" +
                "                code: \"361021\"\n" +
                "            }, {\n" +
                "                name: \"黎川县\",\n" +
                "                code: \"361022\"\n" +
                "            }, {\n" +
                "                name: \"南丰县\",\n" +
                "                code: \"361023\"\n" +
                "            }, {\n" +
                "                name: \"崇仁县\",\n" +
                "                code: \"361024\"\n" +
                "            }, {\n" +
                "                name: \"乐安县\",\n" +
                "                code: \"361025\"\n" +
                "            }, {\n" +
                "                name: \"宜黄县\",\n" +
                "                code: \"361026\"\n" +
                "            }, {\n" +
                "                name: \"金溪县\",\n" +
                "                code: \"361027\"\n" +
                "            }, {\n" +
                "                name: \"资溪县\",\n" +
                "                code: \"361028\"\n" +
                "            }, {\n" +
                "                name: \"东乡县\",\n" +
                "                code: \"361029\"\n" +
                "            }, {\n" +
                "                name: \"广昌县\",\n" +
                "                code: \"361030\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"上饶市\",\n" +
                "            code: \"361100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"361101\"\n" +
                "            }, {\n" +
                "                name: \"信州区\",\n" +
                "                code: \"361102\"\n" +
                "            }, {\n" +
                "                name: \"上饶县\",\n" +
                "                code: \"361121\"\n" +
                "            }, {\n" +
                "                name: \"广丰县\",\n" +
                "                code: \"361122\"\n" +
                "            }, {\n" +
                "                name: \"玉山县\",\n" +
                "                code: \"361123\"\n" +
                "            }, {\n" +
                "                name: \"铅山县\",\n" +
                "                code: \"361124\"\n" +
                "            }, {\n" +
                "                name: \"横峰县\",\n" +
                "                code: \"361125\"\n" +
                "            }, {\n" +
                "                name: \"弋阳县\",\n" +
                "                code: \"361126\"\n" +
                "            }, {\n" +
                "                name: \"余干县\",\n" +
                "                code: \"361127\"\n" +
                "            }, {\n" +
                "                name: \"鄱阳县\",\n" +
                "                code: \"361128\"\n" +
                "            }, {\n" +
                "                name: \"万年县\",\n" +
                "                code: \"361129\"\n" +
                "            }, {\n" +
                "                name: \"婺源县\",\n" +
                "                code: \"361130\"\n" +
                "            }, {\n" +
                "                name: \"德兴市\",\n" +
                "                code: \"361181\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"山东省\",\n" +
                "        code: \"370000\",\n" +
                "        sub: [{\n" +
                "            name: \"济南市\",\n" +
                "            code: \"370100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"370101\"\n" +
                "            }, {\n" +
                "                name: \"历下区\",\n" +
                "                code: \"370102\"\n" +
                "            }, {\n" +
                "                name: \"市中区\",\n" +
                "                code: \"370103\"\n" +
                "            }, {\n" +
                "                name: \"槐荫区\",\n" +
                "                code: \"370104\"\n" +
                "            }, {\n" +
                "                name: \"天桥区\",\n" +
                "                code: \"370105\"\n" +
                "            }, {\n" +
                "                name: \"历城区\",\n" +
                "                code: \"370112\"\n" +
                "            }, {\n" +
                "                name: \"长清区\",\n" +
                "                code: \"370113\"\n" +
                "            }, {\n" +
                "                name: \"平阴县\",\n" +
                "                code: \"370124\"\n" +
                "            }, {\n" +
                "                name: \"济阳县\",\n" +
                "                code: \"370125\"\n" +
                "            }, {\n" +
                "                name: \"商河县\",\n" +
                "                code: \"370126\"\n" +
                "            }, {\n" +
                "                name: \"章丘市\",\n" +
                "                code: \"370181\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"青岛市\",\n" +
                "            code: \"370200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"370201\"\n" +
                "            }, {\n" +
                "                name: \"市南区\",\n" +
                "                code: \"370202\"\n" +
                "            }, {\n" +
                "                name: \"市北区\",\n" +
                "                code: \"370203\"\n" +
                "            }, {\n" +
                "                name: \"黄岛区\",\n" +
                "                code: \"370211\"\n" +
                "            }, {\n" +
                "                name: \"崂山区\",\n" +
                "                code: \"370212\"\n" +
                "            }, {\n" +
                "                name: \"李沧区\",\n" +
                "                code: \"370213\"\n" +
                "            }, {\n" +
                "                name: \"城阳区\",\n" +
                "                code: \"370214\"\n" +
                "            }, {\n" +
                "                name: \"胶州市\",\n" +
                "                code: \"370281\"\n" +
                "            }, {\n" +
                "                name: \"即墨市\",\n" +
                "                code: \"370282\"\n" +
                "            }, {\n" +
                "                name: \"平度市\",\n" +
                "                code: \"370283\"\n" +
                "            }, {\n" +
                "                name: \"莱西市\",\n" +
                "                code: \"370285\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"淄博市\",\n" +
                "            code: \"370300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"370301\"\n" +
                "            }, {\n" +
                "                name: \"淄川区\",\n" +
                "                code: \"370302\"\n" +
                "            }, {\n" +
                "                name: \"张店区\",\n" +
                "                code: \"370303\"\n" +
                "            }, {\n" +
                "                name: \"博山区\",\n" +
                "                code: \"370304\"\n" +
                "            }, {\n" +
                "                name: \"临淄区\",\n" +
                "                code: \"370305\"\n" +
                "            }, {\n" +
                "                name: \"周村区\",\n" +
                "                code: \"370306\"\n" +
                "            }, {\n" +
                "                name: \"桓台县\",\n" +
                "                code: \"370321\"\n" +
                "            }, {\n" +
                "                name: \"高青县\",\n" +
                "                code: \"370322\"\n" +
                "            }, {\n" +
                "                name: \"沂源县\",\n" +
                "                code: \"370323\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"枣庄市\",\n" +
                "            code: \"370400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"370401\"\n" +
                "            }, {\n" +
                "                name: \"市中区\",\n" +
                "                code: \"370402\"\n" +
                "            }, {\n" +
                "                name: \"薛城区\",\n" +
                "                code: \"370403\"\n" +
                "            }, {\n" +
                "                name: \"峄城区\",\n" +
                "                code: \"370404\"\n" +
                "            }, {\n" +
                "                name: \"台儿庄区\",\n" +
                "                code: \"370405\"\n" +
                "            }, {\n" +
                "                name: \"山亭区\",\n" +
                "                code: \"370406\"\n" +
                "            }, {\n" +
                "                name: \"滕州市\",\n" +
                "                code: \"370481\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"东营市\",\n" +
                "            code: \"370500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"370501\"\n" +
                "            }, {\n" +
                "                name: \"东营区\",\n" +
                "                code: \"370502\"\n" +
                "            }, {\n" +
                "                name: \"河口区\",\n" +
                "                code: \"370503\"\n" +
                "            }, {\n" +
                "                name: \"垦利县\",\n" +
                "                code: \"370521\"\n" +
                "            }, {\n" +
                "                name: \"利津县\",\n" +
                "                code: \"370522\"\n" +
                "            }, {\n" +
                "                name: \"广饶县\",\n" +
                "                code: \"370523\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"烟台市\",\n" +
                "            code: \"370600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"370601\"\n" +
                "            }, {\n" +
                "                name: \"芝罘区\",\n" +
                "                code: \"370602\"\n" +
                "            }, {\n" +
                "                name: \"福山区\",\n" +
                "                code: \"370611\"\n" +
                "            }, {\n" +
                "                name: \"牟平区\",\n" +
                "                code: \"370612\"\n" +
                "            }, {\n" +
                "                name: \"莱山区\",\n" +
                "                code: \"370613\"\n" +
                "            }, {\n" +
                "                name: \"长岛县\",\n" +
                "                code: \"370634\"\n" +
                "            }, {\n" +
                "                name: \"龙口市\",\n" +
                "                code: \"370681\"\n" +
                "            }, {\n" +
                "                name: \"莱阳市\",\n" +
                "                code: \"370682\"\n" +
                "            }, {\n" +
                "                name: \"莱州市\",\n" +
                "                code: \"370683\"\n" +
                "            }, {\n" +
                "                name: \"蓬莱市\",\n" +
                "                code: \"370684\"\n" +
                "            }, {\n" +
                "                name: \"招远市\",\n" +
                "                code: \"370685\"\n" +
                "            }, {\n" +
                "                name: \"栖霞市\",\n" +
                "                code: \"370686\"\n" +
                "            }, {\n" +
                "                name: \"海阳市\",\n" +
                "                code: \"370687\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"潍坊市\",\n" +
                "            code: \"370700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"370701\"\n" +
                "            }, {\n" +
                "                name: \"潍城区\",\n" +
                "                code: \"370702\"\n" +
                "            }, {\n" +
                "                name: \"寒亭区\",\n" +
                "                code: \"370703\"\n" +
                "            }, {\n" +
                "                name: \"坊子区\",\n" +
                "                code: \"370704\"\n" +
                "            }, {\n" +
                "                name: \"奎文区\",\n" +
                "                code: \"370705\"\n" +
                "            }, {\n" +
                "                name: \"临朐县\",\n" +
                "                code: \"370724\"\n" +
                "            }, {\n" +
                "                name: \"昌乐县\",\n" +
                "                code: \"370725\"\n" +
                "            }, {\n" +
                "                name: \"青州市\",\n" +
                "                code: \"370781\"\n" +
                "            }, {\n" +
                "                name: \"诸城市\",\n" +
                "                code: \"370782\"\n" +
                "            }, {\n" +
                "                name: \"寿光市\",\n" +
                "                code: \"370783\"\n" +
                "            }, {\n" +
                "                name: \"安丘市\",\n" +
                "                code: \"370784\"\n" +
                "            }, {\n" +
                "                name: \"高密市\",\n" +
                "                code: \"370785\"\n" +
                "            }, {\n" +
                "                name: \"昌邑市\",\n" +
                "                code: \"370786\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"济宁市\",\n" +
                "            code: \"370800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"370801\"\n" +
                "            }, {\n" +
                "                name: \"任城区\",\n" +
                "                code: \"370811\"\n" +
                "            }, {\n" +
                "                name: \"兖州区\",\n" +
                "                code: \"370812\"\n" +
                "            }, {\n" +
                "                name: \"微山县\",\n" +
                "                code: \"370826\"\n" +
                "            }, {\n" +
                "                name: \"鱼台县\",\n" +
                "                code: \"370827\"\n" +
                "            }, {\n" +
                "                name: \"金乡县\",\n" +
                "                code: \"370828\"\n" +
                "            }, {\n" +
                "                name: \"嘉祥县\",\n" +
                "                code: \"370829\"\n" +
                "            }, {\n" +
                "                name: \"汶上县\",\n" +
                "                code: \"370830\"\n" +
                "            }, {\n" +
                "                name: \"泗水县\",\n" +
                "                code: \"370831\"\n" +
                "            }, {\n" +
                "                name: \"梁山县\",\n" +
                "                code: \"370832\"\n" +
                "            }, {\n" +
                "                name: \"曲阜市\",\n" +
                "                code: \"370881\"\n" +
                "            }, {\n" +
                "                name: \"邹城市\",\n" +
                "                code: \"370883\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"泰安市\",\n" +
                "            code: \"370900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"370901\"\n" +
                "            }, {\n" +
                "                name: \"泰山区\",\n" +
                "                code: \"370902\"\n" +
                "            }, {\n" +
                "                name: \"岱岳区\",\n" +
                "                code: \"370911\"\n" +
                "            }, {\n" +
                "                name: \"宁阳县\",\n" +
                "                code: \"370921\"\n" +
                "            }, {\n" +
                "                name: \"东平县\",\n" +
                "                code: \"370923\"\n" +
                "            }, {\n" +
                "                name: \"新泰市\",\n" +
                "                code: \"370982\"\n" +
                "            }, {\n" +
                "                name: \"肥城市\",\n" +
                "                code: \"370983\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"威海市\",\n" +
                "            code: \"371000\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"371001\"\n" +
                "            }, {\n" +
                "                name: \"环翠区\",\n" +
                "                code: \"371002\"\n" +
                "            }, {\n" +
                "                name: \"文登市\",\n" +
                "                code: \"371081\"\n" +
                "            }, {\n" +
                "                name: \"荣成市\",\n" +
                "                code: \"371082\"\n" +
                "            }, {\n" +
                "                name: \"乳山市\",\n" +
                "                code: \"371083\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"日照市\",\n" +
                "            code: \"371100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"371101\"\n" +
                "            }, {\n" +
                "                name: \"东港区\",\n" +
                "                code: \"371102\"\n" +
                "            }, {\n" +
                "                name: \"岚山区\",\n" +
                "                code: \"371103\"\n" +
                "            }, {\n" +
                "                name: \"五莲县\",\n" +
                "                code: \"371121\"\n" +
                "            }, {\n" +
                "                name: \"莒县\",\n" +
                "                code: \"371122\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"莱芜市\",\n" +
                "            code: \"371200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"371201\"\n" +
                "            }, {\n" +
                "                name: \"莱城区\",\n" +
                "                code: \"371202\"\n" +
                "            }, {\n" +
                "                name: \"钢城区\",\n" +
                "                code: \"371203\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"临沂市\",\n" +
                "            code: \"371300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"371301\"\n" +
                "            }, {\n" +
                "                name: \"兰山区\",\n" +
                "                code: \"371302\"\n" +
                "            }, {\n" +
                "                name: \"罗庄区\",\n" +
                "                code: \"371311\"\n" +
                "            }, {\n" +
                "                name: \"河东区\",\n" +
                "                code: \"371312\"\n" +
                "            }, {\n" +
                "                name: \"沂南县\",\n" +
                "                code: \"371321\"\n" +
                "            }, {\n" +
                "                name: \"郯城县\",\n" +
                "                code: \"371322\"\n" +
                "            }, {\n" +
                "                name: \"沂水县\",\n" +
                "                code: \"371323\"\n" +
                "            }, {\n" +
                "                name: \"兰陵县\",\n" +
                "                code: \"371324\"\n" +
                "            }, {\n" +
                "                name: \"费县\",\n" +
                "                code: \"371325\"\n" +
                "            }, {\n" +
                "                name: \"平邑县\",\n" +
                "                code: \"371326\"\n" +
                "            }, {\n" +
                "                name: \"莒南县\",\n" +
                "                code: \"371327\"\n" +
                "            }, {\n" +
                "                name: \"蒙阴县\",\n" +
                "                code: \"371328\"\n" +
                "            }, {\n" +
                "                name: \"临沭县\",\n" +
                "                code: \"371329\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"德州市\",\n" +
                "            code: \"371400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"371401\"\n" +
                "            }, {\n" +
                "                name: \"德城区\",\n" +
                "                code: \"371402\"\n" +
                "            }, {\n" +
                "                name: \"陵城区\",\n" +
                "                code: \"371403\"\n" +
                "            }, {\n" +
                "                name: \"宁津县\",\n" +
                "                code: \"371422\"\n" +
                "            }, {\n" +
                "                name: \"庆云县\",\n" +
                "                code: \"371423\"\n" +
                "            }, {\n" +
                "                name: \"临邑县\",\n" +
                "                code: \"371424\"\n" +
                "            }, {\n" +
                "                name: \"齐河县\",\n" +
                "                code: \"371425\"\n" +
                "            }, {\n" +
                "                name: \"平原县\",\n" +
                "                code: \"371426\"\n" +
                "            }, {\n" +
                "                name: \"夏津县\",\n" +
                "                code: \"371427\"\n" +
                "            }, {\n" +
                "                name: \"武城县\",\n" +
                "                code: \"371428\"\n" +
                "            }, {\n" +
                "                name: \"乐陵市\",\n" +
                "                code: \"371481\"\n" +
                "            }, {\n" +
                "                name: \"禹城市\",\n" +
                "                code: \"371482\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"聊城市\",\n" +
                "            code: \"371500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"371501\"\n" +
                "            }, {\n" +
                "                name: \"东昌府区\",\n" +
                "                code: \"371502\"\n" +
                "            }, {\n" +
                "                name: \"阳谷县\",\n" +
                "                code: \"371521\"\n" +
                "            }, {\n" +
                "                name: \"莘县\",\n" +
                "                code: \"371522\"\n" +
                "            }, {\n" +
                "                name: \"茌平县\",\n" +
                "                code: \"371523\"\n" +
                "            }, {\n" +
                "                name: \"东阿县\",\n" +
                "                code: \"371524\"\n" +
                "            }, {\n" +
                "                name: \"冠县\",\n" +
                "                code: \"371525\"\n" +
                "            }, {\n" +
                "                name: \"高唐县\",\n" +
                "                code: \"371526\"\n" +
                "            }, {\n" +
                "                name: \"临清市\",\n" +
                "                code: \"371581\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"滨州市\",\n" +
                "            code: \"371600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"371601\"\n" +
                "            }, {\n" +
                "                name: \"滨城区\",\n" +
                "                code: \"371602\"\n" +
                "            }, {\n" +
                "                name: \"沾化区\",\n" +
                "                code: \"371603\"\n" +
                "            }, {\n" +
                "                name: \"惠民县\",\n" +
                "                code: \"371621\"\n" +
                "            }, {\n" +
                "                name: \"阳信县\",\n" +
                "                code: \"371622\"\n" +
                "            }, {\n" +
                "                name: \"无棣县\",\n" +
                "                code: \"371623\"\n" +
                "            }, {\n" +
                "                name: \"博兴县\",\n" +
                "                code: \"371625\"\n" +
                "            }, {\n" +
                "                name: \"邹平县\",\n" +
                "                code: \"371626\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"菏泽市\",\n" +
                "            code: \"371700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"371701\"\n" +
                "            }, {\n" +
                "                name: \"牡丹区\",\n" +
                "                code: \"371702\"\n" +
                "            }, {\n" +
                "                name: \"曹县\",\n" +
                "                code: \"371721\"\n" +
                "            }, {\n" +
                "                name: \"单县\",\n" +
                "                code: \"371722\"\n" +
                "            }, {\n" +
                "                name: \"成武县\",\n" +
                "                code: \"371723\"\n" +
                "            }, {\n" +
                "                name: \"巨野县\",\n" +
                "                code: \"371724\"\n" +
                "            }, {\n" +
                "                name: \"郓城县\",\n" +
                "                code: \"371725\"\n" +
                "            }, {\n" +
                "                name: \"鄄城县\",\n" +
                "                code: \"371726\"\n" +
                "            }, {\n" +
                "                name: \"定陶县\",\n" +
                "                code: \"371727\"\n" +
                "            }, {\n" +
                "                name: \"东明县\",\n" +
                "                code: \"371728\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"河南省\",\n" +
                "        code: \"410000\",\n" +
                "        sub: [{\n" +
                "            name: \"郑州市\",\n" +
                "            code: \"410100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"410101\"\n" +
                "            }, {\n" +
                "                name: \"中原区\",\n" +
                "                code: \"410102\"\n" +
                "            }, {\n" +
                "                name: \"二七区\",\n" +
                "                code: \"410103\"\n" +
                "            }, {\n" +
                "                name: \"管城回族区\",\n" +
                "                code: \"410104\"\n" +
                "            }, {\n" +
                "                name: \"金水区\",\n" +
                "                code: \"410105\"\n" +
                "            }, {\n" +
                "                name: \"上街区\",\n" +
                "                code: \"410106\"\n" +
                "            }, {\n" +
                "                name: \"惠济区\",\n" +
                "                code: \"410108\"\n" +
                "            }, {\n" +
                "                name: \"中牟县\",\n" +
                "                code: \"410122\"\n" +
                "            }, {\n" +
                "                name: \"巩义市\",\n" +
                "                code: \"410181\"\n" +
                "            }, {\n" +
                "                name: \"荥阳市\",\n" +
                "                code: \"410182\"\n" +
                "            }, {\n" +
                "                name: \"新密市\",\n" +
                "                code: \"410183\"\n" +
                "            }, {\n" +
                "                name: \"新郑市\",\n" +
                "                code: \"410184\"\n" +
                "            }, {\n" +
                "                name: \"登封市\",\n" +
                "                code: \"410185\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"开封市\",\n" +
                "            code: \"410200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"410201\"\n" +
                "            }, {\n" +
                "                name: \"龙亭区\",\n" +
                "                code: \"410202\"\n" +
                "            }, {\n" +
                "                name: \"顺河回族区\",\n" +
                "                code: \"410203\"\n" +
                "            }, {\n" +
                "                name: \"鼓楼区\",\n" +
                "                code: \"410204\"\n" +
                "            }, {\n" +
                "                name: \"禹王台区\",\n" +
                "                code: \"410205\"\n" +
                "            }, {\n" +
                "                name: \"祥符区\",\n" +
                "                code: \"410212\"\n" +
                "            }, {\n" +
                "                name: \"杞县\",\n" +
                "                code: \"410221\"\n" +
                "            }, {\n" +
                "                name: \"通许县\",\n" +
                "                code: \"410222\"\n" +
                "            }, {\n" +
                "                name: \"尉氏县\",\n" +
                "                code: \"410223\"\n" +
                "            }, {\n" +
                "                name: \"兰考县\",\n" +
                "                code: \"410225\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"洛阳市\",\n" +
                "            code: \"410300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"410301\"\n" +
                "            }, {\n" +
                "                name: \"老城区\",\n" +
                "                code: \"410302\"\n" +
                "            }, {\n" +
                "                name: \"西工区\",\n" +
                "                code: \"410303\"\n" +
                "            }, {\n" +
                "                name: \"瀍河回族区\",\n" +
                "                code: \"410304\"\n" +
                "            }, {\n" +
                "                name: \"涧西区\",\n" +
                "                code: \"410305\"\n" +
                "            }, {\n" +
                "                name: \"吉利区\",\n" +
                "                code: \"410306\"\n" +
                "            }, {\n" +
                "                name: \"洛龙区\",\n" +
                "                code: \"410311\"\n" +
                "            }, {\n" +
                "                name: \"孟津县\",\n" +
                "                code: \"410322\"\n" +
                "            }, {\n" +
                "                name: \"新安县\",\n" +
                "                code: \"410323\"\n" +
                "            }, {\n" +
                "                name: \"栾川县\",\n" +
                "                code: \"410324\"\n" +
                "            }, {\n" +
                "                name: \"嵩县\",\n" +
                "                code: \"410325\"\n" +
                "            }, {\n" +
                "                name: \"汝阳县\",\n" +
                "                code: \"410326\"\n" +
                "            }, {\n" +
                "                name: \"宜阳县\",\n" +
                "                code: \"410327\"\n" +
                "            }, {\n" +
                "                name: \"洛宁县\",\n" +
                "                code: \"410328\"\n" +
                "            }, {\n" +
                "                name: \"伊川县\",\n" +
                "                code: \"410329\"\n" +
                "            }, {\n" +
                "                name: \"偃师市\",\n" +
                "                code: \"410381\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"平顶山市\",\n" +
                "            code: \"410400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"410401\"\n" +
                "            }, {\n" +
                "                name: \"新华区\",\n" +
                "                code: \"410402\"\n" +
                "            }, {\n" +
                "                name: \"卫东区\",\n" +
                "                code: \"410403\"\n" +
                "            }, {\n" +
                "                name: \"石龙区\",\n" +
                "                code: \"410404\"\n" +
                "            }, {\n" +
                "                name: \"湛河区\",\n" +
                "                code: \"410411\"\n" +
                "            }, {\n" +
                "                name: \"宝丰县\",\n" +
                "                code: \"410421\"\n" +
                "            }, {\n" +
                "                name: \"叶县\",\n" +
                "                code: \"410422\"\n" +
                "            }, {\n" +
                "                name: \"鲁山县\",\n" +
                "                code: \"410423\"\n" +
                "            }, {\n" +
                "                name: \"郏县\",\n" +
                "                code: \"410425\"\n" +
                "            }, {\n" +
                "                name: \"舞钢市\",\n" +
                "                code: \"410481\"\n" +
                "            }, {\n" +
                "                name: \"汝州市\",\n" +
                "                code: \"410482\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"安阳市\",\n" +
                "            code: \"410500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"410501\"\n" +
                "            }, {\n" +
                "                name: \"文峰区\",\n" +
                "                code: \"410502\"\n" +
                "            }, {\n" +
                "                name: \"北关区\",\n" +
                "                code: \"410503\"\n" +
                "            }, {\n" +
                "                name: \"殷都区\",\n" +
                "                code: \"410505\"\n" +
                "            }, {\n" +
                "                name: \"龙安区\",\n" +
                "                code: \"410506\"\n" +
                "            }, {\n" +
                "                name: \"安阳县\",\n" +
                "                code: \"410522\"\n" +
                "            }, {\n" +
                "                name: \"汤阴县\",\n" +
                "                code: \"410523\"\n" +
                "            }, {\n" +
                "                name: \"滑县\",\n" +
                "                code: \"410526\"\n" +
                "            }, {\n" +
                "                name: \"内黄县\",\n" +
                "                code: \"410527\"\n" +
                "            }, {\n" +
                "                name: \"林州市\",\n" +
                "                code: \"410581\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"鹤壁市\",\n" +
                "            code: \"410600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"410601\"\n" +
                "            }, {\n" +
                "                name: \"鹤山区\",\n" +
                "                code: \"410602\"\n" +
                "            }, {\n" +
                "                name: \"山城区\",\n" +
                "                code: \"410603\"\n" +
                "            }, {\n" +
                "                name: \"淇滨区\",\n" +
                "                code: \"410611\"\n" +
                "            }, {\n" +
                "                name: \"浚县\",\n" +
                "                code: \"410621\"\n" +
                "            }, {\n" +
                "                name: \"淇县\",\n" +
                "                code: \"410622\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"新乡市\",\n" +
                "            code: \"410700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"410701\"\n" +
                "            }, {\n" +
                "                name: \"红旗区\",\n" +
                "                code: \"410702\"\n" +
                "            }, {\n" +
                "                name: \"卫滨区\",\n" +
                "                code: \"410703\"\n" +
                "            }, {\n" +
                "                name: \"凤泉区\",\n" +
                "                code: \"410704\"\n" +
                "            }, {\n" +
                "                name: \"牧野区\",\n" +
                "                code: \"410711\"\n" +
                "            }, {\n" +
                "                name: \"新乡县\",\n" +
                "                code: \"410721\"\n" +
                "            }, {\n" +
                "                name: \"获嘉县\",\n" +
                "                code: \"410724\"\n" +
                "            }, {\n" +
                "                name: \"原阳县\",\n" +
                "                code: \"410725\"\n" +
                "            }, {\n" +
                "                name: \"延津县\",\n" +
                "                code: \"410726\"\n" +
                "            }, {\n" +
                "                name: \"封丘县\",\n" +
                "                code: \"410727\"\n" +
                "            }, {\n" +
                "                name: \"长垣县\",\n" +
                "                code: \"410728\"\n" +
                "            }, {\n" +
                "                name: \"卫辉市\",\n" +
                "                code: \"410781\"\n" +
                "            }, {\n" +
                "                name: \"辉县市\",\n" +
                "                code: \"410782\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"焦作市\",\n" +
                "            code: \"410800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"410801\"\n" +
                "            }, {\n" +
                "                name: \"解放区\",\n" +
                "                code: \"410802\"\n" +
                "            }, {\n" +
                "                name: \"中站区\",\n" +
                "                code: \"410803\"\n" +
                "            }, {\n" +
                "                name: \"马村区\",\n" +
                "                code: \"410804\"\n" +
                "            }, {\n" +
                "                name: \"山阳区\",\n" +
                "                code: \"410811\"\n" +
                "            }, {\n" +
                "                name: \"修武县\",\n" +
                "                code: \"410821\"\n" +
                "            }, {\n" +
                "                name: \"博爱县\",\n" +
                "                code: \"410822\"\n" +
                "            }, {\n" +
                "                name: \"武陟县\",\n" +
                "                code: \"410823\"\n" +
                "            }, {\n" +
                "                name: \"温县\",\n" +
                "                code: \"410825\"\n" +
                "            }, {\n" +
                "                name: \"沁阳市\",\n" +
                "                code: \"410882\"\n" +
                "            }, {\n" +
                "                name: \"孟州市\",\n" +
                "                code: \"410883\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"濮阳市\",\n" +
                "            code: \"410900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"410901\"\n" +
                "            }, {\n" +
                "                name: \"华龙区\",\n" +
                "                code: \"410902\"\n" +
                "            }, {\n" +
                "                name: \"清丰县\",\n" +
                "                code: \"410922\"\n" +
                "            }, {\n" +
                "                name: \"南乐县\",\n" +
                "                code: \"410923\"\n" +
                "            }, {\n" +
                "                name: \"范县\",\n" +
                "                code: \"410926\"\n" +
                "            }, {\n" +
                "                name: \"台前县\",\n" +
                "                code: \"410927\"\n" +
                "            }, {\n" +
                "                name: \"濮阳县\",\n" +
                "                code: \"410928\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"许昌市\",\n" +
                "            code: \"411000\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"411001\"\n" +
                "            }, {\n" +
                "                name: \"魏都区\",\n" +
                "                code: \"411002\"\n" +
                "            }, {\n" +
                "                name: \"许昌县\",\n" +
                "                code: \"411023\"\n" +
                "            }, {\n" +
                "                name: \"鄢陵县\",\n" +
                "                code: \"411024\"\n" +
                "            }, {\n" +
                "                name: \"襄城县\",\n" +
                "                code: \"411025\"\n" +
                "            }, {\n" +
                "                name: \"禹州市\",\n" +
                "                code: \"411081\"\n" +
                "            }, {\n" +
                "                name: \"长葛市\",\n" +
                "                code: \"411082\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"漯河市\",\n" +
                "            code: \"411100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"411101\"\n" +
                "            }, {\n" +
                "                name: \"源汇区\",\n" +
                "                code: \"411102\"\n" +
                "            }, {\n" +
                "                name: \"郾城区\",\n" +
                "                code: \"411103\"\n" +
                "            }, {\n" +
                "                name: \"召陵区\",\n" +
                "                code: \"411104\"\n" +
                "            }, {\n" +
                "                name: \"舞阳县\",\n" +
                "                code: \"411121\"\n" +
                "            }, {\n" +
                "                name: \"临颍县\",\n" +
                "                code: \"411122\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"三门峡市\",\n" +
                "            code: \"411200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"411201\"\n" +
                "            }, {\n" +
                "                name: \"湖滨区\",\n" +
                "                code: \"411202\"\n" +
                "            }, {\n" +
                "                name: \"渑池县\",\n" +
                "                code: \"411221\"\n" +
                "            }, {\n" +
                "                name: \"陕县\",\n" +
                "                code: \"411222\"\n" +
                "            }, {\n" +
                "                name: \"卢氏县\",\n" +
                "                code: \"411224\"\n" +
                "            }, {\n" +
                "                name: \"义马市\",\n" +
                "                code: \"411281\"\n" +
                "            }, {\n" +
                "                name: \"灵宝市\",\n" +
                "                code: \"411282\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"南阳市\",\n" +
                "            code: \"411300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"411301\"\n" +
                "            }, {\n" +
                "                name: \"宛城区\",\n" +
                "                code: \"411302\"\n" +
                "            }, {\n" +
                "                name: \"卧龙区\",\n" +
                "                code: \"411303\"\n" +
                "            }, {\n" +
                "                name: \"南召县\",\n" +
                "                code: \"411321\"\n" +
                "            }, {\n" +
                "                name: \"方城县\",\n" +
                "                code: \"411322\"\n" +
                "            }, {\n" +
                "                name: \"西峡县\",\n" +
                "                code: \"411323\"\n" +
                "            }, {\n" +
                "                name: \"镇平县\",\n" +
                "                code: \"411324\"\n" +
                "            }, {\n" +
                "                name: \"内乡县\",\n" +
                "                code: \"411325\"\n" +
                "            }, {\n" +
                "                name: \"淅川县\",\n" +
                "                code: \"411326\"\n" +
                "            }, {\n" +
                "                name: \"社旗县\",\n" +
                "                code: \"411327\"\n" +
                "            }, {\n" +
                "                name: \"唐河县\",\n" +
                "                code: \"411328\"\n" +
                "            }, {\n" +
                "                name: \"新野县\",\n" +
                "                code: \"411329\"\n" +
                "            }, {\n" +
                "                name: \"桐柏县\",\n" +
                "                code: \"411330\"\n" +
                "            }, {\n" +
                "                name: \"邓州市\",\n" +
                "                code: \"411381\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"商丘市\",\n" +
                "            code: \"411400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"411401\"\n" +
                "            }, {\n" +
                "                name: \"梁园区\",\n" +
                "                code: \"411402\"\n" +
                "            }, {\n" +
                "                name: \"睢阳区\",\n" +
                "                code: \"411403\"\n" +
                "            }, {\n" +
                "                name: \"民权县\",\n" +
                "                code: \"411421\"\n" +
                "            }, {\n" +
                "                name: \"睢县\",\n" +
                "                code: \"411422\"\n" +
                "            }, {\n" +
                "                name: \"宁陵县\",\n" +
                "                code: \"411423\"\n" +
                "            }, {\n" +
                "                name: \"柘城县\",\n" +
                "                code: \"411424\"\n" +
                "            }, {\n" +
                "                name: \"虞城县\",\n" +
                "                code: \"411425\"\n" +
                "            }, {\n" +
                "                name: \"夏邑县\",\n" +
                "                code: \"411426\"\n" +
                "            }, {\n" +
                "                name: \"永城市\",\n" +
                "                code: \"411481\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"信阳市\",\n" +
                "            code: \"411500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"411501\"\n" +
                "            }, {\n" +
                "                name: \"浉河区\",\n" +
                "                code: \"411502\"\n" +
                "            }, {\n" +
                "                name: \"平桥区\",\n" +
                "                code: \"411503\"\n" +
                "            }, {\n" +
                "                name: \"罗山县\",\n" +
                "                code: \"411521\"\n" +
                "            }, {\n" +
                "                name: \"光山县\",\n" +
                "                code: \"411522\"\n" +
                "            }, {\n" +
                "                name: \"新县\",\n" +
                "                code: \"411523\"\n" +
                "            }, {\n" +
                "                name: \"商城县\",\n" +
                "                code: \"411524\"\n" +
                "            }, {\n" +
                "                name: \"固始县\",\n" +
                "                code: \"411525\"\n" +
                "            }, {\n" +
                "                name: \"潢川县\",\n" +
                "                code: \"411526\"\n" +
                "            }, {\n" +
                "                name: \"淮滨县\",\n" +
                "                code: \"411527\"\n" +
                "            }, {\n" +
                "                name: \"息县\",\n" +
                "                code: \"411528\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"周口市\",\n" +
                "            code: \"411600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"411601\"\n" +
                "            }, {\n" +
                "                name: \"川汇区\",\n" +
                "                code: \"411602\"\n" +
                "            }, {\n" +
                "                name: \"扶沟县\",\n" +
                "                code: \"411621\"\n" +
                "            }, {\n" +
                "                name: \"西华县\",\n" +
                "                code: \"411622\"\n" +
                "            }, {\n" +
                "                name: \"商水县\",\n" +
                "                code: \"411623\"\n" +
                "            }, {\n" +
                "                name: \"沈丘县\",\n" +
                "                code: \"411624\"\n" +
                "            }, {\n" +
                "                name: \"郸城县\",\n" +
                "                code: \"411625\"\n" +
                "            }, {\n" +
                "                name: \"淮阳县\",\n" +
                "                code: \"411626\"\n" +
                "            }, {\n" +
                "                name: \"太康县\",\n" +
                "                code: \"411627\"\n" +
                "            }, {\n" +
                "                name: \"鹿邑县\",\n" +
                "                code: \"411628\"\n" +
                "            }, {\n" +
                "                name: \"项城市\",\n" +
                "                code: \"411681\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"驻马店市\",\n" +
                "            code: \"411700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"411701\"\n" +
                "            }, {\n" +
                "                name: \"驿城区\",\n" +
                "                code: \"411702\"\n" +
                "            }, {\n" +
                "                name: \"西平县\",\n" +
                "                code: \"411721\"\n" +
                "            }, {\n" +
                "                name: \"上蔡县\",\n" +
                "                code: \"411722\"\n" +
                "            }, {\n" +
                "                name: \"平舆县\",\n" +
                "                code: \"411723\"\n" +
                "            }, {\n" +
                "                name: \"正阳县\",\n" +
                "                code: \"411724\"\n" +
                "            }, {\n" +
                "                name: \"确山县\",\n" +
                "                code: \"411725\"\n" +
                "            }, {\n" +
                "                name: \"泌阳县\",\n" +
                "                code: \"411726\"\n" +
                "            }, {\n" +
                "                name: \"汝南县\",\n" +
                "                code: \"411727\"\n" +
                "            }, {\n" +
                "                name: \"遂平县\",\n" +
                "                code: \"411728\"\n" +
                "            }, {\n" +
                "                name: \"新蔡县\",\n" +
                "                code: \"411729\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"济源市\",\n" +
                "            code: \"419001\"\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"湖北省\",\n" +
                "        code: \"420000\",\n" +
                "        sub: [{\n" +
                "            name: \"武汉市\",\n" +
                "            code: \"420100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"420101\"\n" +
                "            }, {\n" +
                "                name: \"江岸区\",\n" +
                "                code: \"420102\"\n" +
                "            }, {\n" +
                "                name: \"江汉区\",\n" +
                "                code: \"420103\"\n" +
                "            }, {\n" +
                "                name: \"硚口区\",\n" +
                "                code: \"420104\"\n" +
                "            }, {\n" +
                "                name: \"汉阳区\",\n" +
                "                code: \"420105\"\n" +
                "            }, {\n" +
                "                name: \"武昌区\",\n" +
                "                code: \"420106\"\n" +
                "            }, {\n" +
                "                name: \"青山区\",\n" +
                "                code: \"420107\"\n" +
                "            }, {\n" +
                "                name: \"洪山区\",\n" +
                "                code: \"420111\"\n" +
                "            }, {\n" +
                "                name: \"东西湖区\",\n" +
                "                code: \"420112\"\n" +
                "            }, {\n" +
                "                name: \"汉南区\",\n" +
                "                code: \"420113\"\n" +
                "            }, {\n" +
                "                name: \"蔡甸区\",\n" +
                "                code: \"420114\"\n" +
                "            }, {\n" +
                "                name: \"江夏区\",\n" +
                "                code: \"420115\"\n" +
                "            }, {\n" +
                "                name: \"黄陂区\",\n" +
                "                code: \"420116\"\n" +
                "            }, {\n" +
                "                name: \"新洲区\",\n" +
                "                code: \"420117\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"黄石市\",\n" +
                "            code: \"420200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"420201\"\n" +
                "            }, {\n" +
                "                name: \"黄石港区\",\n" +
                "                code: \"420202\"\n" +
                "            }, {\n" +
                "                name: \"西塞山区\",\n" +
                "                code: \"420203\"\n" +
                "            }, {\n" +
                "                name: \"下陆区\",\n" +
                "                code: \"420204\"\n" +
                "            }, {\n" +
                "                name: \"铁山区\",\n" +
                "                code: \"420205\"\n" +
                "            }, {\n" +
                "                name: \"阳新县\",\n" +
                "                code: \"420222\"\n" +
                "            }, {\n" +
                "                name: \"大冶市\",\n" +
                "                code: \"420281\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"十堰市\",\n" +
                "            code: \"420300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"420301\"\n" +
                "            }, {\n" +
                "                name: \"茅箭区\",\n" +
                "                code: \"420302\"\n" +
                "            }, {\n" +
                "                name: \"张湾区\",\n" +
                "                code: \"420303\"\n" +
                "            }, {\n" +
                "                name: \"郧阳区\",\n" +
                "                code: \"420304\"\n" +
                "            }, {\n" +
                "                name: \"郧西县\",\n" +
                "                code: \"420322\"\n" +
                "            }, {\n" +
                "                name: \"竹山县\",\n" +
                "                code: \"420323\"\n" +
                "            }, {\n" +
                "                name: \"竹溪县\",\n" +
                "                code: \"420324\"\n" +
                "            }, {\n" +
                "                name: \"房县\",\n" +
                "                code: \"420325\"\n" +
                "            }, {\n" +
                "                name: \"丹江口市\",\n" +
                "                code: \"420381\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"宜昌市\",\n" +
                "            code: \"420500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"420501\"\n" +
                "            }, {\n" +
                "                name: \"西陵区\",\n" +
                "                code: \"420502\"\n" +
                "            }, {\n" +
                "                name: \"伍家岗区\",\n" +
                "                code: \"420503\"\n" +
                "            }, {\n" +
                "                name: \"点军区\",\n" +
                "                code: \"420504\"\n" +
                "            }, {\n" +
                "                name: \"猇亭区\",\n" +
                "                code: \"420505\"\n" +
                "            }, {\n" +
                "                name: \"夷陵区\",\n" +
                "                code: \"420506\"\n" +
                "            }, {\n" +
                "                name: \"远安县\",\n" +
                "                code: \"420525\"\n" +
                "            }, {\n" +
                "                name: \"兴山县\",\n" +
                "                code: \"420526\"\n" +
                "            }, {\n" +
                "                name: \"秭归县\",\n" +
                "                code: \"420527\"\n" +
                "            }, {\n" +
                "                name: \"长阳土家族自治县\",\n" +
                "                code: \"420528\"\n" +
                "            }, {\n" +
                "                name: \"五峰土家族自治县\",\n" +
                "                code: \"420529\"\n" +
                "            }, {\n" +
                "                name: \"宜都市\",\n" +
                "                code: \"420581\"\n" +
                "            }, {\n" +
                "                name: \"当阳市\",\n" +
                "                code: \"420582\"\n" +
                "            }, {\n" +
                "                name: \"枝江市\",\n" +
                "                code: \"420583\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"襄阳市\",\n" +
                "            code: \"420600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"420601\"\n" +
                "            }, {\n" +
                "                name: \"襄城区\",\n" +
                "                code: \"420602\"\n" +
                "            }, {\n" +
                "                name: \"樊城区\",\n" +
                "                code: \"420606\"\n" +
                "            }, {\n" +
                "                name: \"襄州区\",\n" +
                "                code: \"420607\"\n" +
                "            }, {\n" +
                "                name: \"南漳县\",\n" +
                "                code: \"420624\"\n" +
                "            }, {\n" +
                "                name: \"谷城县\",\n" +
                "                code: \"420625\"\n" +
                "            }, {\n" +
                "                name: \"保康县\",\n" +
                "                code: \"420626\"\n" +
                "            }, {\n" +
                "                name: \"老河口市\",\n" +
                "                code: \"420682\"\n" +
                "            }, {\n" +
                "                name: \"枣阳市\",\n" +
                "                code: \"420683\"\n" +
                "            }, {\n" +
                "                name: \"宜城市\",\n" +
                "                code: \"420684\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"鄂州市\",\n" +
                "            code: \"420700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"420701\"\n" +
                "            }, {\n" +
                "                name: \"梁子湖区\",\n" +
                "                code: \"420702\"\n" +
                "            }, {\n" +
                "                name: \"华容区\",\n" +
                "                code: \"420703\"\n" +
                "            }, {\n" +
                "                name: \"鄂城区\",\n" +
                "                code: \"420704\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"荆门市\",\n" +
                "            code: \"420800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"420801\"\n" +
                "            }, {\n" +
                "                name: \"东宝区\",\n" +
                "                code: \"420802\"\n" +
                "            }, {\n" +
                "                name: \"掇刀区\",\n" +
                "                code: \"420804\"\n" +
                "            }, {\n" +
                "                name: \"京山县\",\n" +
                "                code: \"420821\"\n" +
                "            }, {\n" +
                "                name: \"沙洋县\",\n" +
                "                code: \"420822\"\n" +
                "            }, {\n" +
                "                name: \"钟祥市\",\n" +
                "                code: \"420881\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"孝感市\",\n" +
                "            code: \"420900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"420901\"\n" +
                "            }, {\n" +
                "                name: \"孝南区\",\n" +
                "                code: \"420902\"\n" +
                "            }, {\n" +
                "                name: \"孝昌县\",\n" +
                "                code: \"420921\"\n" +
                "            }, {\n" +
                "                name: \"大悟县\",\n" +
                "                code: \"420922\"\n" +
                "            }, {\n" +
                "                name: \"云梦县\",\n" +
                "                code: \"420923\"\n" +
                "            }, {\n" +
                "                name: \"应城市\",\n" +
                "                code: \"420981\"\n" +
                "            }, {\n" +
                "                name: \"安陆市\",\n" +
                "                code: \"420982\"\n" +
                "            }, {\n" +
                "                name: \"汉川市\",\n" +
                "                code: \"420984\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"荆州市\",\n" +
                "            code: \"421000\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"421001\"\n" +
                "            }, {\n" +
                "                name: \"沙市区\",\n" +
                "                code: \"421002\"\n" +
                "            }, {\n" +
                "                name: \"荆州区\",\n" +
                "                code: \"421003\"\n" +
                "            }, {\n" +
                "                name: \"公安县\",\n" +
                "                code: \"421022\"\n" +
                "            }, {\n" +
                "                name: \"监利县\",\n" +
                "                code: \"421023\"\n" +
                "            }, {\n" +
                "                name: \"江陵县\",\n" +
                "                code: \"421024\"\n" +
                "            }, {\n" +
                "                name: \"石首市\",\n" +
                "                code: \"421081\"\n" +
                "            }, {\n" +
                "                name: \"洪湖市\",\n" +
                "                code: \"421083\"\n" +
                "            }, {\n" +
                "                name: \"松滋市\",\n" +
                "                code: \"421087\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"黄冈市\",\n" +
                "            code: \"421100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"421101\"\n" +
                "            }, {\n" +
                "                name: \"黄州区\",\n" +
                "                code: \"421102\"\n" +
                "            }, {\n" +
                "                name: \"团风县\",\n" +
                "                code: \"421121\"\n" +
                "            }, {\n" +
                "                name: \"红安县\",\n" +
                "                code: \"421122\"\n" +
                "            }, {\n" +
                "                name: \"罗田县\",\n" +
                "                code: \"421123\"\n" +
                "            }, {\n" +
                "                name: \"英山县\",\n" +
                "                code: \"421124\"\n" +
                "            }, {\n" +
                "                name: \"浠水县\",\n" +
                "                code: \"421125\"\n" +
                "            }, {\n" +
                "                name: \"蕲春县\",\n" +
                "                code: \"421126\"\n" +
                "            }, {\n" +
                "                name: \"黄梅县\",\n" +
                "                code: \"421127\"\n" +
                "            }, {\n" +
                "                name: \"麻城市\",\n" +
                "                code: \"421181\"\n" +
                "            }, {\n" +
                "                name: \"武穴市\",\n" +
                "                code: \"421182\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"咸宁市\",\n" +
                "            code: \"421200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"421201\"\n" +
                "            }, {\n" +
                "                name: \"咸安区\",\n" +
                "                code: \"421202\"\n" +
                "            }, {\n" +
                "                name: \"嘉鱼县\",\n" +
                "                code: \"421221\"\n" +
                "            }, {\n" +
                "                name: \"通城县\",\n" +
                "                code: \"421222\"\n" +
                "            }, {\n" +
                "                name: \"崇阳县\",\n" +
                "                code: \"421223\"\n" +
                "            }, {\n" +
                "                name: \"通山县\",\n" +
                "                code: \"421224\"\n" +
                "            }, {\n" +
                "                name: \"赤壁市\",\n" +
                "                code: \"421281\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"随州市\",\n" +
                "            code: \"421300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"421301\"\n" +
                "            }, {\n" +
                "                name: \"曾都区\",\n" +
                "                code: \"421303\"\n" +
                "            }, {\n" +
                "                name: \"随县\",\n" +
                "                code: \"421321\"\n" +
                "            }, {\n" +
                "                name: \"广水市\",\n" +
                "                code: \"421381\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"恩施土家族苗族自治州\",\n" +
                "            code: \"422800\",\n" +
                "            sub: [{\n" +
                "                name: \"恩施市\",\n" +
                "                code: \"422801\"\n" +
                "            }, {\n" +
                "                name: \"利川市\",\n" +
                "                code: \"422802\"\n" +
                "            }, {\n" +
                "                name: \"建始县\",\n" +
                "                code: \"422822\"\n" +
                "            }, {\n" +
                "                name: \"巴东县\",\n" +
                "                code: \"422823\"\n" +
                "            }, {\n" +
                "                name: \"宣恩县\",\n" +
                "                code: \"422825\"\n" +
                "            }, {\n" +
                "                name: \"咸丰县\",\n" +
                "                code: \"422826\"\n" +
                "            }, {\n" +
                "                name: \"来凤县\",\n" +
                "                code: \"422827\"\n" +
                "            }, {\n" +
                "                name: \"鹤峰县\",\n" +
                "                code: \"422828\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"仙桃市\",\n" +
                "            code: \"429004\"\n" +
                "        }, {\n" +
                "            name: \"潜江市\",\n" +
                "            code: \"429005\"\n" +
                "        }, {\n" +
                "            name: \"天门市\",\n" +
                "            code: \"429006\"\n" +
                "        }, {\n" +
                "            name: \"神农架林区\",\n" +
                "            code: \"429021\"\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"湖南省\",\n" +
                "        code: \"430000\",\n" +
                "        sub: [{\n" +
                "            name: \"长沙市\",\n" +
                "            code: \"430100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"430101\"\n" +
                "            }, {\n" +
                "                name: \"芙蓉区\",\n" +
                "                code: \"430102\"\n" +
                "            }, {\n" +
                "                name: \"天心区\",\n" +
                "                code: \"430103\"\n" +
                "            }, {\n" +
                "                name: \"岳麓区\",\n" +
                "                code: \"430104\"\n" +
                "            }, {\n" +
                "                name: \"开福区\",\n" +
                "                code: \"430105\"\n" +
                "            }, {\n" +
                "                name: \"雨花区\",\n" +
                "                code: \"430111\"\n" +
                "            }, {\n" +
                "                name: \"望城区\",\n" +
                "                code: \"430112\"\n" +
                "            }, {\n" +
                "                name: \"长沙县\",\n" +
                "                code: \"430121\"\n" +
                "            }, {\n" +
                "                name: \"宁乡县\",\n" +
                "                code: \"430124\"\n" +
                "            }, {\n" +
                "                name: \"浏阳市\",\n" +
                "                code: \"430181\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"株洲市\",\n" +
                "            code: \"430200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"430201\"\n" +
                "            }, {\n" +
                "                name: \"荷塘区\",\n" +
                "                code: \"430202\"\n" +
                "            }, {\n" +
                "                name: \"芦淞区\",\n" +
                "                code: \"430203\"\n" +
                "            }, {\n" +
                "                name: \"石峰区\",\n" +
                "                code: \"430204\"\n" +
                "            }, {\n" +
                "                name: \"天元区\",\n" +
                "                code: \"430211\"\n" +
                "            }, {\n" +
                "                name: \"株洲县\",\n" +
                "                code: \"430221\"\n" +
                "            }, {\n" +
                "                name: \"攸县\",\n" +
                "                code: \"430223\"\n" +
                "            }, {\n" +
                "                name: \"茶陵县\",\n" +
                "                code: \"430224\"\n" +
                "            }, {\n" +
                "                name: \"炎陵县\",\n" +
                "                code: \"430225\"\n" +
                "            }, {\n" +
                "                name: \"醴陵市\",\n" +
                "                code: \"430281\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"湘潭市\",\n" +
                "            code: \"430300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"430301\"\n" +
                "            }, {\n" +
                "                name: \"雨湖区\",\n" +
                "                code: \"430302\"\n" +
                "            }, {\n" +
                "                name: \"岳塘区\",\n" +
                "                code: \"430304\"\n" +
                "            }, {\n" +
                "                name: \"湘潭县\",\n" +
                "                code: \"430321\"\n" +
                "            }, {\n" +
                "                name: \"湘乡市\",\n" +
                "                code: \"430381\"\n" +
                "            }, {\n" +
                "                name: \"韶山市\",\n" +
                "                code: \"430382\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"衡阳市\",\n" +
                "            code: \"430400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"430401\"\n" +
                "            }, {\n" +
                "                name: \"珠晖区\",\n" +
                "                code: \"430405\"\n" +
                "            }, {\n" +
                "                name: \"雁峰区\",\n" +
                "                code: \"430406\"\n" +
                "            }, {\n" +
                "                name: \"石鼓区\",\n" +
                "                code: \"430407\"\n" +
                "            }, {\n" +
                "                name: \"蒸湘区\",\n" +
                "                code: \"430408\"\n" +
                "            }, {\n" +
                "                name: \"南岳区\",\n" +
                "                code: \"430412\"\n" +
                "            }, {\n" +
                "                name: \"衡阳县\",\n" +
                "                code: \"430421\"\n" +
                "            }, {\n" +
                "                name: \"衡南县\",\n" +
                "                code: \"430422\"\n" +
                "            }, {\n" +
                "                name: \"衡山县\",\n" +
                "                code: \"430423\"\n" +
                "            }, {\n" +
                "                name: \"衡东县\",\n" +
                "                code: \"430424\"\n" +
                "            }, {\n" +
                "                name: \"祁东县\",\n" +
                "                code: \"430426\"\n" +
                "            }, {\n" +
                "                name: \"耒阳市\",\n" +
                "                code: \"430481\"\n" +
                "            }, {\n" +
                "                name: \"常宁市\",\n" +
                "                code: \"430482\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"邵阳市\",\n" +
                "            code: \"430500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"430501\"\n" +
                "            }, {\n" +
                "                name: \"双清区\",\n" +
                "                code: \"430502\"\n" +
                "            }, {\n" +
                "                name: \"大祥区\",\n" +
                "                code: \"430503\"\n" +
                "            }, {\n" +
                "                name: \"北塔区\",\n" +
                "                code: \"430511\"\n" +
                "            }, {\n" +
                "                name: \"邵东县\",\n" +
                "                code: \"430521\"\n" +
                "            }, {\n" +
                "                name: \"新邵县\",\n" +
                "                code: \"430522\"\n" +
                "            }, {\n" +
                "                name: \"邵阳县\",\n" +
                "                code: \"430523\"\n" +
                "            }, {\n" +
                "                name: \"隆回县\",\n" +
                "                code: \"430524\"\n" +
                "            }, {\n" +
                "                name: \"洞口县\",\n" +
                "                code: \"430525\"\n" +
                "            }, {\n" +
                "                name: \"绥宁县\",\n" +
                "                code: \"430527\"\n" +
                "            }, {\n" +
                "                name: \"新宁县\",\n" +
                "                code: \"430528\"\n" +
                "            }, {\n" +
                "                name: \"城步苗族自治县\",\n" +
                "                code: \"430529\"\n" +
                "            }, {\n" +
                "                name: \"武冈市\",\n" +
                "                code: \"430581\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"岳阳市\",\n" +
                "            code: \"430600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"430601\"\n" +
                "            }, {\n" +
                "                name: \"岳阳楼区\",\n" +
                "                code: \"430602\"\n" +
                "            }, {\n" +
                "                name: \"云溪区\",\n" +
                "                code: \"430603\"\n" +
                "            }, {\n" +
                "                name: \"君山区\",\n" +
                "                code: \"430611\"\n" +
                "            }, {\n" +
                "                name: \"岳阳县\",\n" +
                "                code: \"430621\"\n" +
                "            }, {\n" +
                "                name: \"华容县\",\n" +
                "                code: \"430623\"\n" +
                "            }, {\n" +
                "                name: \"湘阴县\",\n" +
                "                code: \"430624\"\n" +
                "            }, {\n" +
                "                name: \"平江县\",\n" +
                "                code: \"430626\"\n" +
                "            }, {\n" +
                "                name: \"汨罗市\",\n" +
                "                code: \"430681\"\n" +
                "            }, {\n" +
                "                name: \"临湘市\",\n" +
                "                code: \"430682\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"常德市\",\n" +
                "            code: \"430700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"430701\"\n" +
                "            }, {\n" +
                "                name: \"武陵区\",\n" +
                "                code: \"430702\"\n" +
                "            }, {\n" +
                "                name: \"鼎城区\",\n" +
                "                code: \"430703\"\n" +
                "            }, {\n" +
                "                name: \"安乡县\",\n" +
                "                code: \"430721\"\n" +
                "            }, {\n" +
                "                name: \"汉寿县\",\n" +
                "                code: \"430722\"\n" +
                "            }, {\n" +
                "                name: \"澧县\",\n" +
                "                code: \"430723\"\n" +
                "            }, {\n" +
                "                name: \"临澧县\",\n" +
                "                code: \"430724\"\n" +
                "            }, {\n" +
                "                name: \"桃源县\",\n" +
                "                code: \"430725\"\n" +
                "            }, {\n" +
                "                name: \"石门县\",\n" +
                "                code: \"430726\"\n" +
                "            }, {\n" +
                "                name: \"津市市\",\n" +
                "                code: \"430781\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"张家界市\",\n" +
                "            code: \"430800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"430801\"\n" +
                "            }, {\n" +
                "                name: \"永定区\",\n" +
                "                code: \"430802\"\n" +
                "            }, {\n" +
                "                name: \"武陵源区\",\n" +
                "                code: \"430811\"\n" +
                "            }, {\n" +
                "                name: \"慈利县\",\n" +
                "                code: \"430821\"\n" +
                "            }, {\n" +
                "                name: \"桑植县\",\n" +
                "                code: \"430822\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"益阳市\",\n" +
                "            code: \"430900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"430901\"\n" +
                "            }, {\n" +
                "                name: \"资阳区\",\n" +
                "                code: \"430902\"\n" +
                "            }, {\n" +
                "                name: \"赫山区\",\n" +
                "                code: \"430903\"\n" +
                "            }, {\n" +
                "                name: \"南县\",\n" +
                "                code: \"430921\"\n" +
                "            }, {\n" +
                "                name: \"桃江县\",\n" +
                "                code: \"430922\"\n" +
                "            }, {\n" +
                "                name: \"安化县\",\n" +
                "                code: \"430923\"\n" +
                "            }, {\n" +
                "                name: \"沅江市\",\n" +
                "                code: \"430981\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"郴州市\",\n" +
                "            code: \"431000\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"431001\"\n" +
                "            }, {\n" +
                "                name: \"北湖区\",\n" +
                "                code: \"431002\"\n" +
                "            }, {\n" +
                "                name: \"苏仙区\",\n" +
                "                code: \"431003\"\n" +
                "            }, {\n" +
                "                name: \"桂阳县\",\n" +
                "                code: \"431021\"\n" +
                "            }, {\n" +
                "                name: \"宜章县\",\n" +
                "                code: \"431022\"\n" +
                "            }, {\n" +
                "                name: \"永兴县\",\n" +
                "                code: \"431023\"\n" +
                "            }, {\n" +
                "                name: \"嘉禾县\",\n" +
                "                code: \"431024\"\n" +
                "            }, {\n" +
                "                name: \"临武县\",\n" +
                "                code: \"431025\"\n" +
                "            }, {\n" +
                "                name: \"汝城县\",\n" +
                "                code: \"431026\"\n" +
                "            }, {\n" +
                "                name: \"桂东县\",\n" +
                "                code: \"431027\"\n" +
                "            }, {\n" +
                "                name: \"安仁县\",\n" +
                "                code: \"431028\"\n" +
                "            }, {\n" +
                "                name: \"资兴市\",\n" +
                "                code: \"431081\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"永州市\",\n" +
                "            code: \"431100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"431101\"\n" +
                "            }, {\n" +
                "                name: \"零陵区\",\n" +
                "                code: \"431102\"\n" +
                "            }, {\n" +
                "                name: \"冷水滩区\",\n" +
                "                code: \"431103\"\n" +
                "            }, {\n" +
                "                name: \"祁阳县\",\n" +
                "                code: \"431121\"\n" +
                "            }, {\n" +
                "                name: \"东安县\",\n" +
                "                code: \"431122\"\n" +
                "            }, {\n" +
                "                name: \"双牌县\",\n" +
                "                code: \"431123\"\n" +
                "            }, {\n" +
                "                name: \"道县\",\n" +
                "                code: \"431124\"\n" +
                "            }, {\n" +
                "                name: \"江永县\",\n" +
                "                code: \"431125\"\n" +
                "            }, {\n" +
                "                name: \"宁远县\",\n" +
                "                code: \"431126\"\n" +
                "            }, {\n" +
                "                name: \"蓝山县\",\n" +
                "                code: \"431127\"\n" +
                "            }, {\n" +
                "                name: \"新田县\",\n" +
                "                code: \"431128\"\n" +
                "            }, {\n" +
                "                name: \"江华瑶族自治县\",\n" +
                "                code: \"431129\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"怀化市\",\n" +
                "            code: \"431200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"431201\"\n" +
                "            }, {\n" +
                "                name: \"鹤城区\",\n" +
                "                code: \"431202\"\n" +
                "            }, {\n" +
                "                name: \"中方县\",\n" +
                "                code: \"431221\"\n" +
                "            }, {\n" +
                "                name: \"沅陵县\",\n" +
                "                code: \"431222\"\n" +
                "            }, {\n" +
                "                name: \"辰溪县\",\n" +
                "                code: \"431223\"\n" +
                "            }, {\n" +
                "                name: \"溆浦县\",\n" +
                "                code: \"431224\"\n" +
                "            }, {\n" +
                "                name: \"会同县\",\n" +
                "                code: \"431225\"\n" +
                "            }, {\n" +
                "                name: \"麻阳苗族自治县\",\n" +
                "                code: \"431226\"\n" +
                "            }, {\n" +
                "                name: \"新晃侗族自治县\",\n" +
                "                code: \"431227\"\n" +
                "            }, {\n" +
                "                name: \"芷江侗族自治县\",\n" +
                "                code: \"431228\"\n" +
                "            }, {\n" +
                "                name: \"靖州苗族侗族自治县\",\n" +
                "                code: \"431229\"\n" +
                "            }, {\n" +
                "                name: \"通道侗族自治县\",\n" +
                "                code: \"431230\"\n" +
                "            }, {\n" +
                "                name: \"洪江市\",\n" +
                "                code: \"431281\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"娄底市\",\n" +
                "            code: \"431300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"431301\"\n" +
                "            }, {\n" +
                "                name: \"娄星区\",\n" +
                "                code: \"431302\"\n" +
                "            }, {\n" +
                "                name: \"双峰县\",\n" +
                "                code: \"431321\"\n" +
                "            }, {\n" +
                "                name: \"新化县\",\n" +
                "                code: \"431322\"\n" +
                "            }, {\n" +
                "                name: \"冷水江市\",\n" +
                "                code: \"431381\"\n" +
                "            }, {\n" +
                "                name: \"涟源市\",\n" +
                "                code: \"431382\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"湘西土家族苗族自治州\",\n" +
                "            code: \"433100\",\n" +
                "            sub: [{\n" +
                "                name: \"吉首市\",\n" +
                "                code: \"433101\"\n" +
                "            }, {\n" +
                "                name: \"泸溪县\",\n" +
                "                code: \"433122\"\n" +
                "            }, {\n" +
                "                name: \"凤凰县\",\n" +
                "                code: \"433123\"\n" +
                "            }, {\n" +
                "                name: \"花垣县\",\n" +
                "                code: \"433124\"\n" +
                "            }, {\n" +
                "                name: \"保靖县\",\n" +
                "                code: \"433125\"\n" +
                "            }, {\n" +
                "                name: \"古丈县\",\n" +
                "                code: \"433126\"\n" +
                "            }, {\n" +
                "                name: \"永顺县\",\n" +
                "                code: \"433127\"\n" +
                "            }, {\n" +
                "                name: \"龙山县\",\n" +
                "                code: \"433130\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"广东省\",\n" +
                "        code: \"440000\",\n" +
                "        sub: [{\n" +
                "            name: \"广州市\",\n" +
                "            code: \"440100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"440101\"\n" +
                "            }, {\n" +
                "                name: \"荔湾区\",\n" +
                "                code: \"440103\"\n" +
                "            }, {\n" +
                "                name: \"越秀区\",\n" +
                "                code: \"440104\"\n" +
                "            }, {\n" +
                "                name: \"海珠区\",\n" +
                "                code: \"440105\"\n" +
                "            }, {\n" +
                "                name: \"天河区\",\n" +
                "                code: \"440106\"\n" +
                "            }, {\n" +
                "                name: \"白云区\",\n" +
                "                code: \"440111\"\n" +
                "            }, {\n" +
                "                name: \"黄埔区\",\n" +
                "                code: \"440112\"\n" +
                "            }, {\n" +
                "                name: \"番禺区\",\n" +
                "                code: \"440113\"\n" +
                "            }, {\n" +
                "                name: \"花都区\",\n" +
                "                code: \"440114\"\n" +
                "            }, {\n" +
                "                name: \"南沙区\",\n" +
                "                code: \"440115\"\n" +
                "            }, {\n" +
                "                name: \"从化区\",\n" +
                "                code: \"440117\"\n" +
                "            }, {\n" +
                "                name: \"增城区\",\n" +
                "                code: \"440118\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"韶关市\",\n" +
                "            code: \"440200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"440201\"\n" +
                "            }, {\n" +
                "                name: \"武江区\",\n" +
                "                code: \"440203\"\n" +
                "            }, {\n" +
                "                name: \"浈江区\",\n" +
                "                code: \"440204\"\n" +
                "            }, {\n" +
                "                name: \"曲江区\",\n" +
                "                code: \"440205\"\n" +
                "            }, {\n" +
                "                name: \"始兴县\",\n" +
                "                code: \"440222\"\n" +
                "            }, {\n" +
                "                name: \"仁化县\",\n" +
                "                code: \"440224\"\n" +
                "            }, {\n" +
                "                name: \"翁源县\",\n" +
                "                code: \"440229\"\n" +
                "            }, {\n" +
                "                name: \"乳源瑶族自治县\",\n" +
                "                code: \"440232\"\n" +
                "            }, {\n" +
                "                name: \"新丰县\",\n" +
                "                code: \"440233\"\n" +
                "            }, {\n" +
                "                name: \"乐昌市\",\n" +
                "                code: \"440281\"\n" +
                "            }, {\n" +
                "                name: \"南雄市\",\n" +
                "                code: \"440282\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"深圳市\",\n" +
                "            code: \"440300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"440301\"\n" +
                "            }, {\n" +
                "                name: \"罗湖区\",\n" +
                "                code: \"440303\"\n" +
                "            }, {\n" +
                "                name: \"福田区\",\n" +
                "                code: \"440304\"\n" +
                "            }, {\n" +
                "                name: \"南山区\",\n" +
                "                code: \"440305\"\n" +
                "            }, {\n" +
                "                name: \"宝安区\",\n" +
                "                code: \"440306\"\n" +
                "            }, {\n" +
                "                name: \"龙岗区\",\n" +
                "                code: \"440307\"\n" +
                "            }, {\n" +
                "                name: \"盐田区\",\n" +
                "                code: \"440308\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"珠海市\",\n" +
                "            code: \"440400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"440401\"\n" +
                "            }, {\n" +
                "                name: \"香洲区\",\n" +
                "                code: \"440402\"\n" +
                "            }, {\n" +
                "                name: \"斗门区\",\n" +
                "                code: \"440403\"\n" +
                "            }, {\n" +
                "                name: \"金湾区\",\n" +
                "                code: \"440404\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"汕头市\",\n" +
                "            code: \"440500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"440501\"\n" +
                "            }, {\n" +
                "                name: \"龙湖区\",\n" +
                "                code: \"440507\"\n" +
                "            }, {\n" +
                "                name: \"金平区\",\n" +
                "                code: \"440511\"\n" +
                "            }, {\n" +
                "                name: \"濠江区\",\n" +
                "                code: \"440512\"\n" +
                "            }, {\n" +
                "                name: \"潮阳区\",\n" +
                "                code: \"440513\"\n" +
                "            }, {\n" +
                "                name: \"潮南区\",\n" +
                "                code: \"440514\"\n" +
                "            }, {\n" +
                "                name: \"澄海区\",\n" +
                "                code: \"440515\"\n" +
                "            }, {\n" +
                "                name: \"南澳县\",\n" +
                "                code: \"440523\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"佛山市\",\n" +
                "            code: \"440600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"440601\"\n" +
                "            }, {\n" +
                "                name: \"禅城区\",\n" +
                "                code: \"440604\"\n" +
                "            }, {\n" +
                "                name: \"南海区\",\n" +
                "                code: \"440605\"\n" +
                "            }, {\n" +
                "                name: \"顺德区\",\n" +
                "                code: \"440606\"\n" +
                "            }, {\n" +
                "                name: \"三水区\",\n" +
                "                code: \"440607\"\n" +
                "            }, {\n" +
                "                name: \"高明区\",\n" +
                "                code: \"440608\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"江门市\",\n" +
                "            code: \"440700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"440701\"\n" +
                "            }, {\n" +
                "                name: \"蓬江区\",\n" +
                "                code: \"440703\"\n" +
                "            }, {\n" +
                "                name: \"江海区\",\n" +
                "                code: \"440704\"\n" +
                "            }, {\n" +
                "                name: \"新会区\",\n" +
                "                code: \"440705\"\n" +
                "            }, {\n" +
                "                name: \"台山市\",\n" +
                "                code: \"440781\"\n" +
                "            }, {\n" +
                "                name: \"开平市\",\n" +
                "                code: \"440783\"\n" +
                "            }, {\n" +
                "                name: \"鹤山市\",\n" +
                "                code: \"440784\"\n" +
                "            }, {\n" +
                "                name: \"恩平市\",\n" +
                "                code: \"440785\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"湛江市\",\n" +
                "            code: \"440800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"440801\"\n" +
                "            }, {\n" +
                "                name: \"赤坎区\",\n" +
                "                code: \"440802\"\n" +
                "            }, {\n" +
                "                name: \"霞山区\",\n" +
                "                code: \"440803\"\n" +
                "            }, {\n" +
                "                name: \"坡头区\",\n" +
                "                code: \"440804\"\n" +
                "            }, {\n" +
                "                name: \"麻章区\",\n" +
                "                code: \"440811\"\n" +
                "            }, {\n" +
                "                name: \"遂溪县\",\n" +
                "                code: \"440823\"\n" +
                "            }, {\n" +
                "                name: \"徐闻县\",\n" +
                "                code: \"440825\"\n" +
                "            }, {\n" +
                "                name: \"廉江市\",\n" +
                "                code: \"440881\"\n" +
                "            }, {\n" +
                "                name: \"雷州市\",\n" +
                "                code: \"440882\"\n" +
                "            }, {\n" +
                "                name: \"吴川市\",\n" +
                "                code: \"440883\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"茂名市\",\n" +
                "            code: \"440900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"440901\"\n" +
                "            }, {\n" +
                "                name: \"茂南区\",\n" +
                "                code: \"440902\"\n" +
                "            }, {\n" +
                "                name: \"电白区\",\n" +
                "                code: \"440904\"\n" +
                "            }, {\n" +
                "                name: \"高州市\",\n" +
                "                code: \"440981\"\n" +
                "            }, {\n" +
                "                name: \"化州市\",\n" +
                "                code: \"440982\"\n" +
                "            }, {\n" +
                "                name: \"信宜市\",\n" +
                "                code: \"440983\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"肇庆市\",\n" +
                "            code: \"441200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"441201\"\n" +
                "            }, {\n" +
                "                name: \"端州区\",\n" +
                "                code: \"441202\"\n" +
                "            }, {\n" +
                "                name: \"鼎湖区\",\n" +
                "                code: \"441203\"\n" +
                "            }, {\n" +
                "                name: \"广宁县\",\n" +
                "                code: \"441223\"\n" +
                "            }, {\n" +
                "                name: \"怀集县\",\n" +
                "                code: \"441224\"\n" +
                "            }, {\n" +
                "                name: \"封开县\",\n" +
                "                code: \"441225\"\n" +
                "            }, {\n" +
                "                name: \"德庆县\",\n" +
                "                code: \"441226\"\n" +
                "            }, {\n" +
                "                name: \"高要市\",\n" +
                "                code: \"441283\"\n" +
                "            }, {\n" +
                "                name: \"四会市\",\n" +
                "                code: \"441284\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"惠州市\",\n" +
                "            code: \"441300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"441301\"\n" +
                "            }, {\n" +
                "                name: \"惠城区\",\n" +
                "                code: \"441302\"\n" +
                "            }, {\n" +
                "                name: \"惠阳区\",\n" +
                "                code: \"441303\"\n" +
                "            }, {\n" +
                "                name: \"博罗县\",\n" +
                "                code: \"441322\"\n" +
                "            }, {\n" +
                "                name: \"惠东县\",\n" +
                "                code: \"441323\"\n" +
                "            }, {\n" +
                "                name: \"龙门县\",\n" +
                "                code: \"441324\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"梅州市\",\n" +
                "            code: \"441400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"441401\"\n" +
                "            }, {\n" +
                "                name: \"梅江区\",\n" +
                "                code: \"441402\"\n" +
                "            }, {\n" +
                "                name: \"梅县区\",\n" +
                "                code: \"441403\"\n" +
                "            }, {\n" +
                "                name: \"大埔县\",\n" +
                "                code: \"441422\"\n" +
                "            }, {\n" +
                "                name: \"丰顺县\",\n" +
                "                code: \"441423\"\n" +
                "            }, {\n" +
                "                name: \"五华县\",\n" +
                "                code: \"441424\"\n" +
                "            }, {\n" +
                "                name: \"平远县\",\n" +
                "                code: \"441426\"\n" +
                "            }, {\n" +
                "                name: \"蕉岭县\",\n" +
                "                code: \"441427\"\n" +
                "            }, {\n" +
                "                name: \"兴宁市\",\n" +
                "                code: \"441481\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"汕尾市\",\n" +
                "            code: \"441500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"441501\"\n" +
                "            }, {\n" +
                "                name: \"城区\",\n" +
                "                code: \"441502\"\n" +
                "            }, {\n" +
                "                name: \"海丰县\",\n" +
                "                code: \"441521\"\n" +
                "            }, {\n" +
                "                name: \"陆河县\",\n" +
                "                code: \"441523\"\n" +
                "            }, {\n" +
                "                name: \"陆丰市\",\n" +
                "                code: \"441581\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"河源市\",\n" +
                "            code: \"441600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"441601\"\n" +
                "            }, {\n" +
                "                name: \"源城区\",\n" +
                "                code: \"441602\"\n" +
                "            }, {\n" +
                "                name: \"紫金县\",\n" +
                "                code: \"441621\"\n" +
                "            }, {\n" +
                "                name: \"龙川县\",\n" +
                "                code: \"441622\"\n" +
                "            }, {\n" +
                "                name: \"连平县\",\n" +
                "                code: \"441623\"\n" +
                "            }, {\n" +
                "                name: \"和平县\",\n" +
                "                code: \"441624\"\n" +
                "            }, {\n" +
                "                name: \"东源县\",\n" +
                "                code: \"441625\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"阳江市\",\n" +
                "            code: \"441700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"441701\"\n" +
                "            }, {\n" +
                "                name: \"江城区\",\n" +
                "                code: \"441702\"\n" +
                "            }, {\n" +
                "                name: \"阳东区\",\n" +
                "                code: \"441704\"\n" +
                "            }, {\n" +
                "                name: \"阳西县\",\n" +
                "                code: \"441721\"\n" +
                "            }, {\n" +
                "                name: \"阳春市\",\n" +
                "                code: \"441781\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"清远市\",\n" +
                "            code: \"441800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"441801\"\n" +
                "            }, {\n" +
                "                name: \"清城区\",\n" +
                "                code: \"441802\"\n" +
                "            }, {\n" +
                "                name: \"清新区\",\n" +
                "                code: \"441803\"\n" +
                "            }, {\n" +
                "                name: \"佛冈县\",\n" +
                "                code: \"441821\"\n" +
                "            }, {\n" +
                "                name: \"阳山县\",\n" +
                "                code: \"441823\"\n" +
                "            }, {\n" +
                "                name: \"连山壮族瑶族自治县\",\n" +
                "                code: \"441825\"\n" +
                "            }, {\n" +
                "                name: \"连南瑶族自治县\",\n" +
                "                code: \"441826\"\n" +
                "            }, {\n" +
                "                name: \"英德市\",\n" +
                "                code: \"441881\"\n" +
                "            }, {\n" +
                "                name: \"连州市\",\n" +
                "                code: \"441882\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"东莞市\",\n" +
                "            code: \"441900\",\n" +
                "            sub: []\n" +
                "        }, {\n" +
                "            name: \"中山市\",\n" +
                "            code: \"442000\",\n" +
                "            sub: []\n" +
                "        }, {\n" +
                "            name: \"潮州市\",\n" +
                "            code: \"445100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"445101\"\n" +
                "            }, {\n" +
                "                name: \"湘桥区\",\n" +
                "                code: \"445102\"\n" +
                "            }, {\n" +
                "                name: \"潮安区\",\n" +
                "                code: \"445103\"\n" +
                "            }, {\n" +
                "                name: \"饶平县\",\n" +
                "                code: \"445122\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"揭阳市\",\n" +
                "            code: \"445200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"445201\"\n" +
                "            }, {\n" +
                "                name: \"榕城区\",\n" +
                "                code: \"445202\"\n" +
                "            }, {\n" +
                "                name: \"揭东区\",\n" +
                "                code: \"445203\"\n" +
                "            }, {\n" +
                "                name: \"揭西县\",\n" +
                "                code: \"445222\"\n" +
                "            }, {\n" +
                "                name: \"惠来县\",\n" +
                "                code: \"445224\"\n" +
                "            }, {\n" +
                "                name: \"普宁市\",\n" +
                "                code: \"445281\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"云浮市\",\n" +
                "            code: \"445300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"445301\"\n" +
                "            }, {\n" +
                "                name: \"云城区\",\n" +
                "                code: \"445302\"\n" +
                "            }, {\n" +
                "                name: \"云安区\",\n" +
                "                code: \"445303\"\n" +
                "            }, {\n" +
                "                name: \"新兴县\",\n" +
                "                code: \"445321\"\n" +
                "            }, {\n" +
                "                name: \"郁南县\",\n" +
                "                code: \"445322\"\n" +
                "            }, {\n" +
                "                name: \"罗定市\",\n" +
                "                code: \"445381\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"广西壮族自治区\",\n" +
                "        code: \"450000\",\n" +
                "        sub: [{\n" +
                "            name: \"南宁市\",\n" +
                "            code: \"450100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"450101\"\n" +
                "            }, {\n" +
                "                name: \"兴宁区\",\n" +
                "                code: \"450102\"\n" +
                "            }, {\n" +
                "                name: \"青秀区\",\n" +
                "                code: \"450103\"\n" +
                "            }, {\n" +
                "                name: \"江南区\",\n" +
                "                code: \"450105\"\n" +
                "            }, {\n" +
                "                name: \"西乡塘区\",\n" +
                "                code: \"450107\"\n" +
                "            }, {\n" +
                "                name: \"良庆区\",\n" +
                "                code: \"450108\"\n" +
                "            }, {\n" +
                "                name: \"邕宁区\",\n" +
                "                code: \"450109\"\n" +
                "            }, {\n" +
                "                name: \"武鸣县\",\n" +
                "                code: \"450122\"\n" +
                "            }, {\n" +
                "                name: \"隆安县\",\n" +
                "                code: \"450123\"\n" +
                "            }, {\n" +
                "                name: \"马山县\",\n" +
                "                code: \"450124\"\n" +
                "            }, {\n" +
                "                name: \"上林县\",\n" +
                "                code: \"450125\"\n" +
                "            }, {\n" +
                "                name: \"宾阳县\",\n" +
                "                code: \"450126\"\n" +
                "            }, {\n" +
                "                name: \"横县\",\n" +
                "                code: \"450127\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"柳州市\",\n" +
                "            code: \"450200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"450201\"\n" +
                "            }, {\n" +
                "                name: \"城中区\",\n" +
                "                code: \"450202\"\n" +
                "            }, {\n" +
                "                name: \"鱼峰区\",\n" +
                "                code: \"450203\"\n" +
                "            }, {\n" +
                "                name: \"柳南区\",\n" +
                "                code: \"450204\"\n" +
                "            }, {\n" +
                "                name: \"柳北区\",\n" +
                "                code: \"450205\"\n" +
                "            }, {\n" +
                "                name: \"柳江县\",\n" +
                "                code: \"450221\"\n" +
                "            }, {\n" +
                "                name: \"柳城县\",\n" +
                "                code: \"450222\"\n" +
                "            }, {\n" +
                "                name: \"鹿寨县\",\n" +
                "                code: \"450223\"\n" +
                "            }, {\n" +
                "                name: \"融安县\",\n" +
                "                code: \"450224\"\n" +
                "            }, {\n" +
                "                name: \"融水苗族自治县\",\n" +
                "                code: \"450225\"\n" +
                "            }, {\n" +
                "                name: \"三江侗族自治县\",\n" +
                "                code: \"450226\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"桂林市\",\n" +
                "            code: \"450300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"450301\"\n" +
                "            }, {\n" +
                "                name: \"秀峰区\",\n" +
                "                code: \"450302\"\n" +
                "            }, {\n" +
                "                name: \"叠彩区\",\n" +
                "                code: \"450303\"\n" +
                "            }, {\n" +
                "                name: \"象山区\",\n" +
                "                code: \"450304\"\n" +
                "            }, {\n" +
                "                name: \"七星区\",\n" +
                "                code: \"450305\"\n" +
                "            }, {\n" +
                "                name: \"雁山区\",\n" +
                "                code: \"450311\"\n" +
                "            }, {\n" +
                "                name: \"临桂区\",\n" +
                "                code: \"450312\"\n" +
                "            }, {\n" +
                "                name: \"阳朔县\",\n" +
                "                code: \"450321\"\n" +
                "            }, {\n" +
                "                name: \"灵川县\",\n" +
                "                code: \"450323\"\n" +
                "            }, {\n" +
                "                name: \"全州县\",\n" +
                "                code: \"450324\"\n" +
                "            }, {\n" +
                "                name: \"兴安县\",\n" +
                "                code: \"450325\"\n" +
                "            }, {\n" +
                "                name: \"永福县\",\n" +
                "                code: \"450326\"\n" +
                "            }, {\n" +
                "                name: \"灌阳县\",\n" +
                "                code: \"450327\"\n" +
                "            }, {\n" +
                "                name: \"龙胜各族自治县\",\n" +
                "                code: \"450328\"\n" +
                "            }, {\n" +
                "                name: \"资源县\",\n" +
                "                code: \"450329\"\n" +
                "            }, {\n" +
                "                name: \"平乐县\",\n" +
                "                code: \"450330\"\n" +
                "            }, {\n" +
                "                name: \"荔浦县\",\n" +
                "                code: \"450331\"\n" +
                "            }, {\n" +
                "                name: \"恭城瑶族自治县\",\n" +
                "                code: \"450332\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"梧州市\",\n" +
                "            code: \"450400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"450401\"\n" +
                "            }, {\n" +
                "                name: \"万秀区\",\n" +
                "                code: \"450403\"\n" +
                "            }, {\n" +
                "                name: \"长洲区\",\n" +
                "                code: \"450405\"\n" +
                "            }, {\n" +
                "                name: \"龙圩区\",\n" +
                "                code: \"450406\"\n" +
                "            }, {\n" +
                "                name: \"苍梧县\",\n" +
                "                code: \"450421\"\n" +
                "            }, {\n" +
                "                name: \"藤县\",\n" +
                "                code: \"450422\"\n" +
                "            }, {\n" +
                "                name: \"蒙山县\",\n" +
                "                code: \"450423\"\n" +
                "            }, {\n" +
                "                name: \"岑溪市\",\n" +
                "                code: \"450481\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"北海市\",\n" +
                "            code: \"450500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"450501\"\n" +
                "            }, {\n" +
                "                name: \"海城区\",\n" +
                "                code: \"450502\"\n" +
                "            }, {\n" +
                "                name: \"银海区\",\n" +
                "                code: \"450503\"\n" +
                "            }, {\n" +
                "                name: \"铁山港区\",\n" +
                "                code: \"450512\"\n" +
                "            }, {\n" +
                "                name: \"合浦县\",\n" +
                "                code: \"450521\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"防城港市\",\n" +
                "            code: \"450600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"450601\"\n" +
                "            }, {\n" +
                "                name: \"港口区\",\n" +
                "                code: \"450602\"\n" +
                "            }, {\n" +
                "                name: \"防城区\",\n" +
                "                code: \"450603\"\n" +
                "            }, {\n" +
                "                name: \"上思县\",\n" +
                "                code: \"450621\"\n" +
                "            }, {\n" +
                "                name: \"东兴市\",\n" +
                "                code: \"450681\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"钦州市\",\n" +
                "            code: \"450700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"450701\"\n" +
                "            }, {\n" +
                "                name: \"钦南区\",\n" +
                "                code: \"450702\"\n" +
                "            }, {\n" +
                "                name: \"钦北区\",\n" +
                "                code: \"450703\"\n" +
                "            }, {\n" +
                "                name: \"灵山县\",\n" +
                "                code: \"450721\"\n" +
                "            }, {\n" +
                "                name: \"浦北县\",\n" +
                "                code: \"450722\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"贵港市\",\n" +
                "            code: \"450800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"450801\"\n" +
                "            }, {\n" +
                "                name: \"港北区\",\n" +
                "                code: \"450802\"\n" +
                "            }, {\n" +
                "                name: \"港南区\",\n" +
                "                code: \"450803\"\n" +
                "            }, {\n" +
                "                name: \"覃塘区\",\n" +
                "                code: \"450804\"\n" +
                "            }, {\n" +
                "                name: \"平南县\",\n" +
                "                code: \"450821\"\n" +
                "            }, {\n" +
                "                name: \"桂平市\",\n" +
                "                code: \"450881\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"玉林市\",\n" +
                "            code: \"450900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"450901\"\n" +
                "            }, {\n" +
                "                name: \"玉州区\",\n" +
                "                code: \"450902\"\n" +
                "            }, {\n" +
                "                name: \"福绵区\",\n" +
                "                code: \"450903\"\n" +
                "            }, {\n" +
                "                name: \"容县\",\n" +
                "                code: \"450921\"\n" +
                "            }, {\n" +
                "                name: \"陆川县\",\n" +
                "                code: \"450922\"\n" +
                "            }, {\n" +
                "                name: \"博白县\",\n" +
                "                code: \"450923\"\n" +
                "            }, {\n" +
                "                name: \"兴业县\",\n" +
                "                code: \"450924\"\n" +
                "            }, {\n" +
                "                name: \"北流市\",\n" +
                "                code: \"450981\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"百色市\",\n" +
                "            code: \"451000\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"451001\"\n" +
                "            }, {\n" +
                "                name: \"右江区\",\n" +
                "                code: \"451002\"\n" +
                "            }, {\n" +
                "                name: \"田阳县\",\n" +
                "                code: \"451021\"\n" +
                "            }, {\n" +
                "                name: \"田东县\",\n" +
                "                code: \"451022\"\n" +
                "            }, {\n" +
                "                name: \"平果县\",\n" +
                "                code: \"451023\"\n" +
                "            }, {\n" +
                "                name: \"德保县\",\n" +
                "                code: \"451024\"\n" +
                "            }, {\n" +
                "                name: \"靖西县\",\n" +
                "                code: \"451025\"\n" +
                "            }, {\n" +
                "                name: \"那坡县\",\n" +
                "                code: \"451026\"\n" +
                "            }, {\n" +
                "                name: \"凌云县\",\n" +
                "                code: \"451027\"\n" +
                "            }, {\n" +
                "                name: \"乐业县\",\n" +
                "                code: \"451028\"\n" +
                "            }, {\n" +
                "                name: \"田林县\",\n" +
                "                code: \"451029\"\n" +
                "            }, {\n" +
                "                name: \"西林县\",\n" +
                "                code: \"451030\"\n" +
                "            }, {\n" +
                "                name: \"隆林各族自治县\",\n" +
                "                code: \"451031\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"贺州市\",\n" +
                "            code: \"451100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"451101\"\n" +
                "            }, {\n" +
                "                name: \"八步区\",\n" +
                "                code: \"451102\"\n" +
                "            }, {\n" +
                "                name: \"平桂管理区\",\n" +
                "                code: \"451119\"\n" +
                "            }, {\n" +
                "                name: \"昭平县\",\n" +
                "                code: \"451121\"\n" +
                "            }, {\n" +
                "                name: \"钟山县\",\n" +
                "                code: \"451122\"\n" +
                "            }, {\n" +
                "                name: \"富川瑶族自治县\",\n" +
                "                code: \"451123\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"河池市\",\n" +
                "            code: \"451200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"451201\"\n" +
                "            }, {\n" +
                "                name: \"金城江区\",\n" +
                "                code: \"451202\"\n" +
                "            }, {\n" +
                "                name: \"南丹县\",\n" +
                "                code: \"451221\"\n" +
                "            }, {\n" +
                "                name: \"天峨县\",\n" +
                "                code: \"451222\"\n" +
                "            }, {\n" +
                "                name: \"凤山县\",\n" +
                "                code: \"451223\"\n" +
                "            }, {\n" +
                "                name: \"东兰县\",\n" +
                "                code: \"451224\"\n" +
                "            }, {\n" +
                "                name: \"罗城仫佬族自治县\",\n" +
                "                code: \"451225\"\n" +
                "            }, {\n" +
                "                name: \"环江毛南族自治县\",\n" +
                "                code: \"451226\"\n" +
                "            }, {\n" +
                "                name: \"巴马瑶族自治县\",\n" +
                "                code: \"451227\"\n" +
                "            }, {\n" +
                "                name: \"都安瑶族自治县\",\n" +
                "                code: \"451228\"\n" +
                "            }, {\n" +
                "                name: \"大化瑶族自治县\",\n" +
                "                code: \"451229\"\n" +
                "            }, {\n" +
                "                name: \"宜州市\",\n" +
                "                code: \"451281\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"来宾市\",\n" +
                "            code: \"451300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"451301\"\n" +
                "            }, {\n" +
                "                name: \"兴宾区\",\n" +
                "                code: \"451302\"\n" +
                "            }, {\n" +
                "                name: \"忻城县\",\n" +
                "                code: \"451321\"\n" +
                "            }, {\n" +
                "                name: \"象州县\",\n" +
                "                code: \"451322\"\n" +
                "            }, {\n" +
                "                name: \"武宣县\",\n" +
                "                code: \"451323\"\n" +
                "            }, {\n" +
                "                name: \"金秀瑶族自治县\",\n" +
                "                code: \"451324\"\n" +
                "            }, {\n" +
                "                name: \"合山市\",\n" +
                "                code: \"451381\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"崇左市\",\n" +
                "            code: \"451400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"451401\"\n" +
                "            }, {\n" +
                "                name: \"江州区\",\n" +
                "                code: \"451402\"\n" +
                "            }, {\n" +
                "                name: \"扶绥县\",\n" +
                "                code: \"451421\"\n" +
                "            }, {\n" +
                "                name: \"宁明县\",\n" +
                "                code: \"451422\"\n" +
                "            }, {\n" +
                "                name: \"龙州县\",\n" +
                "                code: \"451423\"\n" +
                "            }, {\n" +
                "                name: \"大新县\",\n" +
                "                code: \"451424\"\n" +
                "            }, {\n" +
                "                name: \"天等县\",\n" +
                "                code: \"451425\"\n" +
                "            }, {\n" +
                "                name: \"凭祥市\",\n" +
                "                code: \"451481\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"海南省\",\n" +
                "        code: \"460000\",\n" +
                "        sub: [{\n" +
                "            name: \"海口市\",\n" +
                "            code: \"460100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"460101\"\n" +
                "            }, {\n" +
                "                name: \"秀英区\",\n" +
                "                code: \"460105\"\n" +
                "            }, {\n" +
                "                name: \"龙华区\",\n" +
                "                code: \"460106\"\n" +
                "            }, {\n" +
                "                name: \"琼山区\",\n" +
                "                code: \"460107\"\n" +
                "            }, {\n" +
                "                name: \"美兰区\",\n" +
                "                code: \"460108\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"三亚市\",\n" +
                "            code: \"460200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"460201\"\n" +
                "            }, {\n" +
                "                name: \"海棠区\",\n" +
                "                code: \"460202\"\n" +
                "            }, {\n" +
                "                name: \"吉阳区\",\n" +
                "                code: \"460203\"\n" +
                "            }, {\n" +
                "                name: \"天涯区\",\n" +
                "                code: \"460204\"\n" +
                "            }, {\n" +
                "                name: \"崖州区\",\n" +
                "                code: \"460205\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"三沙市\",\n" +
                "            code: \"460300\",\n" +
                "            sub: [{\n" +
                "                name: \"西沙群岛\",\n" +
                "                code: \"460321\"\n" +
                "            }, {\n" +
                "                name: \"南沙群岛\",\n" +
                "                code: \"460322\"\n" +
                "            }, {\n" +
                "                name: \"中沙群岛的岛礁及其海域\",\n" +
                "                code: \"460323\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"五指山市\",\n" +
                "            code: \"469001\"\n" +
                "        }, {\n" +
                "            name: \"琼海市\",\n" +
                "            code: \"469002\"\n" +
                "        }, {\n" +
                "            name: \"儋州市\",\n" +
                "            code: \"469003\"\n" +
                "        }, {\n" +
                "            name: \"文昌市\",\n" +
                "            code: \"469005\"\n" +
                "        }, {\n" +
                "            name: \"万宁市\",\n" +
                "            code: \"469006\"\n" +
                "        }, {\n" +
                "            name: \"东方市\",\n" +
                "            code: \"469007\"\n" +
                "        }, {\n" +
                "            name: \"定安县\",\n" +
                "            code: \"469021\"\n" +
                "        }, {\n" +
                "            name: \"屯昌县\",\n" +
                "            code: \"469022\"\n" +
                "        }, {\n" +
                "            name: \"澄迈县\",\n" +
                "            code: \"469023\"\n" +
                "        }, {\n" +
                "            name: \"临高县\",\n" +
                "            code: \"469024\"\n" +
                "        }, {\n" +
                "            name: \"白沙黎族自治县\",\n" +
                "            code: \"469025\"\n" +
                "        }, {\n" +
                "            name: \"昌江黎族自治县\",\n" +
                "            code: \"469026\"\n" +
                "        }, {\n" +
                "            name: \"乐东黎族自治县\",\n" +
                "            code: \"469027\"\n" +
                "        }, {\n" +
                "            name: \"陵水黎族自治县\",\n" +
                "            code: \"469028\"\n" +
                "        }, {\n" +
                "            name: \"保亭黎族苗族自治县\",\n" +
                "            code: \"469029\"\n" +
                "        }, {\n" +
                "            name: \"琼中黎族苗族自治县\",\n" +
                "            code: \"469030\"\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"重庆\",\n" +
                "        code: \"500000\",\n" +
                "        sub: [{\n" +
                "            name: \"重庆市\",\n" +
                "            code: \"500000\",\n" +
                "            sub: [{\n" +
                "                name: \"万州区\",\n" +
                "                code: \"500101\"\n" +
                "            }, {\n" +
                "                name: \"涪陵区\",\n" +
                "                code: \"500102\"\n" +
                "            }, {\n" +
                "                name: \"渝中区\",\n" +
                "                code: \"500103\"\n" +
                "            }, {\n" +
                "                name: \"大渡口区\",\n" +
                "                code: \"500104\"\n" +
                "            }, {\n" +
                "                name: \"江北区\",\n" +
                "                code: \"500105\"\n" +
                "            }, {\n" +
                "                name: \"沙坪坝区\",\n" +
                "                code: \"500106\"\n" +
                "            }, {\n" +
                "                name: \"九龙坡区\",\n" +
                "                code: \"500107\"\n" +
                "            }, {\n" +
                "                name: \"南岸区\",\n" +
                "                code: \"500108\"\n" +
                "            }, {\n" +
                "                name: \"北碚区\",\n" +
                "                code: \"500109\"\n" +
                "            }, {\n" +
                "                name: \"綦江区\",\n" +
                "                code: \"500110\"\n" +
                "            }, {\n" +
                "                name: \"大足区\",\n" +
                "                code: \"500111\"\n" +
                "            }, {\n" +
                "                name: \"渝北区\",\n" +
                "                code: \"500112\"\n" +
                "            }, {\n" +
                "                name: \"巴南区\",\n" +
                "                code: \"500113\"\n" +
                "            }, {\n" +
                "                name: \"黔江区\",\n" +
                "                code: \"500114\"\n" +
                "            }, {\n" +
                "                name: \"长寿区\",\n" +
                "                code: \"500115\"\n" +
                "            }, {\n" +
                "                name: \"江津区\",\n" +
                "                code: \"500116\"\n" +
                "            }, {\n" +
                "                name: \"合川区\",\n" +
                "                code: \"500117\"\n" +
                "            }, {\n" +
                "                name: \"永川区\",\n" +
                "                code: \"500118\"\n" +
                "            }, {\n" +
                "                name: \"南川区\",\n" +
                "                code: \"500119\"\n" +
                "            }, {\n" +
                "                name: \"璧山区\",\n" +
                "                code: \"500120\"\n" +
                "            }, {\n" +
                "                name: \"铜梁区\",\n" +
                "                code: \"500151\"\n" +
                "            }, {\n" +
                "                name: \"潼南县\",\n" +
                "                code: \"500223\"\n" +
                "            }, {\n" +
                "                name: \"荣昌县\",\n" +
                "                code: \"500226\"\n" +
                "            }, {\n" +
                "                name: \"梁平县\",\n" +
                "                code: \"500228\"\n" +
                "            }, {\n" +
                "                name: \"城口县\",\n" +
                "                code: \"500229\"\n" +
                "            }, {\n" +
                "                name: \"丰都县\",\n" +
                "                code: \"500230\"\n" +
                "            }, {\n" +
                "                name: \"垫江县\",\n" +
                "                code: \"500231\"\n" +
                "            }, {\n" +
                "                name: \"武隆县\",\n" +
                "                code: \"500232\"\n" +
                "            }, {\n" +
                "                name: \"忠县\",\n" +
                "                code: \"500233\"\n" +
                "            }, {\n" +
                "                name: \"开县\",\n" +
                "                code: \"500234\"\n" +
                "            }, {\n" +
                "                name: \"云阳县\",\n" +
                "                code: \"500235\"\n" +
                "            }, {\n" +
                "                name: \"奉节县\",\n" +
                "                code: \"500236\"\n" +
                "            }, {\n" +
                "                name: \"巫山县\",\n" +
                "                code: \"500237\"\n" +
                "            }, {\n" +
                "                name: \"巫溪县\",\n" +
                "                code: \"500238\"\n" +
                "            }, {\n" +
                "                name: \"石柱土家族自治县\",\n" +
                "                code: \"500240\"\n" +
                "            }, {\n" +
                "                name: \"秀山土家族苗族自治县\",\n" +
                "                code: \"500241\"\n" +
                "            }, {\n" +
                "                name: \"酉阳土家族苗族自治县\",\n" +
                "                code: \"500242\"\n" +
                "            }, {\n" +
                "                name: \"彭水苗族土家族自治县\",\n" +
                "                code: \"500243\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"四川省\",\n" +
                "        code: \"510000\",\n" +
                "        sub: [{\n" +
                "            name: \"成都市\",\n" +
                "            code: \"510100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"510101\"\n" +
                "            }, {\n" +
                "                name: \"锦江区\",\n" +
                "                code: \"510104\"\n" +
                "            }, {\n" +
                "                name: \"青羊区\",\n" +
                "                code: \"510105\"\n" +
                "            }, {\n" +
                "                name: \"金牛区\",\n" +
                "                code: \"510106\"\n" +
                "            }, {\n" +
                "                name: \"武侯区\",\n" +
                "                code: \"510107\"\n" +
                "            }, {\n" +
                "                name: \"成华区\",\n" +
                "                code: \"510108\"\n" +
                "            }, {\n" +
                "                name: \"龙泉驿区\",\n" +
                "                code: \"510112\"\n" +
                "            }, {\n" +
                "                name: \"青白江区\",\n" +
                "                code: \"510113\"\n" +
                "            }, {\n" +
                "                name: \"新都区\",\n" +
                "                code: \"510114\"\n" +
                "            }, {\n" +
                "                name: \"温江区\",\n" +
                "                code: \"510115\"\n" +
                "            }, {\n" +
                "                name: \"金堂县\",\n" +
                "                code: \"510121\"\n" +
                "            }, {\n" +
                "                name: \"双流县\",\n" +
                "                code: \"510122\"\n" +
                "            }, {\n" +
                "                name: \"郫县\",\n" +
                "                code: \"510124\"\n" +
                "            }, {\n" +
                "                name: \"大邑县\",\n" +
                "                code: \"510129\"\n" +
                "            }, {\n" +
                "                name: \"蒲江县\",\n" +
                "                code: \"510131\"\n" +
                "            }, {\n" +
                "                name: \"新津县\",\n" +
                "                code: \"510132\"\n" +
                "            }, {\n" +
                "                name: \"都江堰市\",\n" +
                "                code: \"510181\"\n" +
                "            }, {\n" +
                "                name: \"彭州市\",\n" +
                "                code: \"510182\"\n" +
                "            }, {\n" +
                "                name: \"邛崃市\",\n" +
                "                code: \"510183\"\n" +
                "            }, {\n" +
                "                name: \"崇州市\",\n" +
                "                code: \"510184\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"自贡市\",\n" +
                "            code: \"510300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"510301\"\n" +
                "            }, {\n" +
                "                name: \"自流井区\",\n" +
                "                code: \"510302\"\n" +
                "            }, {\n" +
                "                name: \"贡井区\",\n" +
                "                code: \"510303\"\n" +
                "            }, {\n" +
                "                name: \"大安区\",\n" +
                "                code: \"510304\"\n" +
                "            }, {\n" +
                "                name: \"沿滩区\",\n" +
                "                code: \"510311\"\n" +
                "            }, {\n" +
                "                name: \"荣县\",\n" +
                "                code: \"510321\"\n" +
                "            }, {\n" +
                "                name: \"富顺县\",\n" +
                "                code: \"510322\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"攀枝花市\",\n" +
                "            code: \"510400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"510401\"\n" +
                "            }, {\n" +
                "                name: \"东区\",\n" +
                "                code: \"510402\"\n" +
                "            }, {\n" +
                "                name: \"西区\",\n" +
                "                code: \"510403\"\n" +
                "            }, {\n" +
                "                name: \"仁和区\",\n" +
                "                code: \"510411\"\n" +
                "            }, {\n" +
                "                name: \"米易县\",\n" +
                "                code: \"510421\"\n" +
                "            }, {\n" +
                "                name: \"盐边县\",\n" +
                "                code: \"510422\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"泸州市\",\n" +
                "            code: \"510500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"510501\"\n" +
                "            }, {\n" +
                "                name: \"江阳区\",\n" +
                "                code: \"510502\"\n" +
                "            }, {\n" +
                "                name: \"纳溪区\",\n" +
                "                code: \"510503\"\n" +
                "            }, {\n" +
                "                name: \"龙马潭区\",\n" +
                "                code: \"510504\"\n" +
                "            }, {\n" +
                "                name: \"泸县\",\n" +
                "                code: \"510521\"\n" +
                "            }, {\n" +
                "                name: \"合江县\",\n" +
                "                code: \"510522\"\n" +
                "            }, {\n" +
                "                name: \"叙永县\",\n" +
                "                code: \"510524\"\n" +
                "            }, {\n" +
                "                name: \"古蔺县\",\n" +
                "                code: \"510525\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"德阳市\",\n" +
                "            code: \"510600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"510601\"\n" +
                "            }, {\n" +
                "                name: \"旌阳区\",\n" +
                "                code: \"510603\"\n" +
                "            }, {\n" +
                "                name: \"中江县\",\n" +
                "                code: \"510623\"\n" +
                "            }, {\n" +
                "                name: \"罗江县\",\n" +
                "                code: \"510626\"\n" +
                "            }, {\n" +
                "                name: \"广汉市\",\n" +
                "                code: \"510681\"\n" +
                "            }, {\n" +
                "                name: \"什邡市\",\n" +
                "                code: \"510682\"\n" +
                "            }, {\n" +
                "                name: \"绵竹市\",\n" +
                "                code: \"510683\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"绵阳市\",\n" +
                "            code: \"510700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"510701\"\n" +
                "            }, {\n" +
                "                name: \"涪城区\",\n" +
                "                code: \"510703\"\n" +
                "            }, {\n" +
                "                name: \"游仙区\",\n" +
                "                code: \"510704\"\n" +
                "            }, {\n" +
                "                name: \"三台县\",\n" +
                "                code: \"510722\"\n" +
                "            }, {\n" +
                "                name: \"盐亭县\",\n" +
                "                code: \"510723\"\n" +
                "            }, {\n" +
                "                name: \"安县\",\n" +
                "                code: \"510724\"\n" +
                "            }, {\n" +
                "                name: \"梓潼县\",\n" +
                "                code: \"510725\"\n" +
                "            }, {\n" +
                "                name: \"北川羌族自治县\",\n" +
                "                code: \"510726\"\n" +
                "            }, {\n" +
                "                name: \"平武县\",\n" +
                "                code: \"510727\"\n" +
                "            }, {\n" +
                "                name: \"江油市\",\n" +
                "                code: \"510781\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"广元市\",\n" +
                "            code: \"510800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"510801\"\n" +
                "            }, {\n" +
                "                name: \"利州区\",\n" +
                "                code: \"510802\"\n" +
                "            }, {\n" +
                "                name: \"昭化区\",\n" +
                "                code: \"510811\"\n" +
                "            }, {\n" +
                "                name: \"朝天区\",\n" +
                "                code: \"510812\"\n" +
                "            }, {\n" +
                "                name: \"旺苍县\",\n" +
                "                code: \"510821\"\n" +
                "            }, {\n" +
                "                name: \"青川县\",\n" +
                "                code: \"510822\"\n" +
                "            }, {\n" +
                "                name: \"剑阁县\",\n" +
                "                code: \"510823\"\n" +
                "            }, {\n" +
                "                name: \"苍溪县\",\n" +
                "                code: \"510824\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"遂宁市\",\n" +
                "            code: \"510900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"510901\"\n" +
                "            }, {\n" +
                "                name: \"船山区\",\n" +
                "                code: \"510903\"\n" +
                "            }, {\n" +
                "                name: \"安居区\",\n" +
                "                code: \"510904\"\n" +
                "            }, {\n" +
                "                name: \"蓬溪县\",\n" +
                "                code: \"510921\"\n" +
                "            }, {\n" +
                "                name: \"射洪县\",\n" +
                "                code: \"510922\"\n" +
                "            }, {\n" +
                "                name: \"大英县\",\n" +
                "                code: \"510923\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"内江市\",\n" +
                "            code: \"511000\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"511001\"\n" +
                "            }, {\n" +
                "                name: \"市中区\",\n" +
                "                code: \"511002\"\n" +
                "            }, {\n" +
                "                name: \"东兴区\",\n" +
                "                code: \"511011\"\n" +
                "            }, {\n" +
                "                name: \"威远县\",\n" +
                "                code: \"511024\"\n" +
                "            }, {\n" +
                "                name: \"资中县\",\n" +
                "                code: \"511025\"\n" +
                "            }, {\n" +
                "                name: \"隆昌县\",\n" +
                "                code: \"511028\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"乐山市\",\n" +
                "            code: \"511100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"511101\"\n" +
                "            }, {\n" +
                "                name: \"市中区\",\n" +
                "                code: \"511102\"\n" +
                "            }, {\n" +
                "                name: \"沙湾区\",\n" +
                "                code: \"511111\"\n" +
                "            }, {\n" +
                "                name: \"五通桥区\",\n" +
                "                code: \"511112\"\n" +
                "            }, {\n" +
                "                name: \"金口河区\",\n" +
                "                code: \"511113\"\n" +
                "            }, {\n" +
                "                name: \"犍为县\",\n" +
                "                code: \"511123\"\n" +
                "            }, {\n" +
                "                name: \"井研县\",\n" +
                "                code: \"511124\"\n" +
                "            }, {\n" +
                "                name: \"夹江县\",\n" +
                "                code: \"511126\"\n" +
                "            }, {\n" +
                "                name: \"沐川县\",\n" +
                "                code: \"511129\"\n" +
                "            }, {\n" +
                "                name: \"峨边彝族自治县\",\n" +
                "                code: \"511132\"\n" +
                "            }, {\n" +
                "                name: \"马边彝族自治县\",\n" +
                "                code: \"511133\"\n" +
                "            }, {\n" +
                "                name: \"峨眉山市\",\n" +
                "                code: \"511181\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"南充市\",\n" +
                "            code: \"511300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"511301\"\n" +
                "            }, {\n" +
                "                name: \"顺庆区\",\n" +
                "                code: \"511302\"\n" +
                "            }, {\n" +
                "                name: \"高坪区\",\n" +
                "                code: \"511303\"\n" +
                "            }, {\n" +
                "                name: \"嘉陵区\",\n" +
                "                code: \"511304\"\n" +
                "            }, {\n" +
                "                name: \"南部县\",\n" +
                "                code: \"511321\"\n" +
                "            }, {\n" +
                "                name: \"营山县\",\n" +
                "                code: \"511322\"\n" +
                "            }, {\n" +
                "                name: \"蓬安县\",\n" +
                "                code: \"511323\"\n" +
                "            }, {\n" +
                "                name: \"仪陇县\",\n" +
                "                code: \"511324\"\n" +
                "            }, {\n" +
                "                name: \"西充县\",\n" +
                "                code: \"511325\"\n" +
                "            }, {\n" +
                "                name: \"阆中市\",\n" +
                "                code: \"511381\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"眉山市\",\n" +
                "            code: \"511400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"511401\"\n" +
                "            }, {\n" +
                "                name: \"东坡区\",\n" +
                "                code: \"511402\"\n" +
                "            }, {\n" +
                "                name: \"彭山区\",\n" +
                "                code: \"511403\"\n" +
                "            }, {\n" +
                "                name: \"仁寿县\",\n" +
                "                code: \"511421\"\n" +
                "            }, {\n" +
                "                name: \"洪雅县\",\n" +
                "                code: \"511423\"\n" +
                "            }, {\n" +
                "                name: \"丹棱县\",\n" +
                "                code: \"511424\"\n" +
                "            }, {\n" +
                "                name: \"青神县\",\n" +
                "                code: \"511425\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"宜宾市\",\n" +
                "            code: \"511500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"511501\"\n" +
                "            }, {\n" +
                "                name: \"翠屏区\",\n" +
                "                code: \"511502\"\n" +
                "            }, {\n" +
                "                name: \"南溪区\",\n" +
                "                code: \"511503\"\n" +
                "            }, {\n" +
                "                name: \"宜宾县\",\n" +
                "                code: \"511521\"\n" +
                "            }, {\n" +
                "                name: \"江安县\",\n" +
                "                code: \"511523\"\n" +
                "            }, {\n" +
                "                name: \"长宁县\",\n" +
                "                code: \"511524\"\n" +
                "            }, {\n" +
                "                name: \"高县\",\n" +
                "                code: \"511525\"\n" +
                "            }, {\n" +
                "                name: \"珙县\",\n" +
                "                code: \"511526\"\n" +
                "            }, {\n" +
                "                name: \"筠连县\",\n" +
                "                code: \"511527\"\n" +
                "            }, {\n" +
                "                name: \"兴文县\",\n" +
                "                code: \"511528\"\n" +
                "            }, {\n" +
                "                name: \"屏山县\",\n" +
                "                code: \"511529\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"广安市\",\n" +
                "            code: \"511600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"511601\"\n" +
                "            }, {\n" +
                "                name: \"广安区\",\n" +
                "                code: \"511602\"\n" +
                "            }, {\n" +
                "                name: \"前锋区\",\n" +
                "                code: \"511603\"\n" +
                "            }, {\n" +
                "                name: \"岳池县\",\n" +
                "                code: \"511621\"\n" +
                "            }, {\n" +
                "                name: \"武胜县\",\n" +
                "                code: \"511622\"\n" +
                "            }, {\n" +
                "                name: \"邻水县\",\n" +
                "                code: \"511623\"\n" +
                "            }, {\n" +
                "                name: \"华蓥市\",\n" +
                "                code: \"511681\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"达州市\",\n" +
                "            code: \"511700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"511701\"\n" +
                "            }, {\n" +
                "                name: \"通川区\",\n" +
                "                code: \"511702\"\n" +
                "            }, {\n" +
                "                name: \"达川区\",\n" +
                "                code: \"511703\"\n" +
                "            }, {\n" +
                "                name: \"宣汉县\",\n" +
                "                code: \"511722\"\n" +
                "            }, {\n" +
                "                name: \"开江县\",\n" +
                "                code: \"511723\"\n" +
                "            }, {\n" +
                "                name: \"大竹县\",\n" +
                "                code: \"511724\"\n" +
                "            }, {\n" +
                "                name: \"渠县\",\n" +
                "                code: \"511725\"\n" +
                "            }, {\n" +
                "                name: \"万源市\",\n" +
                "                code: \"511781\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"雅安市\",\n" +
                "            code: \"511800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"511801\"\n" +
                "            }, {\n" +
                "                name: \"雨城区\",\n" +
                "                code: \"511802\"\n" +
                "            }, {\n" +
                "                name: \"名山区\",\n" +
                "                code: \"511803\"\n" +
                "            }, {\n" +
                "                name: \"荥经县\",\n" +
                "                code: \"511822\"\n" +
                "            }, {\n" +
                "                name: \"汉源县\",\n" +
                "                code: \"511823\"\n" +
                "            }, {\n" +
                "                name: \"石棉县\",\n" +
                "                code: \"511824\"\n" +
                "            }, {\n" +
                "                name: \"天全县\",\n" +
                "                code: \"511825\"\n" +
                "            }, {\n" +
                "                name: \"芦山县\",\n" +
                "                code: \"511826\"\n" +
                "            }, {\n" +
                "                name: \"宝兴县\",\n" +
                "                code: \"511827\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"巴中市\",\n" +
                "            code: \"511900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"511901\"\n" +
                "            }, {\n" +
                "                name: \"巴州区\",\n" +
                "                code: \"511902\"\n" +
                "            }, {\n" +
                "                name: \"恩阳区\",\n" +
                "                code: \"511903\"\n" +
                "            }, {\n" +
                "                name: \"通江县\",\n" +
                "                code: \"511921\"\n" +
                "            }, {\n" +
                "                name: \"南江县\",\n" +
                "                code: \"511922\"\n" +
                "            }, {\n" +
                "                name: \"平昌县\",\n" +
                "                code: \"511923\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"资阳市\",\n" +
                "            code: \"512000\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"512001\"\n" +
                "            }, {\n" +
                "                name: \"雁江区\",\n" +
                "                code: \"512002\"\n" +
                "            }, {\n" +
                "                name: \"安岳县\",\n" +
                "                code: \"512021\"\n" +
                "            }, {\n" +
                "                name: \"乐至县\",\n" +
                "                code: \"512022\"\n" +
                "            }, {\n" +
                "                name: \"简阳市\",\n" +
                "                code: \"512081\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"阿坝藏族羌族自治州\",\n" +
                "            code: \"513200\",\n" +
                "            sub: [{\n" +
                "                name: \"汶川县\",\n" +
                "                code: \"513221\"\n" +
                "            }, {\n" +
                "                name: \"理县\",\n" +
                "                code: \"513222\"\n" +
                "            }, {\n" +
                "                name: \"茂县\",\n" +
                "                code: \"513223\"\n" +
                "            }, {\n" +
                "                name: \"松潘县\",\n" +
                "                code: \"513224\"\n" +
                "            }, {\n" +
                "                name: \"九寨沟县\",\n" +
                "                code: \"513225\"\n" +
                "            }, {\n" +
                "                name: \"金川县\",\n" +
                "                code: \"513226\"\n" +
                "            }, {\n" +
                "                name: \"小金县\",\n" +
                "                code: \"513227\"\n" +
                "            }, {\n" +
                "                name: \"黑水县\",\n" +
                "                code: \"513228\"\n" +
                "            }, {\n" +
                "                name: \"马尔康县\",\n" +
                "                code: \"513229\"\n" +
                "            }, {\n" +
                "                name: \"壤塘县\",\n" +
                "                code: \"513230\"\n" +
                "            }, {\n" +
                "                name: \"阿坝县\",\n" +
                "                code: \"513231\"\n" +
                "            }, {\n" +
                "                name: \"若尔盖县\",\n" +
                "                code: \"513232\"\n" +
                "            }, {\n" +
                "                name: \"红原县\",\n" +
                "                code: \"513233\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"甘孜藏族自治州\",\n" +
                "            code: \"513300\",\n" +
                "            sub: [{\n" +
                "                name: \"康定县\",\n" +
                "                code: \"513321\"\n" +
                "            }, {\n" +
                "                name: \"泸定县\",\n" +
                "                code: \"513322\"\n" +
                "            }, {\n" +
                "                name: \"丹巴县\",\n" +
                "                code: \"513323\"\n" +
                "            }, {\n" +
                "                name: \"九龙县\",\n" +
                "                code: \"513324\"\n" +
                "            }, {\n" +
                "                name: \"雅江县\",\n" +
                "                code: \"513325\"\n" +
                "            }, {\n" +
                "                name: \"道孚县\",\n" +
                "                code: \"513326\"\n" +
                "            }, {\n" +
                "                name: \"炉霍县\",\n" +
                "                code: \"513327\"\n" +
                "            }, {\n" +
                "                name: \"甘孜县\",\n" +
                "                code: \"513328\"\n" +
                "            }, {\n" +
                "                name: \"新龙县\",\n" +
                "                code: \"513329\"\n" +
                "            }, {\n" +
                "                name: \"德格县\",\n" +
                "                code: \"513330\"\n" +
                "            }, {\n" +
                "                name: \"白玉县\",\n" +
                "                code: \"513331\"\n" +
                "            }, {\n" +
                "                name: \"石渠县\",\n" +
                "                code: \"513332\"\n" +
                "            }, {\n" +
                "                name: \"色达县\",\n" +
                "                code: \"513333\"\n" +
                "            }, {\n" +
                "                name: \"理塘县\",\n" +
                "                code: \"513334\"\n" +
                "            }, {\n" +
                "                name: \"巴塘县\",\n" +
                "                code: \"513335\"\n" +
                "            }, {\n" +
                "                name: \"乡城县\",\n" +
                "                code: \"513336\"\n" +
                "            }, {\n" +
                "                name: \"稻城县\",\n" +
                "                code: \"513337\"\n" +
                "            }, {\n" +
                "                name: \"得荣县\",\n" +
                "                code: \"513338\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"凉山彝族自治州\",\n" +
                "            code: \"513400\",\n" +
                "            sub: [{\n" +
                "                name: \"西昌市\",\n" +
                "                code: \"513401\"\n" +
                "            }, {\n" +
                "                name: \"木里藏族自治县\",\n" +
                "                code: \"513422\"\n" +
                "            }, {\n" +
                "                name: \"盐源县\",\n" +
                "                code: \"513423\"\n" +
                "            }, {\n" +
                "                name: \"德昌县\",\n" +
                "                code: \"513424\"\n" +
                "            }, {\n" +
                "                name: \"会理县\",\n" +
                "                code: \"513425\"\n" +
                "            }, {\n" +
                "                name: \"会东县\",\n" +
                "                code: \"513426\"\n" +
                "            }, {\n" +
                "                name: \"宁南县\",\n" +
                "                code: \"513427\"\n" +
                "            }, {\n" +
                "                name: \"普格县\",\n" +
                "                code: \"513428\"\n" +
                "            }, {\n" +
                "                name: \"布拖县\",\n" +
                "                code: \"513429\"\n" +
                "            }, {\n" +
                "                name: \"金阳县\",\n" +
                "                code: \"513430\"\n" +
                "            }, {\n" +
                "                name: \"昭觉县\",\n" +
                "                code: \"513431\"\n" +
                "            }, {\n" +
                "                name: \"喜德县\",\n" +
                "                code: \"513432\"\n" +
                "            }, {\n" +
                "                name: \"冕宁县\",\n" +
                "                code: \"513433\"\n" +
                "            }, {\n" +
                "                name: \"越西县\",\n" +
                "                code: \"513434\"\n" +
                "            }, {\n" +
                "                name: \"甘洛县\",\n" +
                "                code: \"513435\"\n" +
                "            }, {\n" +
                "                name: \"美姑县\",\n" +
                "                code: \"513436\"\n" +
                "            }, {\n" +
                "                name: \"雷波县\",\n" +
                "                code: \"513437\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"贵州省\",\n" +
                "        code: \"520000\",\n" +
                "        sub: [{\n" +
                "            name: \"贵阳市\",\n" +
                "            code: \"520100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"520101\"\n" +
                "            }, {\n" +
                "                name: \"南明区\",\n" +
                "                code: \"520102\"\n" +
                "            }, {\n" +
                "                name: \"云岩区\",\n" +
                "                code: \"520103\"\n" +
                "            }, {\n" +
                "                name: \"花溪区\",\n" +
                "                code: \"520111\"\n" +
                "            }, {\n" +
                "                name: \"乌当区\",\n" +
                "                code: \"520112\"\n" +
                "            }, {\n" +
                "                name: \"白云区\",\n" +
                "                code: \"520113\"\n" +
                "            }, {\n" +
                "                name: \"观山湖区\",\n" +
                "                code: \"520115\"\n" +
                "            }, {\n" +
                "                name: \"开阳县\",\n" +
                "                code: \"520121\"\n" +
                "            }, {\n" +
                "                name: \"息烽县\",\n" +
                "                code: \"520122\"\n" +
                "            }, {\n" +
                "                name: \"修文县\",\n" +
                "                code: \"520123\"\n" +
                "            }, {\n" +
                "                name: \"清镇市\",\n" +
                "                code: \"520181\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"六盘水市\",\n" +
                "            code: \"520200\",\n" +
                "            sub: [{\n" +
                "                name: \"钟山区\",\n" +
                "                code: \"520201\"\n" +
                "            }, {\n" +
                "                name: \"六枝特区\",\n" +
                "                code: \"520203\"\n" +
                "            }, {\n" +
                "                name: \"水城县\",\n" +
                "                code: \"520221\"\n" +
                "            }, {\n" +
                "                name: \"盘县\",\n" +
                "                code: \"520222\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"遵义市\",\n" +
                "            code: \"520300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"520301\"\n" +
                "            }, {\n" +
                "                name: \"红花岗区\",\n" +
                "                code: \"520302\"\n" +
                "            }, {\n" +
                "                name: \"汇川区\",\n" +
                "                code: \"520303\"\n" +
                "            }, {\n" +
                "                name: \"遵义县\",\n" +
                "                code: \"520321\"\n" +
                "            }, {\n" +
                "                name: \"桐梓县\",\n" +
                "                code: \"520322\"\n" +
                "            }, {\n" +
                "                name: \"绥阳县\",\n" +
                "                code: \"520323\"\n" +
                "            }, {\n" +
                "                name: \"正安县\",\n" +
                "                code: \"520324\"\n" +
                "            }, {\n" +
                "                name: \"道真仡佬族苗族自治县\",\n" +
                "                code: \"520325\"\n" +
                "            }, {\n" +
                "                name: \"务川仡佬族苗族自治县\",\n" +
                "                code: \"520326\"\n" +
                "            }, {\n" +
                "                name: \"凤冈县\",\n" +
                "                code: \"520327\"\n" +
                "            }, {\n" +
                "                name: \"湄潭县\",\n" +
                "                code: \"520328\"\n" +
                "            }, {\n" +
                "                name: \"余庆县\",\n" +
                "                code: \"520329\"\n" +
                "            }, {\n" +
                "                name: \"习水县\",\n" +
                "                code: \"520330\"\n" +
                "            }, {\n" +
                "                name: \"赤水市\",\n" +
                "                code: \"520381\"\n" +
                "            }, {\n" +
                "                name: \"仁怀市\",\n" +
                "                code: \"520382\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"安顺市\",\n" +
                "            code: \"520400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"520401\"\n" +
                "            }, {\n" +
                "                name: \"西秀区\",\n" +
                "                code: \"520402\"\n" +
                "            }, {\n" +
                "                name: \"平坝区\",\n" +
                "                code: \"520403\"\n" +
                "            }, {\n" +
                "                name: \"普定县\",\n" +
                "                code: \"520422\"\n" +
                "            }, {\n" +
                "                name: \"镇宁布依族苗族自治县\",\n" +
                "                code: \"520423\"\n" +
                "            }, {\n" +
                "                name: \"关岭布依族苗族自治县\",\n" +
                "                code: \"520424\"\n" +
                "            }, {\n" +
                "                name: \"紫云苗族布依族自治县\",\n" +
                "                code: \"520425\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"毕节市\",\n" +
                "            code: \"520500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"520501\"\n" +
                "            }, {\n" +
                "                name: \"七星关区\",\n" +
                "                code: \"520502\"\n" +
                "            }, {\n" +
                "                name: \"大方县\",\n" +
                "                code: \"520521\"\n" +
                "            }, {\n" +
                "                name: \"黔西县\",\n" +
                "                code: \"520522\"\n" +
                "            }, {\n" +
                "                name: \"金沙县\",\n" +
                "                code: \"520523\"\n" +
                "            }, {\n" +
                "                name: \"织金县\",\n" +
                "                code: \"520524\"\n" +
                "            }, {\n" +
                "                name: \"纳雍县\",\n" +
                "                code: \"520525\"\n" +
                "            }, {\n" +
                "                name: \"威宁彝族回族苗族自治县\",\n" +
                "                code: \"520526\"\n" +
                "            }, {\n" +
                "                name: \"赫章县\",\n" +
                "                code: \"520527\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"铜仁市\",\n" +
                "            code: \"520600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"520601\"\n" +
                "            }, {\n" +
                "                name: \"碧江区\",\n" +
                "                code: \"520602\"\n" +
                "            }, {\n" +
                "                name: \"万山区\",\n" +
                "                code: \"520603\"\n" +
                "            }, {\n" +
                "                name: \"江口县\",\n" +
                "                code: \"520621\"\n" +
                "            }, {\n" +
                "                name: \"玉屏侗族自治县\",\n" +
                "                code: \"520622\"\n" +
                "            }, {\n" +
                "                name: \"石阡县\",\n" +
                "                code: \"520623\"\n" +
                "            }, {\n" +
                "                name: \"思南县\",\n" +
                "                code: \"520624\"\n" +
                "            }, {\n" +
                "                name: \"印江土家族苗族自治县\",\n" +
                "                code: \"520625\"\n" +
                "            }, {\n" +
                "                name: \"德江县\",\n" +
                "                code: \"520626\"\n" +
                "            }, {\n" +
                "                name: \"沿河土家族自治县\",\n" +
                "                code: \"520627\"\n" +
                "            }, {\n" +
                "                name: \"松桃苗族自治县\",\n" +
                "                code: \"520628\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"黔西南布依族苗族自治州\",\n" +
                "            code: \"522300\",\n" +
                "            sub: [{\n" +
                "                name: \"兴义市\",\n" +
                "                code: \"522301\"\n" +
                "            }, {\n" +
                "                name: \"兴仁县\",\n" +
                "                code: \"522322\"\n" +
                "            }, {\n" +
                "                name: \"普安县\",\n" +
                "                code: \"522323\"\n" +
                "            }, {\n" +
                "                name: \"晴隆县\",\n" +
                "                code: \"522324\"\n" +
                "            }, {\n" +
                "                name: \"贞丰县\",\n" +
                "                code: \"522325\"\n" +
                "            }, {\n" +
                "                name: \"望谟县\",\n" +
                "                code: \"522326\"\n" +
                "            }, {\n" +
                "                name: \"册亨县\",\n" +
                "                code: \"522327\"\n" +
                "            }, {\n" +
                "                name: \"安龙县\",\n" +
                "                code: \"522328\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"黔东南苗族侗族自治州\",\n" +
                "            code: \"522600\",\n" +
                "            sub: [{\n" +
                "                name: \"凯里市\",\n" +
                "                code: \"522601\"\n" +
                "            }, {\n" +
                "                name: \"黄平县\",\n" +
                "                code: \"522622\"\n" +
                "            }, {\n" +
                "                name: \"施秉县\",\n" +
                "                code: \"522623\"\n" +
                "            }, {\n" +
                "                name: \"三穗县\",\n" +
                "                code: \"522624\"\n" +
                "            }, {\n" +
                "                name: \"镇远县\",\n" +
                "                code: \"522625\"\n" +
                "            }, {\n" +
                "                name: \"岑巩县\",\n" +
                "                code: \"522626\"\n" +
                "            }, {\n" +
                "                name: \"天柱县\",\n" +
                "                code: \"522627\"\n" +
                "            }, {\n" +
                "                name: \"锦屏县\",\n" +
                "                code: \"522628\"\n" +
                "            }, {\n" +
                "                name: \"剑河县\",\n" +
                "                code: \"522629\"\n" +
                "            }, {\n" +
                "                name: \"台江县\",\n" +
                "                code: \"522630\"\n" +
                "            }, {\n" +
                "                name: \"黎平县\",\n" +
                "                code: \"522631\"\n" +
                "            }, {\n" +
                "                name: \"榕江县\",\n" +
                "                code: \"522632\"\n" +
                "            }, {\n" +
                "                name: \"从江县\",\n" +
                "                code: \"522633\"\n" +
                "            }, {\n" +
                "                name: \"雷山县\",\n" +
                "                code: \"522634\"\n" +
                "            }, {\n" +
                "                name: \"麻江县\",\n" +
                "                code: \"522635\"\n" +
                "            }, {\n" +
                "                name: \"丹寨县\",\n" +
                "                code: \"522636\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"黔南布依族苗族自治州\",\n" +
                "            code: \"522700\",\n" +
                "            sub: [{\n" +
                "                name: \"都匀市\",\n" +
                "                code: \"522701\"\n" +
                "            }, {\n" +
                "                name: \"福泉市\",\n" +
                "                code: \"522702\"\n" +
                "            }, {\n" +
                "                name: \"荔波县\",\n" +
                "                code: \"522722\"\n" +
                "            }, {\n" +
                "                name: \"贵定县\",\n" +
                "                code: \"522723\"\n" +
                "            }, {\n" +
                "                name: \"瓮安县\",\n" +
                "                code: \"522725\"\n" +
                "            }, {\n" +
                "                name: \"独山县\",\n" +
                "                code: \"522726\"\n" +
                "            }, {\n" +
                "                name: \"平塘县\",\n" +
                "                code: \"522727\"\n" +
                "            }, {\n" +
                "                name: \"罗甸县\",\n" +
                "                code: \"522728\"\n" +
                "            }, {\n" +
                "                name: \"长顺县\",\n" +
                "                code: \"522729\"\n" +
                "            }, {\n" +
                "                name: \"龙里县\",\n" +
                "                code: \"522730\"\n" +
                "            }, {\n" +
                "                name: \"惠水县\",\n" +
                "                code: \"522731\"\n" +
                "            }, {\n" +
                "                name: \"三都水族自治县\",\n" +
                "                code: \"522732\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"云南省\",\n" +
                "        code: \"530000\",\n" +
                "        sub: [{\n" +
                "            name: \"昆明市\",\n" +
                "            code: \"530100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"530101\"\n" +
                "            }, {\n" +
                "                name: \"五华区\",\n" +
                "                code: \"530102\"\n" +
                "            }, {\n" +
                "                name: \"盘龙区\",\n" +
                "                code: \"530103\"\n" +
                "            }, {\n" +
                "                name: \"官渡区\",\n" +
                "                code: \"530111\"\n" +
                "            }, {\n" +
                "                name: \"西山区\",\n" +
                "                code: \"530112\"\n" +
                "            }, {\n" +
                "                name: \"东川区\",\n" +
                "                code: \"530113\"\n" +
                "            }, {\n" +
                "                name: \"呈贡区\",\n" +
                "                code: \"530114\"\n" +
                "            }, {\n" +
                "                name: \"晋宁县\",\n" +
                "                code: \"530122\"\n" +
                "            }, {\n" +
                "                name: \"富民县\",\n" +
                "                code: \"530124\"\n" +
                "            }, {\n" +
                "                name: \"宜良县\",\n" +
                "                code: \"530125\"\n" +
                "            }, {\n" +
                "                name: \"石林彝族自治县\",\n" +
                "                code: \"530126\"\n" +
                "            }, {\n" +
                "                name: \"嵩明县\",\n" +
                "                code: \"530127\"\n" +
                "            }, {\n" +
                "                name: \"禄劝彝族苗族自治县\",\n" +
                "                code: \"530128\"\n" +
                "            }, {\n" +
                "                name: \"寻甸回族彝族自治县\",\n" +
                "                code: \"530129\"\n" +
                "            }, {\n" +
                "                name: \"安宁市\",\n" +
                "                code: \"530181\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"曲靖市\",\n" +
                "            code: \"530300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"530301\"\n" +
                "            }, {\n" +
                "                name: \"麒麟区\",\n" +
                "                code: \"530302\"\n" +
                "            }, {\n" +
                "                name: \"马龙县\",\n" +
                "                code: \"530321\"\n" +
                "            }, {\n" +
                "                name: \"陆良县\",\n" +
                "                code: \"530322\"\n" +
                "            }, {\n" +
                "                name: \"师宗县\",\n" +
                "                code: \"530323\"\n" +
                "            }, {\n" +
                "                name: \"罗平县\",\n" +
                "                code: \"530324\"\n" +
                "            }, {\n" +
                "                name: \"富源县\",\n" +
                "                code: \"530325\"\n" +
                "            }, {\n" +
                "                name: \"会泽县\",\n" +
                "                code: \"530326\"\n" +
                "            }, {\n" +
                "                name: \"沾益县\",\n" +
                "                code: \"530328\"\n" +
                "            }, {\n" +
                "                name: \"宣威市\",\n" +
                "                code: \"530381\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"玉溪市\",\n" +
                "            code: \"530400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"530401\"\n" +
                "            }, {\n" +
                "                name: \"红塔区\",\n" +
                "                code: \"530402\"\n" +
                "            }, {\n" +
                "                name: \"江川县\",\n" +
                "                code: \"530421\"\n" +
                "            }, {\n" +
                "                name: \"澄江县\",\n" +
                "                code: \"530422\"\n" +
                "            }, {\n" +
                "                name: \"通海县\",\n" +
                "                code: \"530423\"\n" +
                "            }, {\n" +
                "                name: \"华宁县\",\n" +
                "                code: \"530424\"\n" +
                "            }, {\n" +
                "                name: \"易门县\",\n" +
                "                code: \"530425\"\n" +
                "            }, {\n" +
                "                name: \"峨山彝族自治县\",\n" +
                "                code: \"530426\"\n" +
                "            }, {\n" +
                "                name: \"新平彝族傣族自治县\",\n" +
                "                code: \"530427\"\n" +
                "            }, {\n" +
                "                name: \"元江哈尼族彝族傣族自治县\",\n" +
                "                code: \"530428\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"保山市\",\n" +
                "            code: \"530500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"530501\"\n" +
                "            }, {\n" +
                "                name: \"隆阳区\",\n" +
                "                code: \"530502\"\n" +
                "            }, {\n" +
                "                name: \"施甸县\",\n" +
                "                code: \"530521\"\n" +
                "            }, {\n" +
                "                name: \"腾冲县\",\n" +
                "                code: \"530522\"\n" +
                "            }, {\n" +
                "                name: \"龙陵县\",\n" +
                "                code: \"530523\"\n" +
                "            }, {\n" +
                "                name: \"昌宁县\",\n" +
                "                code: \"530524\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"昭通市\",\n" +
                "            code: \"530600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"530601\"\n" +
                "            }, {\n" +
                "                name: \"昭阳区\",\n" +
                "                code: \"530602\"\n" +
                "            }, {\n" +
                "                name: \"鲁甸县\",\n" +
                "                code: \"530621\"\n" +
                "            }, {\n" +
                "                name: \"巧家县\",\n" +
                "                code: \"530622\"\n" +
                "            }, {\n" +
                "                name: \"盐津县\",\n" +
                "                code: \"530623\"\n" +
                "            }, {\n" +
                "                name: \"大关县\",\n" +
                "                code: \"530624\"\n" +
                "            }, {\n" +
                "                name: \"永善县\",\n" +
                "                code: \"530625\"\n" +
                "            }, {\n" +
                "                name: \"绥江县\",\n" +
                "                code: \"530626\"\n" +
                "            }, {\n" +
                "                name: \"镇雄县\",\n" +
                "                code: \"530627\"\n" +
                "            }, {\n" +
                "                name: \"彝良县\",\n" +
                "                code: \"530628\"\n" +
                "            }, {\n" +
                "                name: \"威信县\",\n" +
                "                code: \"530629\"\n" +
                "            }, {\n" +
                "                name: \"水富县\",\n" +
                "                code: \"530630\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"丽江市\",\n" +
                "            code: \"530700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"530701\"\n" +
                "            }, {\n" +
                "                name: \"古城区\",\n" +
                "                code: \"530702\"\n" +
                "            }, {\n" +
                "                name: \"玉龙纳西族自治县\",\n" +
                "                code: \"530721\"\n" +
                "            }, {\n" +
                "                name: \"永胜县\",\n" +
                "                code: \"530722\"\n" +
                "            }, {\n" +
                "                name: \"华坪县\",\n" +
                "                code: \"530723\"\n" +
                "            }, {\n" +
                "                name: \"宁蒗彝族自治县\",\n" +
                "                code: \"530724\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"普洱市\",\n" +
                "            code: \"530800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"530801\"\n" +
                "            }, {\n" +
                "                name: \"思茅区\",\n" +
                "                code: \"530802\"\n" +
                "            }, {\n" +
                "                name: \"宁洱哈尼族彝族自治县\",\n" +
                "                code: \"530821\"\n" +
                "            }, {\n" +
                "                name: \"墨江哈尼族自治县\",\n" +
                "                code: \"530822\"\n" +
                "            }, {\n" +
                "                name: \"景东彝族自治县\",\n" +
                "                code: \"530823\"\n" +
                "            }, {\n" +
                "                name: \"景谷傣族彝族自治县\",\n" +
                "                code: \"530824\"\n" +
                "            }, {\n" +
                "                name: \"镇沅彝族哈尼族拉祜族自治县\",\n" +
                "                code: \"530825\"\n" +
                "            }, {\n" +
                "                name: \"江城哈尼族彝族自治县\",\n" +
                "                code: \"530826\"\n" +
                "            }, {\n" +
                "                name: \"孟连傣族拉祜族佤族自治县\",\n" +
                "                code: \"530827\"\n" +
                "            }, {\n" +
                "                name: \"澜沧拉祜族自治县\",\n" +
                "                code: \"530828\"\n" +
                "            }, {\n" +
                "                name: \"西盟佤族自治县\",\n" +
                "                code: \"530829\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"临沧市\",\n" +
                "            code: \"530900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"530901\"\n" +
                "            }, {\n" +
                "                name: \"临翔区\",\n" +
                "                code: \"530902\"\n" +
                "            }, {\n" +
                "                name: \"凤庆县\",\n" +
                "                code: \"530921\"\n" +
                "            }, {\n" +
                "                name: \"云县\",\n" +
                "                code: \"530922\"\n" +
                "            }, {\n" +
                "                name: \"永德县\",\n" +
                "                code: \"530923\"\n" +
                "            }, {\n" +
                "                name: \"镇康县\",\n" +
                "                code: \"530924\"\n" +
                "            }, {\n" +
                "                name: \"双江拉祜族佤族布朗族傣族自治县\",\n" +
                "                code: \"530925\"\n" +
                "            }, {\n" +
                "                name: \"耿马傣族佤族自治县\",\n" +
                "                code: \"530926\"\n" +
                "            }, {\n" +
                "                name: \"沧源佤族自治县\",\n" +
                "                code: \"530927\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"楚雄彝族自治州\",\n" +
                "            code: \"532300\",\n" +
                "            sub: [{\n" +
                "                name: \"楚雄市\",\n" +
                "                code: \"532301\"\n" +
                "            }, {\n" +
                "                name: \"双柏县\",\n" +
                "                code: \"532322\"\n" +
                "            }, {\n" +
                "                name: \"牟定县\",\n" +
                "                code: \"532323\"\n" +
                "            }, {\n" +
                "                name: \"南华县\",\n" +
                "                code: \"532324\"\n" +
                "            }, {\n" +
                "                name: \"姚安县\",\n" +
                "                code: \"532325\"\n" +
                "            }, {\n" +
                "                name: \"大姚县\",\n" +
                "                code: \"532326\"\n" +
                "            }, {\n" +
                "                name: \"永仁县\",\n" +
                "                code: \"532327\"\n" +
                "            }, {\n" +
                "                name: \"元谋县\",\n" +
                "                code: \"532328\"\n" +
                "            }, {\n" +
                "                name: \"武定县\",\n" +
                "                code: \"532329\"\n" +
                "            }, {\n" +
                "                name: \"禄丰县\",\n" +
                "                code: \"532331\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"红河哈尼族彝族自治州\",\n" +
                "            code: \"532500\",\n" +
                "            sub: [{\n" +
                "                name: \"个旧市\",\n" +
                "                code: \"532501\"\n" +
                "            }, {\n" +
                "                name: \"开远市\",\n" +
                "                code: \"532502\"\n" +
                "            }, {\n" +
                "                name: \"蒙自市\",\n" +
                "                code: \"532503\"\n" +
                "            }, {\n" +
                "                name: \"弥勒市\",\n" +
                "                code: \"532504\"\n" +
                "            }, {\n" +
                "                name: \"屏边苗族自治县\",\n" +
                "                code: \"532523\"\n" +
                "            }, {\n" +
                "                name: \"建水县\",\n" +
                "                code: \"532524\"\n" +
                "            }, {\n" +
                "                name: \"石屏县\",\n" +
                "                code: \"532525\"\n" +
                "            }, {\n" +
                "                name: \"泸西县\",\n" +
                "                code: \"532527\"\n" +
                "            }, {\n" +
                "                name: \"元阳县\",\n" +
                "                code: \"532528\"\n" +
                "            }, {\n" +
                "                name: \"红河县\",\n" +
                "                code: \"532529\"\n" +
                "            }, {\n" +
                "                name: \"金平苗族瑶族傣族自治县\",\n" +
                "                code: \"532530\"\n" +
                "            }, {\n" +
                "                name: \"绿春县\",\n" +
                "                code: \"532531\"\n" +
                "            }, {\n" +
                "                name: \"河口瑶族自治县\",\n" +
                "                code: \"532532\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"文山壮族苗族自治州\",\n" +
                "            code: \"532600\",\n" +
                "            sub: [{\n" +
                "                name: \"文山市\",\n" +
                "                code: \"532601\"\n" +
                "            }, {\n" +
                "                name: \"砚山县\",\n" +
                "                code: \"532622\"\n" +
                "            }, {\n" +
                "                name: \"西畴县\",\n" +
                "                code: \"532623\"\n" +
                "            }, {\n" +
                "                name: \"麻栗坡县\",\n" +
                "                code: \"532624\"\n" +
                "            }, {\n" +
                "                name: \"马关县\",\n" +
                "                code: \"532625\"\n" +
                "            }, {\n" +
                "                name: \"丘北县\",\n" +
                "                code: \"532626\"\n" +
                "            }, {\n" +
                "                name: \"广南县\",\n" +
                "                code: \"532627\"\n" +
                "            }, {\n" +
                "                name: \"富宁县\",\n" +
                "                code: \"532628\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"西双版纳傣族自治州\",\n" +
                "            code: \"532800\",\n" +
                "            sub: [{\n" +
                "                name: \"景洪市\",\n" +
                "                code: \"532801\"\n" +
                "            }, {\n" +
                "                name: \"勐海县\",\n" +
                "                code: \"532822\"\n" +
                "            }, {\n" +
                "                name: \"勐腊县\",\n" +
                "                code: \"532823\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"大理白族自治州\",\n" +
                "            code: \"532900\",\n" +
                "            sub: [{\n" +
                "                name: \"大理市\",\n" +
                "                code: \"532901\"\n" +
                "            }, {\n" +
                "                name: \"漾濞彝族自治县\",\n" +
                "                code: \"532922\"\n" +
                "            }, {\n" +
                "                name: \"祥云县\",\n" +
                "                code: \"532923\"\n" +
                "            }, {\n" +
                "                name: \"宾川县\",\n" +
                "                code: \"532924\"\n" +
                "            }, {\n" +
                "                name: \"弥渡县\",\n" +
                "                code: \"532925\"\n" +
                "            }, {\n" +
                "                name: \"南涧彝族自治县\",\n" +
                "                code: \"532926\"\n" +
                "            }, {\n" +
                "                name: \"巍山彝族回族自治县\",\n" +
                "                code: \"532927\"\n" +
                "            }, {\n" +
                "                name: \"永平县\",\n" +
                "                code: \"532928\"\n" +
                "            }, {\n" +
                "                name: \"云龙县\",\n" +
                "                code: \"532929\"\n" +
                "            }, {\n" +
                "                name: \"洱源县\",\n" +
                "                code: \"532930\"\n" +
                "            }, {\n" +
                "                name: \"剑川县\",\n" +
                "                code: \"532931\"\n" +
                "            }, {\n" +
                "                name: \"鹤庆县\",\n" +
                "                code: \"532932\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"德宏傣族景颇族自治州\",\n" +
                "            code: \"533100\",\n" +
                "            sub: [{\n" +
                "                name: \"瑞丽市\",\n" +
                "                code: \"533102\"\n" +
                "            }, {\n" +
                "                name: \"芒市\",\n" +
                "                code: \"533103\"\n" +
                "            }, {\n" +
                "                name: \"梁河县\",\n" +
                "                code: \"533122\"\n" +
                "            }, {\n" +
                "                name: \"盈江县\",\n" +
                "                code: \"533123\"\n" +
                "            }, {\n" +
                "                name: \"陇川县\",\n" +
                "                code: \"533124\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"怒江傈僳族自治州\",\n" +
                "            code: \"533300\",\n" +
                "            sub: [{\n" +
                "                name: \"泸水县\",\n" +
                "                code: \"533321\"\n" +
                "            }, {\n" +
                "                name: \"福贡县\",\n" +
                "                code: \"533323\"\n" +
                "            }, {\n" +
                "                name: \"贡山独龙族怒族自治县\",\n" +
                "                code: \"533324\"\n" +
                "            }, {\n" +
                "                name: \"兰坪白族普米族自治县\",\n" +
                "                code: \"533325\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"迪庆藏族自治州\",\n" +
                "            code: \"533400\",\n" +
                "            sub: [{\n" +
                "                name: \"香格里拉市\",\n" +
                "                code: \"533401\"\n" +
                "            }, {\n" +
                "                name: \"德钦县\",\n" +
                "                code: \"533422\"\n" +
                "            }, {\n" +
                "                name: \"维西傈僳族自治县\",\n" +
                "                code: \"533423\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"西藏自治区\",\n" +
                "        code: \"540000\",\n" +
                "        sub: [{\n" +
                "            name: \"拉萨市\",\n" +
                "            code: \"540100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"540101\"\n" +
                "            }, {\n" +
                "                name: \"城关区\",\n" +
                "                code: \"540102\"\n" +
                "            }, {\n" +
                "                name: \"林周县\",\n" +
                "                code: \"540121\"\n" +
                "            }, {\n" +
                "                name: \"当雄县\",\n" +
                "                code: \"540122\"\n" +
                "            }, {\n" +
                "                name: \"尼木县\",\n" +
                "                code: \"540123\"\n" +
                "            }, {\n" +
                "                name: \"曲水县\",\n" +
                "                code: \"540124\"\n" +
                "            }, {\n" +
                "                name: \"堆龙德庆县\",\n" +
                "                code: \"540125\"\n" +
                "            }, {\n" +
                "                name: \"达孜县\",\n" +
                "                code: \"540126\"\n" +
                "            }, {\n" +
                "                name: \"墨竹工卡县\",\n" +
                "                code: \"540127\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"日喀则市\",\n" +
                "            code: \"540200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"540201\"\n" +
                "            }, {\n" +
                "                name: \"桑珠孜区\",\n" +
                "                code: \"540202\"\n" +
                "            }, {\n" +
                "                name: \"南木林县\",\n" +
                "                code: \"540221\"\n" +
                "            }, {\n" +
                "                name: \"江孜县\",\n" +
                "                code: \"540222\"\n" +
                "            }, {\n" +
                "                name: \"定日县\",\n" +
                "                code: \"540223\"\n" +
                "            }, {\n" +
                "                name: \"萨迦县\",\n" +
                "                code: \"540224\"\n" +
                "            }, {\n" +
                "                name: \"拉孜县\",\n" +
                "                code: \"540225\"\n" +
                "            }, {\n" +
                "                name: \"昂仁县\",\n" +
                "                code: \"540226\"\n" +
                "            }, {\n" +
                "                name: \"谢通门县\",\n" +
                "                code: \"540227\"\n" +
                "            }, {\n" +
                "                name: \"白朗县\",\n" +
                "                code: \"540228\"\n" +
                "            }, {\n" +
                "                name: \"仁布县\",\n" +
                "                code: \"540229\"\n" +
                "            }, {\n" +
                "                name: \"康马县\",\n" +
                "                code: \"540230\"\n" +
                "            }, {\n" +
                "                name: \"定结县\",\n" +
                "                code: \"540231\"\n" +
                "            }, {\n" +
                "                name: \"仲巴县\",\n" +
                "                code: \"540232\"\n" +
                "            }, {\n" +
                "                name: \"亚东县\",\n" +
                "                code: \"540233\"\n" +
                "            }, {\n" +
                "                name: \"吉隆县\",\n" +
                "                code: \"540234\"\n" +
                "            }, {\n" +
                "                name: \"聂拉木县\",\n" +
                "                code: \"540235\"\n" +
                "            }, {\n" +
                "                name: \"萨嘎县\",\n" +
                "                code: \"540236\"\n" +
                "            }, {\n" +
                "                name: \"岗巴县\",\n" +
                "                code: \"540237\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"昌都市\",\n" +
                "            code: \"540300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"540301\"\n" +
                "            }, {\n" +
                "                name: \"卡若区\",\n" +
                "                code: \"540302\"\n" +
                "            }, {\n" +
                "                name: \"江达县\",\n" +
                "                code: \"540321\"\n" +
                "            }, {\n" +
                "                name: \"贡觉县\",\n" +
                "                code: \"540322\"\n" +
                "            }, {\n" +
                "                name: \"类乌齐县\",\n" +
                "                code: \"540323\"\n" +
                "            }, {\n" +
                "                name: \"丁青县\",\n" +
                "                code: \"540324\"\n" +
                "            }, {\n" +
                "                name: \"察雅县\",\n" +
                "                code: \"540325\"\n" +
                "            }, {\n" +
                "                name: \"八宿县\",\n" +
                "                code: \"540326\"\n" +
                "            }, {\n" +
                "                name: \"左贡县\",\n" +
                "                code: \"540327\"\n" +
                "            }, {\n" +
                "                name: \"芒康县\",\n" +
                "                code: \"540328\"\n" +
                "            }, {\n" +
                "                name: \"洛隆县\",\n" +
                "                code: \"540329\"\n" +
                "            }, {\n" +
                "                name: \"边坝县\",\n" +
                "                code: \"540330\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"山南地区\",\n" +
                "            code: \"542200\",\n" +
                "            sub: [{\n" +
                "                name: \"乃东县\",\n" +
                "                code: \"542221\"\n" +
                "            }, {\n" +
                "                name: \"扎囊县\",\n" +
                "                code: \"542222\"\n" +
                "            }, {\n" +
                "                name: \"贡嘎县\",\n" +
                "                code: \"542223\"\n" +
                "            }, {\n" +
                "                name: \"桑日县\",\n" +
                "                code: \"542224\"\n" +
                "            }, {\n" +
                "                name: \"琼结县\",\n" +
                "                code: \"542225\"\n" +
                "            }, {\n" +
                "                name: \"曲松县\",\n" +
                "                code: \"542226\"\n" +
                "            }, {\n" +
                "                name: \"措美县\",\n" +
                "                code: \"542227\"\n" +
                "            }, {\n" +
                "                name: \"洛扎县\",\n" +
                "                code: \"542228\"\n" +
                "            }, {\n" +
                "                name: \"加查县\",\n" +
                "                code: \"542229\"\n" +
                "            }, {\n" +
                "                name: \"隆子县\",\n" +
                "                code: \"542231\"\n" +
                "            }, {\n" +
                "                name: \"错那县\",\n" +
                "                code: \"542232\"\n" +
                "            }, {\n" +
                "                name: \"浪卡子县\",\n" +
                "                code: \"542233\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"那曲地区\",\n" +
                "            code: \"542400\",\n" +
                "            sub: [{\n" +
                "                name: \"那曲县\",\n" +
                "                code: \"542421\"\n" +
                "            }, {\n" +
                "                name: \"嘉黎县\",\n" +
                "                code: \"542422\"\n" +
                "            }, {\n" +
                "                name: \"比如县\",\n" +
                "                code: \"542423\"\n" +
                "            }, {\n" +
                "                name: \"聂荣县\",\n" +
                "                code: \"542424\"\n" +
                "            }, {\n" +
                "                name: \"安多县\",\n" +
                "                code: \"542425\"\n" +
                "            }, {\n" +
                "                name: \"申扎县\",\n" +
                "                code: \"542426\"\n" +
                "            }, {\n" +
                "                name: \"索县\",\n" +
                "                code: \"542427\"\n" +
                "            }, {\n" +
                "                name: \"班戈县\",\n" +
                "                code: \"542428\"\n" +
                "            }, {\n" +
                "                name: \"巴青县\",\n" +
                "                code: \"542429\"\n" +
                "            }, {\n" +
                "                name: \"尼玛县\",\n" +
                "                code: \"542430\"\n" +
                "            }, {\n" +
                "                name: \"双湖县\",\n" +
                "                code: \"542431\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"阿里地区\",\n" +
                "            code: \"542500\",\n" +
                "            sub: [{\n" +
                "                name: \"普兰县\",\n" +
                "                code: \"542521\"\n" +
                "            }, {\n" +
                "                name: \"札达县\",\n" +
                "                code: \"542522\"\n" +
                "            }, {\n" +
                "                name: \"噶尔县\",\n" +
                "                code: \"542523\"\n" +
                "            }, {\n" +
                "                name: \"日土县\",\n" +
                "                code: \"542524\"\n" +
                "            }, {\n" +
                "                name: \"革吉县\",\n" +
                "                code: \"542525\"\n" +
                "            }, {\n" +
                "                name: \"改则县\",\n" +
                "                code: \"542526\"\n" +
                "            }, {\n" +
                "                name: \"措勤县\",\n" +
                "                code: \"542527\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"林芝地区\",\n" +
                "            code: \"542600\",\n" +
                "            sub: [{\n" +
                "                name: \"林芝县\",\n" +
                "                code: \"542621\"\n" +
                "            }, {\n" +
                "                name: \"工布江达县\",\n" +
                "                code: \"542622\"\n" +
                "            }, {\n" +
                "                name: \"米林县\",\n" +
                "                code: \"542623\"\n" +
                "            }, {\n" +
                "                name: \"墨脱县\",\n" +
                "                code: \"542624\"\n" +
                "            }, {\n" +
                "                name: \"波密县\",\n" +
                "                code: \"542625\"\n" +
                "            }, {\n" +
                "                name: \"察隅县\",\n" +
                "                code: \"542626\"\n" +
                "            }, {\n" +
                "                name: \"朗县\",\n" +
                "                code: \"542627\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"陕西省\",\n" +
                "        code: \"610000\",\n" +
                "        sub: [{\n" +
                "            name: \"西安市\",\n" +
                "            code: \"610100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"610101\"\n" +
                "            }, {\n" +
                "                name: \"新城区\",\n" +
                "                code: \"610102\"\n" +
                "            }, {\n" +
                "                name: \"碑林区\",\n" +
                "                code: \"610103\"\n" +
                "            }, {\n" +
                "                name: \"莲湖区\",\n" +
                "                code: \"610104\"\n" +
                "            }, {\n" +
                "                name: \"灞桥区\",\n" +
                "                code: \"610111\"\n" +
                "            }, {\n" +
                "                name: \"未央区\",\n" +
                "                code: \"610112\"\n" +
                "            }, {\n" +
                "                name: \"雁塔区\",\n" +
                "                code: \"610113\"\n" +
                "            }, {\n" +
                "                name: \"阎良区\",\n" +
                "                code: \"610114\"\n" +
                "            }, {\n" +
                "                name: \"临潼区\",\n" +
                "                code: \"610115\"\n" +
                "            }, {\n" +
                "                name: \"长安区\",\n" +
                "                code: \"610116\"\n" +
                "            }, {\n" +
                "                name: \"高陵区\",\n" +
                "                code: \"610117\"\n" +
                "            }, {\n" +
                "                name: \"蓝田县\",\n" +
                "                code: \"610122\"\n" +
                "            }, {\n" +
                "                name: \"周至县\",\n" +
                "                code: \"610124\"\n" +
                "            }, {\n" +
                "                name: \"户县\",\n" +
                "                code: \"610125\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"铜川市\",\n" +
                "            code: \"610200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"610201\"\n" +
                "            }, {\n" +
                "                name: \"王益区\",\n" +
                "                code: \"610202\"\n" +
                "            }, {\n" +
                "                name: \"印台区\",\n" +
                "                code: \"610203\"\n" +
                "            }, {\n" +
                "                name: \"耀州区\",\n" +
                "                code: \"610204\"\n" +
                "            }, {\n" +
                "                name: \"宜君县\",\n" +
                "                code: \"610222\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"宝鸡市\",\n" +
                "            code: \"610300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"610301\"\n" +
                "            }, {\n" +
                "                name: \"渭滨区\",\n" +
                "                code: \"610302\"\n" +
                "            }, {\n" +
                "                name: \"金台区\",\n" +
                "                code: \"610303\"\n" +
                "            }, {\n" +
                "                name: \"陈仓区\",\n" +
                "                code: \"610304\"\n" +
                "            }, {\n" +
                "                name: \"凤翔县\",\n" +
                "                code: \"610322\"\n" +
                "            }, {\n" +
                "                name: \"岐山县\",\n" +
                "                code: \"610323\"\n" +
                "            }, {\n" +
                "                name: \"扶风县\",\n" +
                "                code: \"610324\"\n" +
                "            }, {\n" +
                "                name: \"眉县\",\n" +
                "                code: \"610326\"\n" +
                "            }, {\n" +
                "                name: \"陇县\",\n" +
                "                code: \"610327\"\n" +
                "            }, {\n" +
                "                name: \"千阳县\",\n" +
                "                code: \"610328\"\n" +
                "            }, {\n" +
                "                name: \"麟游县\",\n" +
                "                code: \"610329\"\n" +
                "            }, {\n" +
                "                name: \"凤县\",\n" +
                "                code: \"610330\"\n" +
                "            }, {\n" +
                "                name: \"太白县\",\n" +
                "                code: \"610331\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"咸阳市\",\n" +
                "            code: \"610400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"610401\"\n" +
                "            }, {\n" +
                "                name: \"秦都区\",\n" +
                "                code: \"610402\"\n" +
                "            }, {\n" +
                "                name: \"杨陵区\",\n" +
                "                code: \"610403\"\n" +
                "            }, {\n" +
                "                name: \"渭城区\",\n" +
                "                code: \"610404\"\n" +
                "            }, {\n" +
                "                name: \"三原县\",\n" +
                "                code: \"610422\"\n" +
                "            }, {\n" +
                "                name: \"泾阳县\",\n" +
                "                code: \"610423\"\n" +
                "            }, {\n" +
                "                name: \"乾县\",\n" +
                "                code: \"610424\"\n" +
                "            }, {\n" +
                "                name: \"礼泉县\",\n" +
                "                code: \"610425\"\n" +
                "            }, {\n" +
                "                name: \"永寿县\",\n" +
                "                code: \"610426\"\n" +
                "            }, {\n" +
                "                name: \"彬县\",\n" +
                "                code: \"610427\"\n" +
                "            }, {\n" +
                "                name: \"长武县\",\n" +
                "                code: \"610428\"\n" +
                "            }, {\n" +
                "                name: \"旬邑县\",\n" +
                "                code: \"610429\"\n" +
                "            }, {\n" +
                "                name: \"淳化县\",\n" +
                "                code: \"610430\"\n" +
                "            }, {\n" +
                "                name: \"武功县\",\n" +
                "                code: \"610431\"\n" +
                "            }, {\n" +
                "                name: \"兴平市\",\n" +
                "                code: \"610481\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"渭南市\",\n" +
                "            code: \"610500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"610501\"\n" +
                "            }, {\n" +
                "                name: \"临渭区\",\n" +
                "                code: \"610502\"\n" +
                "            }, {\n" +
                "                name: \"华县\",\n" +
                "                code: \"610521\"\n" +
                "            }, {\n" +
                "                name: \"潼关县\",\n" +
                "                code: \"610522\"\n" +
                "            }, {\n" +
                "                name: \"大荔县\",\n" +
                "                code: \"610523\"\n" +
                "            }, {\n" +
                "                name: \"合阳县\",\n" +
                "                code: \"610524\"\n" +
                "            }, {\n" +
                "                name: \"澄城县\",\n" +
                "                code: \"610525\"\n" +
                "            }, {\n" +
                "                name: \"蒲城县\",\n" +
                "                code: \"610526\"\n" +
                "            }, {\n" +
                "                name: \"白水县\",\n" +
                "                code: \"610527\"\n" +
                "            }, {\n" +
                "                name: \"富平县\",\n" +
                "                code: \"610528\"\n" +
                "            }, {\n" +
                "                name: \"韩城市\",\n" +
                "                code: \"610581\"\n" +
                "            }, {\n" +
                "                name: \"华阴市\",\n" +
                "                code: \"610582\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"延安市\",\n" +
                "            code: \"610600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"610601\"\n" +
                "            }, {\n" +
                "                name: \"宝塔区\",\n" +
                "                code: \"610602\"\n" +
                "            }, {\n" +
                "                name: \"延长县\",\n" +
                "                code: \"610621\"\n" +
                "            }, {\n" +
                "                name: \"延川县\",\n" +
                "                code: \"610622\"\n" +
                "            }, {\n" +
                "                name: \"子长县\",\n" +
                "                code: \"610623\"\n" +
                "            }, {\n" +
                "                name: \"安塞县\",\n" +
                "                code: \"610624\"\n" +
                "            }, {\n" +
                "                name: \"志丹县\",\n" +
                "                code: \"610625\"\n" +
                "            }, {\n" +
                "                name: \"吴起县\",\n" +
                "                code: \"610626\"\n" +
                "            }, {\n" +
                "                name: \"甘泉县\",\n" +
                "                code: \"610627\"\n" +
                "            }, {\n" +
                "                name: \"富县\",\n" +
                "                code: \"610628\"\n" +
                "            }, {\n" +
                "                name: \"洛川县\",\n" +
                "                code: \"610629\"\n" +
                "            }, {\n" +
                "                name: \"宜川县\",\n" +
                "                code: \"610630\"\n" +
                "            }, {\n" +
                "                name: \"黄龙县\",\n" +
                "                code: \"610631\"\n" +
                "            }, {\n" +
                "                name: \"黄陵县\",\n" +
                "                code: \"610632\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"汉中市\",\n" +
                "            code: \"610700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"610701\"\n" +
                "            }, {\n" +
                "                name: \"汉台区\",\n" +
                "                code: \"610702\"\n" +
                "            }, {\n" +
                "                name: \"南郑县\",\n" +
                "                code: \"610721\"\n" +
                "            }, {\n" +
                "                name: \"城固县\",\n" +
                "                code: \"610722\"\n" +
                "            }, {\n" +
                "                name: \"洋县\",\n" +
                "                code: \"610723\"\n" +
                "            }, {\n" +
                "                name: \"西乡县\",\n" +
                "                code: \"610724\"\n" +
                "            }, {\n" +
                "                name: \"勉县\",\n" +
                "                code: \"610725\"\n" +
                "            }, {\n" +
                "                name: \"宁强县\",\n" +
                "                code: \"610726\"\n" +
                "            }, {\n" +
                "                name: \"略阳县\",\n" +
                "                code: \"610727\"\n" +
                "            }, {\n" +
                "                name: \"镇巴县\",\n" +
                "                code: \"610728\"\n" +
                "            }, {\n" +
                "                name: \"留坝县\",\n" +
                "                code: \"610729\"\n" +
                "            }, {\n" +
                "                name: \"佛坪县\",\n" +
                "                code: \"610730\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"榆林市\",\n" +
                "            code: \"610800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"610801\"\n" +
                "            }, {\n" +
                "                name: \"榆阳区\",\n" +
                "                code: \"610802\"\n" +
                "            }, {\n" +
                "                name: \"神木县\",\n" +
                "                code: \"610821\"\n" +
                "            }, {\n" +
                "                name: \"府谷县\",\n" +
                "                code: \"610822\"\n" +
                "            }, {\n" +
                "                name: \"横山县\",\n" +
                "                code: \"610823\"\n" +
                "            }, {\n" +
                "                name: \"靖边县\",\n" +
                "                code: \"610824\"\n" +
                "            }, {\n" +
                "                name: \"定边县\",\n" +
                "                code: \"610825\"\n" +
                "            }, {\n" +
                "                name: \"绥德县\",\n" +
                "                code: \"610826\"\n" +
                "            }, {\n" +
                "                name: \"米脂县\",\n" +
                "                code: \"610827\"\n" +
                "            }, {\n" +
                "                name: \"佳县\",\n" +
                "                code: \"610828\"\n" +
                "            }, {\n" +
                "                name: \"吴堡县\",\n" +
                "                code: \"610829\"\n" +
                "            }, {\n" +
                "                name: \"清涧县\",\n" +
                "                code: \"610830\"\n" +
                "            }, {\n" +
                "                name: \"子洲县\",\n" +
                "                code: \"610831\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"安康市\",\n" +
                "            code: \"610900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"610901\"\n" +
                "            }, {\n" +
                "                name: \"汉阴县\",\n" +
                "                code: \"610921\"\n" +
                "            }, {\n" +
                "                name: \"石泉县\",\n" +
                "                code: \"610922\"\n" +
                "            }, {\n" +
                "                name: \"宁陕县\",\n" +
                "                code: \"610923\"\n" +
                "            }, {\n" +
                "                name: \"紫阳县\",\n" +
                "                code: \"610924\"\n" +
                "            }, {\n" +
                "                name: \"岚皋县\",\n" +
                "                code: \"610925\"\n" +
                "            }, {\n" +
                "                name: \"平利县\",\n" +
                "                code: \"610926\"\n" +
                "            }, {\n" +
                "                name: \"镇坪县\",\n" +
                "                code: \"610927\"\n" +
                "            }, {\n" +
                "                name: \"旬阳县\",\n" +
                "                code: \"610928\"\n" +
                "            }, {\n" +
                "                name: \"白河县\",\n" +
                "                code: \"610929\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"商洛市\",\n" +
                "            code: \"611000\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"611001\"\n" +
                "            }, {\n" +
                "                name: \"商州区\",\n" +
                "                code: \"611002\"\n" +
                "            }, {\n" +
                "                name: \"洛南县\",\n" +
                "                code: \"611021\"\n" +
                "            }, {\n" +
                "                name: \"丹凤县\",\n" +
                "                code: \"611022\"\n" +
                "            }, {\n" +
                "                name: \"商南县\",\n" +
                "                code: \"611023\"\n" +
                "            }, {\n" +
                "                name: \"山阳县\",\n" +
                "                code: \"611024\"\n" +
                "            }, {\n" +
                "                name: \"镇安县\",\n" +
                "                code: \"611025\"\n" +
                "            }, {\n" +
                "                name: \"柞水县\",\n" +
                "                code: \"611026\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"甘肃省\",\n" +
                "        code: \"620000\",\n" +
                "        sub: [{\n" +
                "            name: \"兰州市\",\n" +
                "            code: \"620100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"620101\"\n" +
                "            }, {\n" +
                "                name: \"城关区\",\n" +
                "                code: \"620102\"\n" +
                "            }, {\n" +
                "                name: \"七里河区\",\n" +
                "                code: \"620103\"\n" +
                "            }, {\n" +
                "                name: \"西固区\",\n" +
                "                code: \"620104\"\n" +
                "            }, {\n" +
                "                name: \"安宁区\",\n" +
                "                code: \"620105\"\n" +
                "            }, {\n" +
                "                name: \"红古区\",\n" +
                "                code: \"620111\"\n" +
                "            }, {\n" +
                "                name: \"永登县\",\n" +
                "                code: \"620121\"\n" +
                "            }, {\n" +
                "                name: \"皋兰县\",\n" +
                "                code: \"620122\"\n" +
                "            }, {\n" +
                "                name: \"榆中县\",\n" +
                "                code: \"620123\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"嘉峪关市\",\n" +
                "            code: \"620200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"620201\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"金昌市\",\n" +
                "            code: \"620300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"620301\"\n" +
                "            }, {\n" +
                "                name: \"金川区\",\n" +
                "                code: \"620302\"\n" +
                "            }, {\n" +
                "                name: \"永昌县\",\n" +
                "                code: \"620321\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"白银市\",\n" +
                "            code: \"620400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"620401\"\n" +
                "            }, {\n" +
                "                name: \"白银区\",\n" +
                "                code: \"620402\"\n" +
                "            }, {\n" +
                "                name: \"平川区\",\n" +
                "                code: \"620403\"\n" +
                "            }, {\n" +
                "                name: \"靖远县\",\n" +
                "                code: \"620421\"\n" +
                "            }, {\n" +
                "                name: \"会宁县\",\n" +
                "                code: \"620422\"\n" +
                "            }, {\n" +
                "                name: \"景泰县\",\n" +
                "                code: \"620423\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"天水市\",\n" +
                "            code: \"620500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"620501\"\n" +
                "            }, {\n" +
                "                name: \"秦州区\",\n" +
                "                code: \"620502\"\n" +
                "            }, {\n" +
                "                name: \"麦积区\",\n" +
                "                code: \"620503\"\n" +
                "            }, {\n" +
                "                name: \"清水县\",\n" +
                "                code: \"620521\"\n" +
                "            }, {\n" +
                "                name: \"秦安县\",\n" +
                "                code: \"620522\"\n" +
                "            }, {\n" +
                "                name: \"甘谷县\",\n" +
                "                code: \"620523\"\n" +
                "            }, {\n" +
                "                name: \"武山县\",\n" +
                "                code: \"620524\"\n" +
                "            }, {\n" +
                "                name: \"张家川回族自治县\",\n" +
                "                code: \"620525\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"武威市\",\n" +
                "            code: \"620600\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"620601\"\n" +
                "            }, {\n" +
                "                name: \"凉州区\",\n" +
                "                code: \"620602\"\n" +
                "            }, {\n" +
                "                name: \"民勤县\",\n" +
                "                code: \"620621\"\n" +
                "            }, {\n" +
                "                name: \"古浪县\",\n" +
                "                code: \"620622\"\n" +
                "            }, {\n" +
                "                name: \"天祝藏族自治县\",\n" +
                "                code: \"620623\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"张掖市\",\n" +
                "            code: \"620700\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"620701\"\n" +
                "            }, {\n" +
                "                name: \"甘州区\",\n" +
                "                code: \"620702\"\n" +
                "            }, {\n" +
                "                name: \"肃南裕固族自治县\",\n" +
                "                code: \"620721\"\n" +
                "            }, {\n" +
                "                name: \"民乐县\",\n" +
                "                code: \"620722\"\n" +
                "            }, {\n" +
                "                name: \"临泽县\",\n" +
                "                code: \"620723\"\n" +
                "            }, {\n" +
                "                name: \"高台县\",\n" +
                "                code: \"620724\"\n" +
                "            }, {\n" +
                "                name: \"山丹县\",\n" +
                "                code: \"620725\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"平凉市\",\n" +
                "            code: \"620800\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"620801\"\n" +
                "            }, {\n" +
                "                name: \"崆峒区\",\n" +
                "                code: \"620802\"\n" +
                "            }, {\n" +
                "                name: \"泾川县\",\n" +
                "                code: \"620821\"\n" +
                "            }, {\n" +
                "                name: \"灵台县\",\n" +
                "                code: \"620822\"\n" +
                "            }, {\n" +
                "                name: \"崇信县\",\n" +
                "                code: \"620823\"\n" +
                "            }, {\n" +
                "                name: \"华亭县\",\n" +
                "                code: \"620824\"\n" +
                "            }, {\n" +
                "                name: \"庄浪县\",\n" +
                "                code: \"620825\"\n" +
                "            }, {\n" +
                "                name: \"静宁县\",\n" +
                "                code: \"620826\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"酒泉市\",\n" +
                "            code: \"620900\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"620901\"\n" +
                "            }, {\n" +
                "                name: \"肃州区\",\n" +
                "                code: \"620902\"\n" +
                "            }, {\n" +
                "                name: \"金塔县\",\n" +
                "                code: \"620921\"\n" +
                "            }, {\n" +
                "                name: \"瓜州县\",\n" +
                "                code: \"620922\"\n" +
                "            }, {\n" +
                "                name: \"肃北蒙古族自治县\",\n" +
                "                code: \"620923\"\n" +
                "            }, {\n" +
                "                name: \"阿克塞哈萨克族自治县\",\n" +
                "                code: \"620924\"\n" +
                "            }, {\n" +
                "                name: \"玉门市\",\n" +
                "                code: \"620981\"\n" +
                "            }, {\n" +
                "                name: \"敦煌市\",\n" +
                "                code: \"620982\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"庆阳市\",\n" +
                "            code: \"621000\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"621001\"\n" +
                "            }, {\n" +
                "                name: \"西峰区\",\n" +
                "                code: \"621002\"\n" +
                "            }, {\n" +
                "                name: \"庆城县\",\n" +
                "                code: \"621021\"\n" +
                "            }, {\n" +
                "                name: \"环县\",\n" +
                "                code: \"621022\"\n" +
                "            }, {\n" +
                "                name: \"华池县\",\n" +
                "                code: \"621023\"\n" +
                "            }, {\n" +
                "                name: \"合水县\",\n" +
                "                code: \"621024\"\n" +
                "            }, {\n" +
                "                name: \"正宁县\",\n" +
                "                code: \"621025\"\n" +
                "            }, {\n" +
                "                name: \"宁县\",\n" +
                "                code: \"621026\"\n" +
                "            }, {\n" +
                "                name: \"镇原县\",\n" +
                "                code: \"621027\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"定西市\",\n" +
                "            code: \"621100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"621101\"\n" +
                "            }, {\n" +
                "                name: \"安定区\",\n" +
                "                code: \"621102\"\n" +
                "            }, {\n" +
                "                name: \"通渭县\",\n" +
                "                code: \"621121\"\n" +
                "            }, {\n" +
                "                name: \"陇西县\",\n" +
                "                code: \"621122\"\n" +
                "            }, {\n" +
                "                name: \"渭源县\",\n" +
                "                code: \"621123\"\n" +
                "            }, {\n" +
                "                name: \"临洮县\",\n" +
                "                code: \"621124\"\n" +
                "            }, {\n" +
                "                name: \"漳县\",\n" +
                "                code: \"621125\"\n" +
                "            }, {\n" +
                "                name: \"岷县\",\n" +
                "                code: \"621126\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"陇南市\",\n" +
                "            code: \"621200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"621201\"\n" +
                "            }, {\n" +
                "                name: \"武都区\",\n" +
                "                code: \"621202\"\n" +
                "            }, {\n" +
                "                name: \"成县\",\n" +
                "                code: \"621221\"\n" +
                "            }, {\n" +
                "                name: \"文县\",\n" +
                "                code: \"621222\"\n" +
                "            }, {\n" +
                "                name: \"宕昌县\",\n" +
                "                code: \"621223\"\n" +
                "            }, {\n" +
                "                name: \"康县\",\n" +
                "                code: \"621224\"\n" +
                "            }, {\n" +
                "                name: \"西和县\",\n" +
                "                code: \"621225\"\n" +
                "            }, {\n" +
                "                name: \"礼县\",\n" +
                "                code: \"621226\"\n" +
                "            }, {\n" +
                "                name: \"徽县\",\n" +
                "                code: \"621227\"\n" +
                "            }, {\n" +
                "                name: \"两当县\",\n" +
                "                code: \"621228\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"临夏回族自治州\",\n" +
                "            code: \"622900\",\n" +
                "            sub: [{\n" +
                "                name: \"临夏市\",\n" +
                "                code: \"622901\"\n" +
                "            }, {\n" +
                "                name: \"临夏县\",\n" +
                "                code: \"622921\"\n" +
                "            }, {\n" +
                "                name: \"康乐县\",\n" +
                "                code: \"622922\"\n" +
                "            }, {\n" +
                "                name: \"永靖县\",\n" +
                "                code: \"622923\"\n" +
                "            }, {\n" +
                "                name: \"广河县\",\n" +
                "                code: \"622924\"\n" +
                "            }, {\n" +
                "                name: \"和政县\",\n" +
                "                code: \"622925\"\n" +
                "            }, {\n" +
                "                name: \"东乡族自治县\",\n" +
                "                code: \"622926\"\n" +
                "            }, {\n" +
                "                name: \"积石山保安族东乡族撒拉族自治县\",\n" +
                "                code: \"622927\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"甘南藏族自治州\",\n" +
                "            code: \"623000\",\n" +
                "            sub: [{\n" +
                "                name: \"合作市\",\n" +
                "                code: \"623001\"\n" +
                "            }, {\n" +
                "                name: \"临潭县\",\n" +
                "                code: \"623021\"\n" +
                "            }, {\n" +
                "                name: \"卓尼县\",\n" +
                "                code: \"623022\"\n" +
                "            }, {\n" +
                "                name: \"舟曲县\",\n" +
                "                code: \"623023\"\n" +
                "            }, {\n" +
                "                name: \"迭部县\",\n" +
                "                code: \"623024\"\n" +
                "            }, {\n" +
                "                name: \"玛曲县\",\n" +
                "                code: \"623025\"\n" +
                "            }, {\n" +
                "                name: \"碌曲县\",\n" +
                "                code: \"623026\"\n" +
                "            }, {\n" +
                "                name: \"夏河县\",\n" +
                "                code: \"623027\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"青海省\",\n" +
                "        code: \"630000\",\n" +
                "        sub: [{\n" +
                "            name: \"西宁市\",\n" +
                "            code: \"630100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"630101\"\n" +
                "            }, {\n" +
                "                name: \"城东区\",\n" +
                "                code: \"630102\"\n" +
                "            }, {\n" +
                "                name: \"城中区\",\n" +
                "                code: \"630103\"\n" +
                "            }, {\n" +
                "                name: \"城西区\",\n" +
                "                code: \"630104\"\n" +
                "            }, {\n" +
                "                name: \"城北区\",\n" +
                "                code: \"630105\"\n" +
                "            }, {\n" +
                "                name: \"大通回族土族自治县\",\n" +
                "                code: \"630121\"\n" +
                "            }, {\n" +
                "                name: \"湟中县\",\n" +
                "                code: \"630122\"\n" +
                "            }, {\n" +
                "                name: \"湟源县\",\n" +
                "                code: \"630123\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"海东市\",\n" +
                "            code: \"630200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"630201\"\n" +
                "            }, {\n" +
                "                name: \"乐都区\",\n" +
                "                code: \"630202\"\n" +
                "            }, {\n" +
                "                name: \"平安县\",\n" +
                "                code: \"630221\"\n" +
                "            }, {\n" +
                "                name: \"民和回族土族自治县\",\n" +
                "                code: \"630222\"\n" +
                "            }, {\n" +
                "                name: \"互助土族自治县\",\n" +
                "                code: \"630223\"\n" +
                "            }, {\n" +
                "                name: \"化隆回族自治县\",\n" +
                "                code: \"630224\"\n" +
                "            }, {\n" +
                "                name: \"循化撒拉族自治县\",\n" +
                "                code: \"630225\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"海北藏族自治州\",\n" +
                "            code: \"632200\",\n" +
                "            sub: [{\n" +
                "                name: \"门源回族自治县\",\n" +
                "                code: \"632221\"\n" +
                "            }, {\n" +
                "                name: \"祁连县\",\n" +
                "                code: \"632222\"\n" +
                "            }, {\n" +
                "                name: \"海晏县\",\n" +
                "                code: \"632223\"\n" +
                "            }, {\n" +
                "                name: \"刚察县\",\n" +
                "                code: \"632224\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"黄南藏族自治州\",\n" +
                "            code: \"632300\",\n" +
                "            sub: [{\n" +
                "                name: \"同仁县\",\n" +
                "                code: \"632321\"\n" +
                "            }, {\n" +
                "                name: \"尖扎县\",\n" +
                "                code: \"632322\"\n" +
                "            }, {\n" +
                "                name: \"泽库县\",\n" +
                "                code: \"632323\"\n" +
                "            }, {\n" +
                "                name: \"河南蒙古族自治县\",\n" +
                "                code: \"632324\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"海南藏族自治州\",\n" +
                "            code: \"632500\",\n" +
                "            sub: [{\n" +
                "                name: \"共和县\",\n" +
                "                code: \"632521\"\n" +
                "            }, {\n" +
                "                name: \"同德县\",\n" +
                "                code: \"632522\"\n" +
                "            }, {\n" +
                "                name: \"贵德县\",\n" +
                "                code: \"632523\"\n" +
                "            }, {\n" +
                "                name: \"兴海县\",\n" +
                "                code: \"632524\"\n" +
                "            }, {\n" +
                "                name: \"贵南县\",\n" +
                "                code: \"632525\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"果洛藏族自治州\",\n" +
                "            code: \"632600\",\n" +
                "            sub: [{\n" +
                "                name: \"玛沁县\",\n" +
                "                code: \"632621\"\n" +
                "            }, {\n" +
                "                name: \"班玛县\",\n" +
                "                code: \"632622\"\n" +
                "            }, {\n" +
                "                name: \"甘德县\",\n" +
                "                code: \"632623\"\n" +
                "            }, {\n" +
                "                name: \"达日县\",\n" +
                "                code: \"632624\"\n" +
                "            }, {\n" +
                "                name: \"久治县\",\n" +
                "                code: \"632625\"\n" +
                "            }, {\n" +
                "                name: \"玛多县\",\n" +
                "                code: \"632626\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"玉树藏族自治州\",\n" +
                "            code: \"632700\",\n" +
                "            sub: [{\n" +
                "                name: \"玉树市\",\n" +
                "                code: \"632701\"\n" +
                "            }, {\n" +
                "                name: \"杂多县\",\n" +
                "                code: \"632722\"\n" +
                "            }, {\n" +
                "                name: \"称多县\",\n" +
                "                code: \"632723\"\n" +
                "            }, {\n" +
                "                name: \"治多县\",\n" +
                "                code: \"632724\"\n" +
                "            }, {\n" +
                "                name: \"囊谦县\",\n" +
                "                code: \"632725\"\n" +
                "            }, {\n" +
                "                name: \"曲麻莱县\",\n" +
                "                code: \"632726\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"海西蒙古族藏族自治州\",\n" +
                "            code: \"632800\",\n" +
                "            sub: [{\n" +
                "                name: \"格尔木市\",\n" +
                "                code: \"632801\"\n" +
                "            }, {\n" +
                "                name: \"德令哈市\",\n" +
                "                code: \"632802\"\n" +
                "            }, {\n" +
                "                name: \"乌兰县\",\n" +
                "                code: \"632821\"\n" +
                "            }, {\n" +
                "                name: \"都兰县\",\n" +
                "                code: \"632822\"\n" +
                "            }, {\n" +
                "                name: \"天峻县\",\n" +
                "                code: \"632823\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"宁夏回族自治区\",\n" +
                "        code: \"640000\",\n" +
                "        sub: [{\n" +
                "            name: \"银川市\",\n" +
                "            code: \"640100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"640101\"\n" +
                "            }, {\n" +
                "                name: \"兴庆区\",\n" +
                "                code: \"640104\"\n" +
                "            }, {\n" +
                "                name: \"西夏区\",\n" +
                "                code: \"640105\"\n" +
                "            }, {\n" +
                "                name: \"金凤区\",\n" +
                "                code: \"640106\"\n" +
                "            }, {\n" +
                "                name: \"永宁县\",\n" +
                "                code: \"640121\"\n" +
                "            }, {\n" +
                "                name: \"贺兰县\",\n" +
                "                code: \"640122\"\n" +
                "            }, {\n" +
                "                name: \"灵武市\",\n" +
                "                code: \"640181\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"石嘴山市\",\n" +
                "            code: \"640200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"640201\"\n" +
                "            }, {\n" +
                "                name: \"大武口区\",\n" +
                "                code: \"640202\"\n" +
                "            }, {\n" +
                "                name: \"惠农区\",\n" +
                "                code: \"640205\"\n" +
                "            }, {\n" +
                "                name: \"平罗县\",\n" +
                "                code: \"640221\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"吴忠市\",\n" +
                "            code: \"640300\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"640301\"\n" +
                "            }, {\n" +
                "                name: \"利通区\",\n" +
                "                code: \"640302\"\n" +
                "            }, {\n" +
                "                name: \"红寺堡区\",\n" +
                "                code: \"640303\"\n" +
                "            }, {\n" +
                "                name: \"盐池县\",\n" +
                "                code: \"640323\"\n" +
                "            }, {\n" +
                "                name: \"同心县\",\n" +
                "                code: \"640324\"\n" +
                "            }, {\n" +
                "                name: \"青铜峡市\",\n" +
                "                code: \"640381\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"固原市\",\n" +
                "            code: \"640400\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"640401\"\n" +
                "            }, {\n" +
                "                name: \"原州区\",\n" +
                "                code: \"640402\"\n" +
                "            }, {\n" +
                "                name: \"西吉县\",\n" +
                "                code: \"640422\"\n" +
                "            }, {\n" +
                "                name: \"隆德县\",\n" +
                "                code: \"640423\"\n" +
                "            }, {\n" +
                "                name: \"泾源县\",\n" +
                "                code: \"640424\"\n" +
                "            }, {\n" +
                "                name: \"彭阳县\",\n" +
                "                code: \"640425\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"中卫市\",\n" +
                "            code: \"640500\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"640501\"\n" +
                "            }, {\n" +
                "                name: \"沙坡头区\",\n" +
                "                code: \"640502\"\n" +
                "            }, {\n" +
                "                name: \"中宁县\",\n" +
                "                code: \"640521\"\n" +
                "            }, {\n" +
                "                name: \"海原县\",\n" +
                "                code: \"640522\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"新疆维吾尔自治区\",\n" +
                "        code: \"650000\",\n" +
                "        sub: [{\n" +
                "            name: \"乌鲁木齐市\",\n" +
                "            code: \"650100\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"650101\"\n" +
                "            }, {\n" +
                "                name: \"天山区\",\n" +
                "                code: \"650102\"\n" +
                "            }, {\n" +
                "                name: \"沙依巴克区\",\n" +
                "                code: \"650103\"\n" +
                "            }, {\n" +
                "                name: \"新市区\",\n" +
                "                code: \"650104\"\n" +
                "            }, {\n" +
                "                name: \"水磨沟区\",\n" +
                "                code: \"650105\"\n" +
                "            }, {\n" +
                "                name: \"头屯河区\",\n" +
                "                code: \"650106\"\n" +
                "            }, {\n" +
                "                name: \"达坂城区\",\n" +
                "                code: \"650107\"\n" +
                "            }, {\n" +
                "                name: \"米东区\",\n" +
                "                code: \"650109\"\n" +
                "            }, {\n" +
                "                name: \"乌鲁木齐县\",\n" +
                "                code: \"650121\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"克拉玛依市\",\n" +
                "            code: \"650200\",\n" +
                "            sub: [{\n" +
                "                name: \"市辖区\",\n" +
                "                code: \"650201\"\n" +
                "            }, {\n" +
                "                name: \"独山子区\",\n" +
                "                code: \"650202\"\n" +
                "            }, {\n" +
                "                name: \"克拉玛依区\",\n" +
                "                code: \"650203\"\n" +
                "            }, {\n" +
                "                name: \"白碱滩区\",\n" +
                "                code: \"650204\"\n" +
                "            }, {\n" +
                "                name: \"乌尔禾区\",\n" +
                "                code: \"650205\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"吐鲁番地区\",\n" +
                "            code: \"652100\",\n" +
                "            sub: [{\n" +
                "                name: \"吐鲁番市\",\n" +
                "                code: \"652101\"\n" +
                "            }, {\n" +
                "                name: \"鄯善县\",\n" +
                "                code: \"652122\"\n" +
                "            }, {\n" +
                "                name: \"托克逊县\",\n" +
                "                code: \"652123\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"哈密地区\",\n" +
                "            code: \"652200\",\n" +
                "            sub: [{\n" +
                "                name: \"哈密市\",\n" +
                "                code: \"652201\"\n" +
                "            }, {\n" +
                "                name: \"巴里坤哈萨克自治县\",\n" +
                "                code: \"652222\"\n" +
                "            }, {\n" +
                "                name: \"伊吾县\",\n" +
                "                code: \"652223\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"昌吉回族自治州\",\n" +
                "            code: \"652300\",\n" +
                "            sub: [{\n" +
                "                name: \"昌吉市\",\n" +
                "                code: \"652301\"\n" +
                "            }, {\n" +
                "                name: \"阜康市\",\n" +
                "                code: \"652302\"\n" +
                "            }, {\n" +
                "                name: \"呼图壁县\",\n" +
                "                code: \"652323\"\n" +
                "            }, {\n" +
                "                name: \"玛纳斯县\",\n" +
                "                code: \"652324\"\n" +
                "            }, {\n" +
                "                name: \"奇台县\",\n" +
                "                code: \"652325\"\n" +
                "            }, {\n" +
                "                name: \"吉木萨尔县\",\n" +
                "                code: \"652327\"\n" +
                "            }, {\n" +
                "                name: \"木垒哈萨克自治县\",\n" +
                "                code: \"652328\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"博尔塔拉蒙古自治州\",\n" +
                "            code: \"652700\",\n" +
                "            sub: [{\n" +
                "                name: \"博乐市\",\n" +
                "                code: \"652701\"\n" +
                "            }, {\n" +
                "                name: \"阿拉山口市\",\n" +
                "                code: \"652702\"\n" +
                "            }, {\n" +
                "                name: \"精河县\",\n" +
                "                code: \"652722\"\n" +
                "            }, {\n" +
                "                name: \"温泉县\",\n" +
                "                code: \"652723\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"巴音郭楞蒙古自治州\",\n" +
                "            code: \"652800\",\n" +
                "            sub: [{\n" +
                "                name: \"库尔勒市\",\n" +
                "                code: \"652801\"\n" +
                "            }, {\n" +
                "                name: \"轮台县\",\n" +
                "                code: \"652822\"\n" +
                "            }, {\n" +
                "                name: \"尉犁县\",\n" +
                "                code: \"652823\"\n" +
                "            }, {\n" +
                "                name: \"若羌县\",\n" +
                "                code: \"652824\"\n" +
                "            }, {\n" +
                "                name: \"且末县\",\n" +
                "                code: \"652825\"\n" +
                "            }, {\n" +
                "                name: \"焉耆回族自治县\",\n" +
                "                code: \"652826\"\n" +
                "            }, {\n" +
                "                name: \"和静县\",\n" +
                "                code: \"652827\"\n" +
                "            }, {\n" +
                "                name: \"和硕县\",\n" +
                "                code: \"652828\"\n" +
                "            }, {\n" +
                "                name: \"博湖县\",\n" +
                "                code: \"652829\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"阿克苏地区\",\n" +
                "            code: \"652900\",\n" +
                "            sub: [{\n" +
                "                name: \"阿克苏市\",\n" +
                "                code: \"652901\"\n" +
                "            }, {\n" +
                "                name: \"温宿县\",\n" +
                "                code: \"652922\"\n" +
                "            }, {\n" +
                "                name: \"库车县\",\n" +
                "                code: \"652923\"\n" +
                "            }, {\n" +
                "                name: \"沙雅县\",\n" +
                "                code: \"652924\"\n" +
                "            }, {\n" +
                "                name: \"新和县\",\n" +
                "                code: \"652925\"\n" +
                "            }, {\n" +
                "                name: \"拜城县\",\n" +
                "                code: \"652926\"\n" +
                "            }, {\n" +
                "                name: \"乌什县\",\n" +
                "                code: \"652927\"\n" +
                "            }, {\n" +
                "                name: \"阿瓦提县\",\n" +
                "                code: \"652928\"\n" +
                "            }, {\n" +
                "                name: \"柯坪县\",\n" +
                "                code: \"652929\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"克孜勒苏柯尔克孜自治州\",\n" +
                "            code: \"653000\",\n" +
                "            sub: [{\n" +
                "                name: \"阿图什市\",\n" +
                "                code: \"653001\"\n" +
                "            }, {\n" +
                "                name: \"阿克陶县\",\n" +
                "                code: \"653022\"\n" +
                "            }, {\n" +
                "                name: \"阿合奇县\",\n" +
                "                code: \"653023\"\n" +
                "            }, {\n" +
                "                name: \"乌恰县\",\n" +
                "                code: \"653024\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"喀什地区\",\n" +
                "            code: \"653100\",\n" +
                "            sub: [{\n" +
                "                name: \"喀什市\",\n" +
                "                code: \"653101\"\n" +
                "            }, {\n" +
                "                name: \"疏附县\",\n" +
                "                code: \"653121\"\n" +
                "            }, {\n" +
                "                name: \"疏勒县\",\n" +
                "                code: \"653122\"\n" +
                "            }, {\n" +
                "                name: \"英吉沙县\",\n" +
                "                code: \"653123\"\n" +
                "            }, {\n" +
                "                name: \"泽普县\",\n" +
                "                code: \"653124\"\n" +
                "            }, {\n" +
                "                name: \"莎车县\",\n" +
                "                code: \"653125\"\n" +
                "            }, {\n" +
                "                name: \"叶城县\",\n" +
                "                code: \"653126\"\n" +
                "            }, {\n" +
                "                name: \"麦盖提县\",\n" +
                "                code: \"653127\"\n" +
                "            }, {\n" +
                "                name: \"岳普湖县\",\n" +
                "                code: \"653128\"\n" +
                "            }, {\n" +
                "                name: \"伽师县\",\n" +
                "                code: \"653129\"\n" +
                "            }, {\n" +
                "                name: \"巴楚县\",\n" +
                "                code: \"653130\"\n" +
                "            }, {\n" +
                "                name: \"塔什库尔干塔吉克自治县\",\n" +
                "                code: \"653131\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"和田地区\",\n" +
                "            code: \"653200\",\n" +
                "            sub: [{\n" +
                "                name: \"和田市\",\n" +
                "                code: \"653201\"\n" +
                "            }, {\n" +
                "                name: \"和田县\",\n" +
                "                code: \"653221\"\n" +
                "            }, {\n" +
                "                name: \"墨玉县\",\n" +
                "                code: \"653222\"\n" +
                "            }, {\n" +
                "                name: \"皮山县\",\n" +
                "                code: \"653223\"\n" +
                "            }, {\n" +
                "                name: \"洛浦县\",\n" +
                "                code: \"653224\"\n" +
                "            }, {\n" +
                "                name: \"策勒县\",\n" +
                "                code: \"653225\"\n" +
                "            }, {\n" +
                "                name: \"于田县\",\n" +
                "                code: \"653226\"\n" +
                "            }, {\n" +
                "                name: \"民丰县\",\n" +
                "                code: \"653227\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"伊犁哈萨克自治州\",\n" +
                "            code: \"654000\",\n" +
                "            sub: [{\n" +
                "                name: \"伊宁市\",\n" +
                "                code: \"654002\"\n" +
                "            }, {\n" +
                "                name: \"奎屯市\",\n" +
                "                code: \"654003\"\n" +
                "            }, {\n" +
                "                name: \"霍尔果斯市\",\n" +
                "                code: \"654004\"\n" +
                "            }, {\n" +
                "                name: \"伊宁县\",\n" +
                "                code: \"654021\"\n" +
                "            }, {\n" +
                "                name: \"察布查尔锡伯自治县\",\n" +
                "                code: \"654022\"\n" +
                "            }, {\n" +
                "                name: \"霍城县\",\n" +
                "                code: \"654023\"\n" +
                "            }, {\n" +
                "                name: \"巩留县\",\n" +
                "                code: \"654024\"\n" +
                "            }, {\n" +
                "                name: \"新源县\",\n" +
                "                code: \"654025\"\n" +
                "            }, {\n" +
                "                name: \"昭苏县\",\n" +
                "                code: \"654026\"\n" +
                "            }, {\n" +
                "                name: \"特克斯县\",\n" +
                "                code: \"654027\"\n" +
                "            }, {\n" +
                "                name: \"尼勒克县\",\n" +
                "                code: \"654028\"\n" +
                "            }, {\n" +
                "                name: \"塔城地区\",\n" +
                "                code: \"654200\"\n" +
                "            }, {\n" +
                "                name: \"塔城市\",\n" +
                "                code: \"654201\"\n" +
                "            }, {\n" +
                "                name: \"乌苏市\",\n" +
                "                code: \"654202\"\n" +
                "            }, {\n" +
                "                name: \"额敏县\",\n" +
                "                code: \"654221\"\n" +
                "            }, {\n" +
                "                name: \"沙湾县\",\n" +
                "                code: \"654223\"\n" +
                "            }, {\n" +
                "                name: \"托里县\",\n" +
                "                code: \"654224\"\n" +
                "            }, {\n" +
                "                name: \"裕民县\",\n" +
                "                code: \"654225\"\n" +
                "            }, {\n" +
                "                name: \"和布克赛尔蒙古自治县\",\n" +
                "                code: \"654226\"\n" +
                "            }, {\n" +
                "                name: \"阿勒泰地区\",\n" +
                "                code: \"654300\"\n" +
                "            }, {\n" +
                "                name: \"阿勒泰市\",\n" +
                "                code: \"654301\"\n" +
                "            }, {\n" +
                "                name: \"布尔津县\",\n" +
                "                code: \"654321\"\n" +
                "            }, {\n" +
                "                name: \"富蕴县\",\n" +
                "                code: \"654322\"\n" +
                "            }, {\n" +
                "                name: \"福海县\",\n" +
                "                code: \"654323\"\n" +
                "            }, {\n" +
                "                name: \"哈巴河县\",\n" +
                "                code: \"654324\"\n" +
                "            }, {\n" +
                "                name: \"青河县\",\n" +
                "                code: \"654325\"\n" +
                "            }, {\n" +
                "                name: \"吉木乃县\",\n" +
                "                code: \"654326\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"自治区直辖县级行政区划\",\n" +
                "            code: \"659000\",\n" +
                "            sub: [{\n" +
                "                name: \"石河子市\",\n" +
                "                code: \"659001\"\n" +
                "            }, {\n" +
                "                name: \"阿拉尔市\",\n" +
                "                code: \"659002\"\n" +
                "            }, {\n" +
                "                name: \"图木舒克市\",\n" +
                "                code: \"659003\"\n" +
                "            }, {\n" +
                "                name: \"五家渠市\",\n" +
                "                code: \"659004\"\n" +
                "            }, {\n" +
                "                name: \"北屯市\",\n" +
                "                code: \"659005\"\n" +
                "            }, {\n" +
                "                name: \"铁门关市\",\n" +
                "                code: \"659006\"\n" +
                "            }, {\n" +
                "                name: \"双河市\",\n" +
                "                code: \"659007\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"台湾省\",\n" +
                "        code: \"710000\",\n" +
                "        sub: [{\n" +
                "            name: \"台北市\",\n" +
                "            code: \"710100\",\n" +
                "            sub: [{\n" +
                "                name: \"松山区\",\n" +
                "                code: \"710101\"\n" +
                "            }, {\n" +
                "                name: \"信义区\",\n" +
                "                code: \"710102\"\n" +
                "            }, {\n" +
                "                name: \"大安区\",\n" +
                "                code: \"710103\"\n" +
                "            }, {\n" +
                "                name: \"中山区\",\n" +
                "                code: \"710104\"\n" +
                "            }, {\n" +
                "                name: \"中正区\",\n" +
                "                code: \"710105\"\n" +
                "            }, {\n" +
                "                name: \"大同区\",\n" +
                "                code: \"710106\"\n" +
                "            }, {\n" +
                "                name: \"万华区\",\n" +
                "                code: \"710107\"\n" +
                "            }, {\n" +
                "                name: \"文山区\",\n" +
                "                code: \"710108\"\n" +
                "            }, {\n" +
                "                name: \"南港区\",\n" +
                "                code: \"710109\"\n" +
                "            }, {\n" +
                "                name: \"内湖区\",\n" +
                "                code: \"710110\"\n" +
                "            }, {\n" +
                "                name: \"士林区\",\n" +
                "                code: \"710111\"\n" +
                "            }, {\n" +
                "                name: \"北投区\",\n" +
                "                code: \"710112\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"高雄市\",\n" +
                "            code: \"710200\",\n" +
                "            sub: [{\n" +
                "                name: \"盐埕区\",\n" +
                "                code: \"710201\"\n" +
                "            }, {\n" +
                "                name: \"鼓山区\",\n" +
                "                code: \"710202\"\n" +
                "            }, {\n" +
                "                name: \"左营区\",\n" +
                "                code: \"710203\"\n" +
                "            }, {\n" +
                "                name: \"楠梓区\",\n" +
                "                code: \"710204\"\n" +
                "            }, {\n" +
                "                name: \"三民区\",\n" +
                "                code: \"710205\"\n" +
                "            }, {\n" +
                "                name: \"新兴区\",\n" +
                "                code: \"710206\"\n" +
                "            }, {\n" +
                "                name: \"前金区\",\n" +
                "                code: \"710207\"\n" +
                "            }, {\n" +
                "                name: \"苓雅区\",\n" +
                "                code: \"710208\"\n" +
                "            }, {\n" +
                "                name: \"前镇区\",\n" +
                "                code: \"710209\"\n" +
                "            }, {\n" +
                "                name: \"旗津区\",\n" +
                "                code: \"710210\"\n" +
                "            }, {\n" +
                "                name: \"小港区\",\n" +
                "                code: \"710211\"\n" +
                "            }, {\n" +
                "                name: \"凤山区\",\n" +
                "                code: \"710212\"\n" +
                "            }, {\n" +
                "                name: \"林园区\",\n" +
                "                code: \"710213\"\n" +
                "            }, {\n" +
                "                name: \"大寮区\",\n" +
                "                code: \"710214\"\n" +
                "            }, {\n" +
                "                name: \"大树区\",\n" +
                "                code: \"710215\"\n" +
                "            }, {\n" +
                "                name: \"大社区\",\n" +
                "                code: \"710216\"\n" +
                "            }, {\n" +
                "                name: \"仁武区\",\n" +
                "                code: \"710217\"\n" +
                "            }, {\n" +
                "                name: \"鸟松区\",\n" +
                "                code: \"710218\"\n" +
                "            }, {\n" +
                "                name: \"冈山区\",\n" +
                "                code: \"710219\"\n" +
                "            }, {\n" +
                "                name: \"桥头区\",\n" +
                "                code: \"710220\"\n" +
                "            }, {\n" +
                "                name: \"燕巢区\",\n" +
                "                code: \"710221\"\n" +
                "            }, {\n" +
                "                name: \"田寮区\",\n" +
                "                code: \"710222\"\n" +
                "            }, {\n" +
                "                name: \"阿莲区\",\n" +
                "                code: \"710223\"\n" +
                "            }, {\n" +
                "                name: \"路竹区\",\n" +
                "                code: \"710224\"\n" +
                "            }, {\n" +
                "                name: \"湖内区\",\n" +
                "                code: \"710225\"\n" +
                "            }, {\n" +
                "                name: \"茄萣区\",\n" +
                "                code: \"710226\"\n" +
                "            }, {\n" +
                "                name: \"永安区\",\n" +
                "                code: \"710227\"\n" +
                "            }, {\n" +
                "                name: \"弥陀区\",\n" +
                "                code: \"710228\"\n" +
                "            }, {\n" +
                "                name: \"梓官区\",\n" +
                "                code: \"710229\"\n" +
                "            }, {\n" +
                "                name: \"旗山区\",\n" +
                "                code: \"710230\"\n" +
                "            }, {\n" +
                "                name: \"美浓区\",\n" +
                "                code: \"710231\"\n" +
                "            }, {\n" +
                "                name: \"六龟区\",\n" +
                "                code: \"710232\"\n" +
                "            }, {\n" +
                "                name: \"甲仙区\",\n" +
                "                code: \"710233\"\n" +
                "            }, {\n" +
                "                name: \"杉林区\",\n" +
                "                code: \"710234\"\n" +
                "            }, {\n" +
                "                name: \"内门区\",\n" +
                "                code: \"710235\"\n" +
                "            }, {\n" +
                "                name: \"茂林区\",\n" +
                "                code: \"710236\"\n" +
                "            }, {\n" +
                "                name: \"桃源区\",\n" +
                "                code: \"710237\"\n" +
                "            }, {\n" +
                "                name: \"那玛夏区\",\n" +
                "                code: \"710238\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"基隆市\",\n" +
                "            code: \"710300\",\n" +
                "            sub: [{\n" +
                "                name: \"中正区\",\n" +
                "                code: \"710301\"\n" +
                "            }, {\n" +
                "                name: \"七堵区\",\n" +
                "                code: \"710302\"\n" +
                "            }, {\n" +
                "                name: \"暖暖区\",\n" +
                "                code: \"710303\"\n" +
                "            }, {\n" +
                "                name: \"仁爱区\",\n" +
                "                code: \"710304\"\n" +
                "            }, {\n" +
                "                name: \"中山区\",\n" +
                "                code: \"710305\"\n" +
                "            }, {\n" +
                "                name: \"安乐区\",\n" +
                "                code: \"710306\"\n" +
                "            }, {\n" +
                "                name: \"信义区\",\n" +
                "                code: \"710307\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"台中市\",\n" +
                "            code: \"710400\",\n" +
                "            sub: [{\n" +
                "                name: \"中区\",\n" +
                "                code: \"710401\"\n" +
                "            }, {\n" +
                "                name: \"东区\",\n" +
                "                code: \"710402\"\n" +
                "            }, {\n" +
                "                name: \"南区\",\n" +
                "                code: \"710403\"\n" +
                "            }, {\n" +
                "                name: \"西区\",\n" +
                "                code: \"710404\"\n" +
                "            }, {\n" +
                "                name: \"北区\",\n" +
                "                code: \"710405\"\n" +
                "            }, {\n" +
                "                name: \"西屯区\",\n" +
                "                code: \"710406\"\n" +
                "            }, {\n" +
                "                name: \"南屯区\",\n" +
                "                code: \"710407\"\n" +
                "            }, {\n" +
                "                name: \"北屯区\",\n" +
                "                code: \"710408\"\n" +
                "            }, {\n" +
                "                name: \"丰原区\",\n" +
                "                code: \"710409\"\n" +
                "            }, {\n" +
                "                name: \"东势区\",\n" +
                "                code: \"710410\"\n" +
                "            }, {\n" +
                "                name: \"大甲区\",\n" +
                "                code: \"710411\"\n" +
                "            }, {\n" +
                "                name: \"清水区\",\n" +
                "                code: \"710412\"\n" +
                "            }, {\n" +
                "                name: \"沙鹿区\",\n" +
                "                code: \"710413\"\n" +
                "            }, {\n" +
                "                name: \"梧栖区\",\n" +
                "                code: \"710414\"\n" +
                "            }, {\n" +
                "                name: \"后里区\",\n" +
                "                code: \"710415\"\n" +
                "            }, {\n" +
                "                name: \"神冈区\",\n" +
                "                code: \"710416\"\n" +
                "            }, {\n" +
                "                name: \"潭子区\",\n" +
                "                code: \"710417\"\n" +
                "            }, {\n" +
                "                name: \"大雅区\",\n" +
                "                code: \"710418\"\n" +
                "            }, {\n" +
                "                name: \"新社区\",\n" +
                "                code: \"710419\"\n" +
                "            }, {\n" +
                "                name: \"石冈区\",\n" +
                "                code: \"710420\"\n" +
                "            }, {\n" +
                "                name: \"外埔区\",\n" +
                "                code: \"710421\"\n" +
                "            }, {\n" +
                "                name: \"大安区\",\n" +
                "                code: \"710422\"\n" +
                "            }, {\n" +
                "                name: \"乌日区\",\n" +
                "                code: \"710423\"\n" +
                "            }, {\n" +
                "                name: \"大肚区\",\n" +
                "                code: \"710424\"\n" +
                "            }, {\n" +
                "                name: \"龙井区\",\n" +
                "                code: \"710425\"\n" +
                "            }, {\n" +
                "                name: \"雾峰区\",\n" +
                "                code: \"710426\"\n" +
                "            }, {\n" +
                "                name: \"太平区\",\n" +
                "                code: \"710427\"\n" +
                "            }, {\n" +
                "                name: \"大里区\",\n" +
                "                code: \"710428\"\n" +
                "            }, {\n" +
                "                name: \"和平区\",\n" +
                "                code: \"710429\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"台南市\",\n" +
                "            code: \"710500\",\n" +
                "            sub: [{\n" +
                "                name: \"东区\",\n" +
                "                code: \"710501\"\n" +
                "            }, {\n" +
                "                name: \"南区\",\n" +
                "                code: \"710502\"\n" +
                "            }, {\n" +
                "                name: \"北区\",\n" +
                "                code: \"710504\"\n" +
                "            }, {\n" +
                "                name: \"安南区\",\n" +
                "                code: \"710506\"\n" +
                "            }, {\n" +
                "                name: \"安平区\",\n" +
                "                code: \"710507\"\n" +
                "            }, {\n" +
                "                name: \"中西区\",\n" +
                "                code: \"710508\"\n" +
                "            }, {\n" +
                "                name: \"新营区\",\n" +
                "                code: \"710509\"\n" +
                "            }, {\n" +
                "                name: \"盐水区\",\n" +
                "                code: \"710510\"\n" +
                "            }, {\n" +
                "                name: \"白河区\",\n" +
                "                code: \"710511\"\n" +
                "            }, {\n" +
                "                name: \"柳营区\",\n" +
                "                code: \"710512\"\n" +
                "            }, {\n" +
                "                name: \"后壁区\",\n" +
                "                code: \"710513\"\n" +
                "            }, {\n" +
                "                name: \"东山区\",\n" +
                "                code: \"710514\"\n" +
                "            }, {\n" +
                "                name: \"麻豆区\",\n" +
                "                code: \"710515\"\n" +
                "            }, {\n" +
                "                name: \"下营区\",\n" +
                "                code: \"710516\"\n" +
                "            }, {\n" +
                "                name: \"六甲区\",\n" +
                "                code: \"710517\"\n" +
                "            }, {\n" +
                "                name: \"官田区\",\n" +
                "                code: \"710518\"\n" +
                "            }, {\n" +
                "                name: \"大内区\",\n" +
                "                code: \"710519\"\n" +
                "            }, {\n" +
                "                name: \"佳里区\",\n" +
                "                code: \"710520\"\n" +
                "            }, {\n" +
                "                name: \"学甲区\",\n" +
                "                code: \"710521\"\n" +
                "            }, {\n" +
                "                name: \"西港区\",\n" +
                "                code: \"710522\"\n" +
                "            }, {\n" +
                "                name: \"七股区\",\n" +
                "                code: \"710523\"\n" +
                "            }, {\n" +
                "                name: \"将军区\",\n" +
                "                code: \"710524\"\n" +
                "            }, {\n" +
                "                name: \"北门区\",\n" +
                "                code: \"710525\"\n" +
                "            }, {\n" +
                "                name: \"新化区\",\n" +
                "                code: \"710526\"\n" +
                "            }, {\n" +
                "                name: \"善化区\",\n" +
                "                code: \"710527\"\n" +
                "            }, {\n" +
                "                name: \"新市区\",\n" +
                "                code: \"710528\"\n" +
                "            }, {\n" +
                "                name: \"安定区\",\n" +
                "                code: \"710529\"\n" +
                "            }, {\n" +
                "                name: \"山上区\",\n" +
                "                code: \"710530\"\n" +
                "            }, {\n" +
                "                name: \"玉井区\",\n" +
                "                code: \"710531\"\n" +
                "            }, {\n" +
                "                name: \"楠西区\",\n" +
                "                code: \"710532\"\n" +
                "            }, {\n" +
                "                name: \"南化区\",\n" +
                "                code: \"710533\"\n" +
                "            }, {\n" +
                "                name: \"左镇区\",\n" +
                "                code: \"710534\"\n" +
                "            }, {\n" +
                "                name: \"仁德区\",\n" +
                "                code: \"710535\"\n" +
                "            }, {\n" +
                "                name: \"归仁区\",\n" +
                "                code: \"710536\"\n" +
                "            }, {\n" +
                "                name: \"关庙区\",\n" +
                "                code: \"710537\"\n" +
                "            }, {\n" +
                "                name: \"龙崎区\",\n" +
                "                code: \"710538\"\n" +
                "            }, {\n" +
                "                name: \"永康区\",\n" +
                "                code: \"710539\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"新竹市\",\n" +
                "            code: \"710600\",\n" +
                "            sub: [{\n" +
                "                name: \"东区\",\n" +
                "                code: \"710601\"\n" +
                "            }, {\n" +
                "                name: \"北区\",\n" +
                "                code: \"710602\"\n" +
                "            }, {\n" +
                "                name: \"香山区\",\n" +
                "                code: \"710603\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"嘉义市\",\n" +
                "            code: \"710700\",\n" +
                "            sub: [{\n" +
                "                name: \"东区\",\n" +
                "                code: \"710701\"\n" +
                "            }, {\n" +
                "                name: \"西区\",\n" +
                "                code: \"710702\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"新北市\",\n" +
                "            code: \"710800\",\n" +
                "            sub: [{\n" +
                "                name: \"板桥区\",\n" +
                "                code: \"710801\"\n" +
                "            }, {\n" +
                "                name: \"三重区\",\n" +
                "                code: \"710802\"\n" +
                "            }, {\n" +
                "                name: \"中和区\",\n" +
                "                code: \"710803\"\n" +
                "            }, {\n" +
                "                name: \"永和区\",\n" +
                "                code: \"710804\"\n" +
                "            }, {\n" +
                "                name: \"新庄区\",\n" +
                "                code: \"710805\"\n" +
                "            }, {\n" +
                "                name: \"新店区\",\n" +
                "                code: \"710806\"\n" +
                "            }, {\n" +
                "                name: \"树林区\",\n" +
                "                code: \"710807\"\n" +
                "            }, {\n" +
                "                name: \"莺歌区\",\n" +
                "                code: \"710808\"\n" +
                "            }, {\n" +
                "                name: \"三峡区\",\n" +
                "                code: \"710809\"\n" +
                "            }, {\n" +
                "                name: \"淡水区\",\n" +
                "                code: \"710810\"\n" +
                "            }, {\n" +
                "                name: \"汐止区\",\n" +
                "                code: \"710811\"\n" +
                "            }, {\n" +
                "                name: \"瑞芳区\",\n" +
                "                code: \"710812\"\n" +
                "            }, {\n" +
                "                name: \"土城区\",\n" +
                "                code: \"710813\"\n" +
                "            }, {\n" +
                "                name: \"芦洲区\",\n" +
                "                code: \"710814\"\n" +
                "            }, {\n" +
                "                name: \"五股区\",\n" +
                "                code: \"710815\"\n" +
                "            }, {\n" +
                "                name: \"泰山区\",\n" +
                "                code: \"710816\"\n" +
                "            }, {\n" +
                "                name: \"林口区\",\n" +
                "                code: \"710817\"\n" +
                "            }, {\n" +
                "                name: \"深坑区\",\n" +
                "                code: \"710818\"\n" +
                "            }, {\n" +
                "                name: \"石碇区\",\n" +
                "                code: \"710819\"\n" +
                "            }, {\n" +
                "                name: \"坪林区\",\n" +
                "                code: \"710820\"\n" +
                "            }, {\n" +
                "                name: \"三芝区\",\n" +
                "                code: \"710821\"\n" +
                "            }, {\n" +
                "                name: \"石门区\",\n" +
                "                code: \"710822\"\n" +
                "            }, {\n" +
                "                name: \"八里区\",\n" +
                "                code: \"710823\"\n" +
                "            }, {\n" +
                "                name: \"平溪区\",\n" +
                "                code: \"710824\"\n" +
                "            }, {\n" +
                "                name: \"双溪区\",\n" +
                "                code: \"710825\"\n" +
                "            }, {\n" +
                "                name: \"贡寮区\",\n" +
                "                code: \"710826\"\n" +
                "            }, {\n" +
                "                name: \"金山区\",\n" +
                "                code: \"710827\"\n" +
                "            }, {\n" +
                "                name: \"万里区\",\n" +
                "                code: \"710828\"\n" +
                "            }, {\n" +
                "                name: \"乌来区\",\n" +
                "                code: \"710829\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"宜兰县\",\n" +
                "            code: \"712200\",\n" +
                "            sub: [{\n" +
                "                name: \"宜兰市\",\n" +
                "                code: \"712201\"\n" +
                "            }, {\n" +
                "                name: \"罗东镇\",\n" +
                "                code: \"712221\"\n" +
                "            }, {\n" +
                "                name: \"苏澳镇\",\n" +
                "                code: \"712222\"\n" +
                "            }, {\n" +
                "                name: \"头城镇\",\n" +
                "                code: \"712223\"\n" +
                "            }, {\n" +
                "                name: \"礁溪乡\",\n" +
                "                code: \"712224\"\n" +
                "            }, {\n" +
                "                name: \"壮围乡\",\n" +
                "                code: \"712225\"\n" +
                "            }, {\n" +
                "                name: \"员山乡\",\n" +
                "                code: \"712226\"\n" +
                "            }, {\n" +
                "                name: \"冬山乡\",\n" +
                "                code: \"712227\"\n" +
                "            }, {\n" +
                "                name: \"五结乡\",\n" +
                "                code: \"712228\"\n" +
                "            }, {\n" +
                "                name: \"三星乡\",\n" +
                "                code: \"712229\"\n" +
                "            }, {\n" +
                "                name: \"大同乡\",\n" +
                "                code: \"712230\"\n" +
                "            }, {\n" +
                "                name: \"南澳乡\",\n" +
                "                code: \"712231\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"桃园县\",\n" +
                "            code: \"712300\",\n" +
                "            sub: [{\n" +
                "                name: \"桃园市\",\n" +
                "                code: \"712301\"\n" +
                "            }, {\n" +
                "                name: \"中坜市\",\n" +
                "                code: \"712302\"\n" +
                "            }, {\n" +
                "                name: \"平镇市\",\n" +
                "                code: \"712303\"\n" +
                "            }, {\n" +
                "                name: \"八德市\",\n" +
                "                code: \"712304\"\n" +
                "            }, {\n" +
                "                name: \"杨梅市\",\n" +
                "                code: \"712305\"\n" +
                "            }, {\n" +
                "                name: \"大溪镇\",\n" +
                "                code: \"712321\"\n" +
                "            }, {\n" +
                "                name: \"芦竹乡\",\n" +
                "                code: \"712323\"\n" +
                "            }, {\n" +
                "                name: \"大园乡\",\n" +
                "                code: \"712324\"\n" +
                "            }, {\n" +
                "                name: \"龟山乡\",\n" +
                "                code: \"712325\"\n" +
                "            }, {\n" +
                "                name: \"龙潭乡\",\n" +
                "                code: \"712327\"\n" +
                "            }, {\n" +
                "                name: \"新屋乡\",\n" +
                "                code: \"712329\"\n" +
                "            }, {\n" +
                "                name: \"观音乡\",\n" +
                "                code: \"712330\"\n" +
                "            }, {\n" +
                "                name: \"复兴乡\",\n" +
                "                code: \"712331\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"新竹县\",\n" +
                "            code: \"712400\",\n" +
                "            sub: [{\n" +
                "                name: \"竹北市\",\n" +
                "                code: \"712401\"\n" +
                "            }, {\n" +
                "                name: \"竹东镇\",\n" +
                "                code: \"712421\"\n" +
                "            }, {\n" +
                "                name: \"新埔镇\",\n" +
                "                code: \"712422\"\n" +
                "            }, {\n" +
                "                name: \"关西镇\",\n" +
                "                code: \"712423\"\n" +
                "            }, {\n" +
                "                name: \"湖口乡\",\n" +
                "                code: \"712424\"\n" +
                "            }, {\n" +
                "                name: \"新丰乡\",\n" +
                "                code: \"712425\"\n" +
                "            }, {\n" +
                "                name: \"芎林乡\",\n" +
                "                code: \"712426\"\n" +
                "            }, {\n" +
                "                name: \"橫山乡\",\n" +
                "                code: \"712427\"\n" +
                "            }, {\n" +
                "                name: \"北埔乡\",\n" +
                "                code: \"712428\"\n" +
                "            }, {\n" +
                "                name: \"宝山乡\",\n" +
                "                code: \"712429\"\n" +
                "            }, {\n" +
                "                name: \"峨眉乡\",\n" +
                "                code: \"712430\"\n" +
                "            }, {\n" +
                "                name: \"尖石乡\",\n" +
                "                code: \"712431\"\n" +
                "            }, {\n" +
                "                name: \"五峰乡\",\n" +
                "                code: \"712432\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"苗栗县\",\n" +
                "            code: \"712500\",\n" +
                "            sub: [{\n" +
                "                name: \"苗栗市\",\n" +
                "                code: \"712501\"\n" +
                "            }, {\n" +
                "                name: \"苑里镇\",\n" +
                "                code: \"712521\"\n" +
                "            }, {\n" +
                "                name: \"通霄镇\",\n" +
                "                code: \"712522\"\n" +
                "            }, {\n" +
                "                name: \"竹南镇\",\n" +
                "                code: \"712523\"\n" +
                "            }, {\n" +
                "                name: \"头份镇\",\n" +
                "                code: \"712524\"\n" +
                "            }, {\n" +
                "                name: \"后龙镇\",\n" +
                "                code: \"712525\"\n" +
                "            }, {\n" +
                "                name: \"卓兰镇\",\n" +
                "                code: \"712526\"\n" +
                "            }, {\n" +
                "                name: \"大湖乡\",\n" +
                "                code: \"712527\"\n" +
                "            }, {\n" +
                "                name: \"公馆乡\",\n" +
                "                code: \"712528\"\n" +
                "            }, {\n" +
                "                name: \"铜锣乡\",\n" +
                "                code: \"712529\"\n" +
                "            }, {\n" +
                "                name: \"南庄乡\",\n" +
                "                code: \"712530\"\n" +
                "            }, {\n" +
                "                name: \"头屋乡\",\n" +
                "                code: \"712531\"\n" +
                "            }, {\n" +
                "                name: \"三义乡\",\n" +
                "                code: \"712532\"\n" +
                "            }, {\n" +
                "                name: \"西湖乡\",\n" +
                "                code: \"712533\"\n" +
                "            }, {\n" +
                "                name: \"造桥乡\",\n" +
                "                code: \"712534\"\n" +
                "            }, {\n" +
                "                name: \"三湾乡\",\n" +
                "                code: \"712535\"\n" +
                "            }, {\n" +
                "                name: \"狮潭乡\",\n" +
                "                code: \"712536\"\n" +
                "            }, {\n" +
                "                name: \"泰安乡\",\n" +
                "                code: \"712537\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"彰化县\",\n" +
                "            code: \"712700\",\n" +
                "            sub: [{\n" +
                "                name: \"彰化市\",\n" +
                "                code: \"712701\"\n" +
                "            }, {\n" +
                "                name: \"鹿港镇\",\n" +
                "                code: \"712721\"\n" +
                "            }, {\n" +
                "                name: \"和美镇\",\n" +
                "                code: \"712722\"\n" +
                "            }, {\n" +
                "                name: \"线西乡\",\n" +
                "                code: \"712723\"\n" +
                "            }, {\n" +
                "                name: \"伸港乡\",\n" +
                "                code: \"712724\"\n" +
                "            }, {\n" +
                "                name: \"福兴乡\",\n" +
                "                code: \"712725\"\n" +
                "            }, {\n" +
                "                name: \"秀水乡\",\n" +
                "                code: \"712726\"\n" +
                "            }, {\n" +
                "                name: \"花坛乡\",\n" +
                "                code: \"712727\"\n" +
                "            }, {\n" +
                "                name: \"芬园乡\",\n" +
                "                code: \"712728\"\n" +
                "            }, {\n" +
                "                name: \"员林镇\",\n" +
                "                code: \"712729\"\n" +
                "            }, {\n" +
                "                name: \"溪湖镇\",\n" +
                "                code: \"712730\"\n" +
                "            }, {\n" +
                "                name: \"田中镇\",\n" +
                "                code: \"712731\"\n" +
                "            }, {\n" +
                "                name: \"大村乡\",\n" +
                "                code: \"712732\"\n" +
                "            }, {\n" +
                "                name: \"埔盐乡\",\n" +
                "                code: \"712733\"\n" +
                "            }, {\n" +
                "                name: \"埔心乡\",\n" +
                "                code: \"712734\"\n" +
                "            }, {\n" +
                "                name: \"永靖乡\",\n" +
                "                code: \"712735\"\n" +
                "            }, {\n" +
                "                name: \"社头乡\",\n" +
                "                code: \"712736\"\n" +
                "            }, {\n" +
                "                name: \"二水乡\",\n" +
                "                code: \"712737\"\n" +
                "            }, {\n" +
                "                name: \"北斗镇\",\n" +
                "                code: \"712738\"\n" +
                "            }, {\n" +
                "                name: \"二林镇\",\n" +
                "                code: \"712739\"\n" +
                "            }, {\n" +
                "                name: \"田尾乡\",\n" +
                "                code: \"712740\"\n" +
                "            }, {\n" +
                "                name: \"埤头乡\",\n" +
                "                code: \"712741\"\n" +
                "            }, {\n" +
                "                name: \"芳苑乡\",\n" +
                "                code: \"712742\"\n" +
                "            }, {\n" +
                "                name: \"大城乡\",\n" +
                "                code: \"712743\"\n" +
                "            }, {\n" +
                "                name: \"竹塘乡\",\n" +
                "                code: \"712744\"\n" +
                "            }, {\n" +
                "                name: \"溪州乡\",\n" +
                "                code: \"712745\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"南投县\",\n" +
                "            code: \"712800\",\n" +
                "            sub: [{\n" +
                "                name: \"南投市\",\n" +
                "                code: \"712801\"\n" +
                "            }, {\n" +
                "                name: \"埔里镇\",\n" +
                "                code: \"712821\"\n" +
                "            }, {\n" +
                "                name: \"草屯镇\",\n" +
                "                code: \"712822\"\n" +
                "            }, {\n" +
                "                name: \"竹山镇\",\n" +
                "                code: \"712823\"\n" +
                "            }, {\n" +
                "                name: \"集集镇\",\n" +
                "                code: \"712824\"\n" +
                "            }, {\n" +
                "                name: \"名间乡\",\n" +
                "                code: \"712825\"\n" +
                "            }, {\n" +
                "                name: \"鹿谷乡\",\n" +
                "                code: \"712826\"\n" +
                "            }, {\n" +
                "                name: \"中寮乡\",\n" +
                "                code: \"712827\"\n" +
                "            }, {\n" +
                "                name: \"鱼池乡\",\n" +
                "                code: \"712828\"\n" +
                "            }, {\n" +
                "                name: \"国姓乡\",\n" +
                "                code: \"712829\"\n" +
                "            }, {\n" +
                "                name: \"水里乡\",\n" +
                "                code: \"712830\"\n" +
                "            }, {\n" +
                "                name: \"信义乡\",\n" +
                "                code: \"712831\"\n" +
                "            }, {\n" +
                "                name: \"仁爱乡\",\n" +
                "                code: \"712832\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"云林县\",\n" +
                "            code: \"712900\",\n" +
                "            sub: [{\n" +
                "                name: \"斗六市\",\n" +
                "                code: \"712901\"\n" +
                "            }, {\n" +
                "                name: \"斗南镇\",\n" +
                "                code: \"712921\"\n" +
                "            }, {\n" +
                "                name: \"虎尾镇\",\n" +
                "                code: \"712922\"\n" +
                "            }, {\n" +
                "                name: \"西螺镇\",\n" +
                "                code: \"712923\"\n" +
                "            }, {\n" +
                "                name: \"土库镇\",\n" +
                "                code: \"712924\"\n" +
                "            }, {\n" +
                "                name: \"北港镇\",\n" +
                "                code: \"712925\"\n" +
                "            }, {\n" +
                "                name: \"古坑乡\",\n" +
                "                code: \"712926\"\n" +
                "            }, {\n" +
                "                name: \"大埤乡\",\n" +
                "                code: \"712927\"\n" +
                "            }, {\n" +
                "                name: \"莿桐乡\",\n" +
                "                code: \"712928\"\n" +
                "            }, {\n" +
                "                name: \"林内乡\",\n" +
                "                code: \"712929\"\n" +
                "            }, {\n" +
                "                name: \"二仑乡\",\n" +
                "                code: \"712930\"\n" +
                "            }, {\n" +
                "                name: \"仑背乡\",\n" +
                "                code: \"712931\"\n" +
                "            }, {\n" +
                "                name: \"麦寮乡\",\n" +
                "                code: \"712932\"\n" +
                "            }, {\n" +
                "                name: \"东势乡\",\n" +
                "                code: \"712933\"\n" +
                "            }, {\n" +
                "                name: \"褒忠乡\",\n" +
                "                code: \"712934\"\n" +
                "            }, {\n" +
                "                name: \"台西乡\",\n" +
                "                code: \"712935\"\n" +
                "            }, {\n" +
                "                name: \"元长乡\",\n" +
                "                code: \"712936\"\n" +
                "            }, {\n" +
                "                name: \"四湖乡\",\n" +
                "                code: \"712937\"\n" +
                "            }, {\n" +
                "                name: \"口湖乡\",\n" +
                "                code: \"712938\"\n" +
                "            }, {\n" +
                "                name: \"水林乡\",\n" +
                "                code: \"712939\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"嘉义县\",\n" +
                "            code: \"713000\",\n" +
                "            sub: [{\n" +
                "                name: \"太保市\",\n" +
                "                code: \"713001\"\n" +
                "            }, {\n" +
                "                name: \"朴子市\",\n" +
                "                code: \"713002\"\n" +
                "            }, {\n" +
                "                name: \"布袋镇\",\n" +
                "                code: \"713023\"\n" +
                "            }, {\n" +
                "                name: \"大林镇\",\n" +
                "                code: \"713024\"\n" +
                "            }, {\n" +
                "                name: \"民雄乡\",\n" +
                "                code: \"713025\"\n" +
                "            }, {\n" +
                "                name: \"溪口乡\",\n" +
                "                code: \"713026\"\n" +
                "            }, {\n" +
                "                name: \"新港乡\",\n" +
                "                code: \"713027\"\n" +
                "            }, {\n" +
                "                name: \"六脚乡\",\n" +
                "                code: \"713028\"\n" +
                "            }, {\n" +
                "                name: \"东石乡\",\n" +
                "                code: \"713029\"\n" +
                "            }, {\n" +
                "                name: \"义竹乡\",\n" +
                "                code: \"713030\"\n" +
                "            }, {\n" +
                "                name: \"鹿草乡\",\n" +
                "                code: \"713031\"\n" +
                "            }, {\n" +
                "                name: \"水上乡\",\n" +
                "                code: \"713032\"\n" +
                "            }, {\n" +
                "                name: \"中埔乡\",\n" +
                "                code: \"713033\"\n" +
                "            }, {\n" +
                "                name: \"竹崎乡\",\n" +
                "                code: \"713034\"\n" +
                "            }, {\n" +
                "                name: \"梅山乡\",\n" +
                "                code: \"713035\"\n" +
                "            }, {\n" +
                "                name: \"番路乡\",\n" +
                "                code: \"713036\"\n" +
                "            }, {\n" +
                "                name: \"大埔乡\",\n" +
                "                code: \"713037\"\n" +
                "            }, {\n" +
                "                name: \"阿里山乡\",\n" +
                "                code: \"713038\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"屏东县\",\n" +
                "            code: \"713300\",\n" +
                "            sub: [{\n" +
                "                name: \"屏东市\",\n" +
                "                code: \"713301\"\n" +
                "            }, {\n" +
                "                name: \"潮州镇\",\n" +
                "                code: \"713321\"\n" +
                "            }, {\n" +
                "                name: \"东港镇\",\n" +
                "                code: \"713322\"\n" +
                "            }, {\n" +
                "                name: \"恒春镇\",\n" +
                "                code: \"713323\"\n" +
                "            }, {\n" +
                "                name: \"万丹乡\",\n" +
                "                code: \"713324\"\n" +
                "            }, {\n" +
                "                name: \"长治乡\",\n" +
                "                code: \"713325\"\n" +
                "            }, {\n" +
                "                name: \"麟洛乡\",\n" +
                "                code: \"713326\"\n" +
                "            }, {\n" +
                "                name: \"九如乡\",\n" +
                "                code: \"713327\"\n" +
                "            }, {\n" +
                "                name: \"里港乡\",\n" +
                "                code: \"713328\"\n" +
                "            }, {\n" +
                "                name: \"盐埔乡\",\n" +
                "                code: \"713329\"\n" +
                "            }, {\n" +
                "                name: \"高树乡\",\n" +
                "                code: \"713330\"\n" +
                "            }, {\n" +
                "                name: \"万峦乡\",\n" +
                "                code: \"713331\"\n" +
                "            }, {\n" +
                "                name: \"内埔乡\",\n" +
                "                code: \"713332\"\n" +
                "            }, {\n" +
                "                name: \"竹田乡\",\n" +
                "                code: \"713333\"\n" +
                "            }, {\n" +
                "                name: \"新埤乡\",\n" +
                "                code: \"713334\"\n" +
                "            }, {\n" +
                "                name: \"枋寮乡\",\n" +
                "                code: \"713335\"\n" +
                "            }, {\n" +
                "                name: \"新园乡\",\n" +
                "                code: \"713336\"\n" +
                "            }, {\n" +
                "                name: \"崁顶乡\",\n" +
                "                code: \"713337\"\n" +
                "            }, {\n" +
                "                name: \"林边乡\",\n" +
                "                code: \"713338\"\n" +
                "            }, {\n" +
                "                name: \"南州乡\",\n" +
                "                code: \"713339\"\n" +
                "            }, {\n" +
                "                name: \"佳冬乡\",\n" +
                "                code: \"713340\"\n" +
                "            }, {\n" +
                "                name: \"琉球乡\",\n" +
                "                code: \"713341\"\n" +
                "            }, {\n" +
                "                name: \"车城乡\",\n" +
                "                code: \"713342\"\n" +
                "            }, {\n" +
                "                name: \"满州乡\",\n" +
                "                code: \"713343\"\n" +
                "            }, {\n" +
                "                name: \"枋山乡\",\n" +
                "                code: \"713344\"\n" +
                "            }, {\n" +
                "                name: \"三地门乡\",\n" +
                "                code: \"713345\"\n" +
                "            }, {\n" +
                "                name: \"雾台乡\",\n" +
                "                code: \"713346\"\n" +
                "            }, {\n" +
                "                name: \"玛家乡\",\n" +
                "                code: \"713347\"\n" +
                "            }, {\n" +
                "                name: \"泰武乡\",\n" +
                "                code: \"713348\"\n" +
                "            }, {\n" +
                "                name: \"来义乡\",\n" +
                "                code: \"713349\"\n" +
                "            }, {\n" +
                "                name: \"春日乡\",\n" +
                "                code: \"713350\"\n" +
                "            }, {\n" +
                "                name: \"狮子乡\",\n" +
                "                code: \"713351\"\n" +
                "            }, {\n" +
                "                name: \"牡丹乡\",\n" +
                "                code: \"713352\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"台东县\",\n" +
                "            code: \"713400\",\n" +
                "            sub: [{\n" +
                "                name: \"台东市\",\n" +
                "                code: \"713401\"\n" +
                "            }, {\n" +
                "                name: \"成功镇\",\n" +
                "                code: \"713421\"\n" +
                "            }, {\n" +
                "                name: \"关山镇\",\n" +
                "                code: \"713422\"\n" +
                "            }, {\n" +
                "                name: \"卑南乡\",\n" +
                "                code: \"713423\"\n" +
                "            }, {\n" +
                "                name: \"鹿野乡\",\n" +
                "                code: \"713424\"\n" +
                "            }, {\n" +
                "                name: \"池上乡\",\n" +
                "                code: \"713425\"\n" +
                "            }, {\n" +
                "                name: \"东河乡\",\n" +
                "                code: \"713426\"\n" +
                "            }, {\n" +
                "                name: \"长滨乡\",\n" +
                "                code: \"713427\"\n" +
                "            }, {\n" +
                "                name: \"太麻里乡\",\n" +
                "                code: \"713428\"\n" +
                "            }, {\n" +
                "                name: \"大武乡\",\n" +
                "                code: \"713429\"\n" +
                "            }, {\n" +
                "                name: \"绿岛乡\",\n" +
                "                code: \"713430\"\n" +
                "            }, {\n" +
                "                name: \"海端乡\",\n" +
                "                code: \"713431\"\n" +
                "            }, {\n" +
                "                name: \"延平乡\",\n" +
                "                code: \"713432\"\n" +
                "            }, {\n" +
                "                name: \"金峰乡\",\n" +
                "                code: \"713433\"\n" +
                "            }, {\n" +
                "                name: \"达仁乡\",\n" +
                "                code: \"713434\"\n" +
                "            }, {\n" +
                "                name: \"兰屿乡\",\n" +
                "                code: \"713435\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"花莲县\",\n" +
                "            code: \"713500\",\n" +
                "            sub: [{\n" +
                "                name: \"花莲市\",\n" +
                "                code: \"713501\"\n" +
                "            }, {\n" +
                "                name: \"凤林镇\",\n" +
                "                code: \"713521\"\n" +
                "            }, {\n" +
                "                name: \"玉里镇\",\n" +
                "                code: \"713522\"\n" +
                "            }, {\n" +
                "                name: \"新城乡\",\n" +
                "                code: \"713523\"\n" +
                "            }, {\n" +
                "                name: \"吉安乡\",\n" +
                "                code: \"713524\"\n" +
                "            }, {\n" +
                "                name: \"寿丰乡\",\n" +
                "                code: \"713525\"\n" +
                "            }, {\n" +
                "                name: \"光复乡\",\n" +
                "                code: \"713526\"\n" +
                "            }, {\n" +
                "                name: \"丰滨乡\",\n" +
                "                code: \"713527\"\n" +
                "            }, {\n" +
                "                name: \"瑞穗乡\",\n" +
                "                code: \"713528\"\n" +
                "            }, {\n" +
                "                name: \"富里乡\",\n" +
                "                code: \"713529\"\n" +
                "            }, {\n" +
                "                name: \"秀林乡\",\n" +
                "                code: \"713530\"\n" +
                "            }, {\n" +
                "                name: \"万荣乡\",\n" +
                "                code: \"713531\"\n" +
                "            }, {\n" +
                "                name: \"卓溪乡\",\n" +
                "                code: \"713532\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"澎湖县\",\n" +
                "            code: \"713600\",\n" +
                "            sub: [{\n" +
                "                name: \"马公市\",\n" +
                "                code: \"713601\"\n" +
                "            }, {\n" +
                "                name: \"湖西乡\",\n" +
                "                code: \"713621\"\n" +
                "            }, {\n" +
                "                name: \"白沙乡\",\n" +
                "                code: \"713622\"\n" +
                "            }, {\n" +
                "                name: \"西屿乡\",\n" +
                "                code: \"713623\"\n" +
                "            }, {\n" +
                "                name: \"望安乡\",\n" +
                "                code: \"713624\"\n" +
                "            }, {\n" +
                "                name: \"七美乡\",\n" +
                "                code: \"713625\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"香港特别行政区\",\n" +
                "        code: \"810000\",\n" +
                "        sub: [{\n" +
                "            name: \"香港岛\",\n" +
                "            code: \"810100\",\n" +
                "            sub: [{\n" +
                "                name: \"中西区\",\n" +
                "                code: \"810101\"\n" +
                "            }, {\n" +
                "                name: \"湾仔区\",\n" +
                "                code: \"810102\"\n" +
                "            }, {\n" +
                "                name: \"东区\",\n" +
                "                code: \"810103\"\n" +
                "            }, {\n" +
                "                name: \"南区\",\n" +
                "                code: \"810104\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"九龙\",\n" +
                "            code: \"810200\",\n" +
                "            sub: [{\n" +
                "                name: \"油尖旺区\",\n" +
                "                code: \"810201\"\n" +
                "            }, {\n" +
                "                name: \"深水埗区\",\n" +
                "                code: \"810202\"\n" +
                "            }, {\n" +
                "                name: \"九龙城区\",\n" +
                "                code: \"810203\"\n" +
                "            }, {\n" +
                "                name: \"黄大仙区\",\n" +
                "                code: \"810204\"\n" +
                "            }, {\n" +
                "                name: \"观塘区\",\n" +
                "                code: \"810205\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"新界\",\n" +
                "            code: \"810300\",\n" +
                "            sub: [{\n" +
                "                name: \"荃湾区\",\n" +
                "                code: \"810301\"\n" +
                "            }, {\n" +
                "                name: \"屯门区\",\n" +
                "                code: \"810302\"\n" +
                "            }, {\n" +
                "                name: \"元朗区\",\n" +
                "                code: \"810303\"\n" +
                "            }, {\n" +
                "                name: \"北区\",\n" +
                "                code: \"810304\"\n" +
                "            }, {\n" +
                "                name: \"大埔区\",\n" +
                "                code: \"810305\"\n" +
                "            }, {\n" +
                "                name: \"西贡区\",\n" +
                "                code: \"810306\"\n" +
                "            }, {\n" +
                "                name: \"沙田区\",\n" +
                "                code: \"810307\"\n" +
                "            }, {\n" +
                "                name: \"葵青区\",\n" +
                "                code: \"810308\"\n" +
                "            }, {\n" +
                "                name: \"离岛区\",\n" +
                "                code: \"810309\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }, {\n" +
                "        name: \"澳门特别行政区\",\n" +
                "        code: \"820000\",\n" +
                "        sub: [{\n" +
                "            name: \"澳门半岛\",\n" +
                "            code: \"820100\",\n" +
                "            sub: [{\n" +
                "                name: \"花地玛堂区\",\n" +
                "                code: \"820101\"\n" +
                "            }, {\n" +
                "                name: \"圣安多尼堂区\",\n" +
                "                code: \"820102\"\n" +
                "            }, {\n" +
                "                name: \"大堂区\",\n" +
                "                code: \"820103\"\n" +
                "            }, {\n" +
                "                name: \"望德堂区\",\n" +
                "                code: \"820104\"\n" +
                "            }, {\n" +
                "                name: \"风顺堂区\",\n" +
                "                code: \"820105\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"氹仔岛\",\n" +
                "            code: \"820200\",\n" +
                "            sub: [{\n" +
                "                name: \"嘉模堂区\",\n" +
                "                code: \"820201\"\n" +
                "            }]\n" +
                "        }, {\n" +
                "            name: \"路环岛\",\n" +
                "            code: \"820300\",\n" +
                "            sub: [{\n" +
                "                name: \"圣方济各堂区\",\n" +
                "                code: \"820301\"\n" +
                "            }]\n" +
                "        }]\n" +
                "    }]";


        //银联信用卡分期 表格转json
        String[] c = b.split("\n");
        System.out.println(c[0]);

        String f = c[0];
        System.out.println(f.split("\t")[1]);
        List<JSONObject> list=new LinkedList<>();
        List<JSONObject> listshi=new LinkedList<>();
        List<JSONObject> listqu=new LinkedList<>();
        String an1="";
        String an2="";
        JSONObject shen=new JSONObject();
        JSONObject shi=new JSONObject();


        for(String d:c){


            String n1=d.split("\t")[1].replace(" ","");
            String id1=d.split("\t")[0].replace(" ","");
            String n2=d.split("\t")[3].replace(" ","");

            String id2=d.split("\t")[2].replace(" ","");
            String id3=d.split("\t")[4].replace(" ","");
            String n3=d.split("\t")[5].replace(" ","");
            if(n1.equals("河北省"))
                System.out.println(111);

            if(!an2.equals(n2)){
                shi.put("sub",listqu);
                if(!an1.equals(n1)){
                    shen.put("sub",listshi);
                    list.add(shen);
                    shen=new JSONObject();
                    listshi=new LinkedList<>();
                    shen.put("name",n1);
                    shen.put("code",id1);
                    an1=n1;
                }
                listqu=new LinkedList<>();
                shi=new JSONObject();
                shi.put("name",n2);
                shi.put("code",id2);
                listshi.add(shi);
                an2=n2;
            }



            JSONObject qu=new JSONObject();
            qu.put("name",n3);
            qu.put("code",id3);
            listqu.add(qu);
        }
        shi.put("sub",listqu);
        shen.put("sub",listshi);
        list.add(shen);

        System.out.println(list.toString());
        *//*for(String d:c){
            String n1=d.split("\t")[1].replace(" ","");
            System.out.println(n1);


            String id1=d.split("\t")[0].replace(" ","");
            String n2=d.split("\t")[3].replace(" ","");
            String id2=d.split("\t")[2].replace(" ","");
            if(n2.equals("西宁市")){
                System.out.println(1234567);
                //System.out.println(a.substring(a.indexOf("name: \""+n1+"\","),a.indexOf("name: \""+n1+"\",")+40));
            }
            try {
                System.out.println(a.substring(a.indexOf("name: \""+n1+"\","),a.indexOf("name: \""+n1+"\",")+40));
                a=a.replace(a.substring(a.indexOf("name: \""+n1+"\","),a.indexOf("name: \""+n1+"\",")+40),"name:\""+n1+"\",code:\""+"\""+id1+"\"");
                a=a.replace(a.substring(a.indexOf("name: \""+n2+"\","),a.indexOf("name: \""+n2+"\",")+40),"name:\""+n2+"\",code:\""+"\""+id2+"\"");

            }catch (Exception e){
                //e.printStackTrace();
            }
            }*//*

    }*/
}
